#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AoC_Simple

#include "Basic.hpp"

#include "ALSV4_CPP_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ABP_AoC_Simple.ABP_AoC_Simple_C.(CLF) CycleBlending
// 0x0070 (0x0070 - 0x0000)
struct ABP_AoC_Simple_C__CLF__CycleBlending final
{
public:
	struct FPoseLink                              I_F;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              I_B;                                               // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              I_LF;                                              // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              I_LB;                                              // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              I_RF;                                              // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              I_RB;                                              // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              _CLF__CycleBlending_0;                             // 0x0060(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_AoC_Simple_C__CLF__CycleBlending;

// Function ABP_AoC_Simple.ABP_AoC_Simple_C.(N) CycleBlending
// 0x0080 (0x0080 - 0x0000)
struct ABP_AoC_Simple_C__N__CycleBlending final
{
public:
	struct FPoseLink                              F;                                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              B;                                                 // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LF;                                                // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LB;                                                // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              RF;                                                // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              RB;                                                // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Sprint;                                            // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              _N__CycleBlending_0;                               // 0x0070(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_AoC_Simple_C__N__CycleBlending;

// Function ABP_AoC_Simple.ABP_AoC_Simple_C.(S) SwimBlending
// 0x0070 (0x0070 - 0x0000)
struct ABP_AoC_Simple_C__S__SwimBlending final
{
public:
	struct FPoseLink                              I_F;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              I_B;                                               // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              I_LF;                                              // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              I_LB;                                              // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              I_RF;                                              // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              I_RB;                                              // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              _S__SwimBlending_0;                                // 0x0060(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_AoC_Simple_C__S__SwimBlending;

// Function ABP_AoC_Simple.ABP_AoC_Simple_C.AimOffsetBehaviors
// 0x0010 (0x0010 - 0x0000)
struct ABP_AoC_Simple_C_AimOffsetBehaviors final
{
public:
	struct FPoseLink                              AimOffsetBehaviors_0;                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_AoC_Simple_C_AimOffsetBehaviors;

// Function ABP_AoC_Simple.ABP_AoC_Simple_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_AoC_Simple_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_AoC_Simple_C_AnimGraph;

// Function ABP_AoC_Simple.ABP_AoC_Simple_C.BaseLayer
// 0x0010 (0x0010 - 0x0000)
struct ABP_AoC_Simple_C_BaseLayer final
{
public:
	struct FPoseLink                              BaseLayer_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_AoC_Simple_C_BaseLayer;

// Function ABP_AoC_Simple.ABP_AoC_Simple_C.BasePoses
// 0x0010 (0x0010 - 0x0000)
struct ABP_AoC_Simple_C_BasePoses final
{
public:
	struct FPoseLink                              BasePoses_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_AoC_Simple_C_BasePoses;

// Function ABP_AoC_Simple.ABP_AoC_Simple_C.ExecuteUbergraph_ABP_AoC_Simple
// 0x0078 (0x0078 - 0x0000)
struct ABP_AoC_Simple_C_ExecuteUbergraph_ABP_AoC_Simple final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FALSDynamicMontageParams               K2Node_MakeStruct_ALSDynamicMontageParams;         // 0x0008(0x0018)(NoDestructor)
	struct FALSDynamicMontageParams               K2Node_MakeStruct_ALSDynamicMontageParams_1;       // 0x0020(0x0018)(NoDestructor)
	struct FALSDynamicMontageParams               K2Node_MakeStruct_ALSDynamicMontageParams_2;       // 0x0038(0x0018)(NoDestructor)
	struct FALSDynamicMontageParams               K2Node_MakeStruct_ALSDynamicMontageParams_3;       // 0x0050(0x0018)(NoDestructor)
	float                                         CallFunc_Montage_Play_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue_2;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_AoC_Simple_C_ExecuteUbergraph_ABP_AoC_Simple;

// Function ABP_AoC_Simple.ABP_AoC_Simple_C.FootIK
// 0x0020 (0x0020 - 0x0000)
struct ABP_AoC_Simple_C_FootIK final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FootIK_0;                                          // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_AoC_Simple_C_FootIK;

// Function ABP_AoC_Simple.ABP_AoC_Simple_C.HandIK
// 0x0020 (0x0020 - 0x0000)
struct ABP_AoC_Simple_C_HandIK final
{
public:
	struct FPoseLink                              InputPose;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HandIK_0;                                          // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_AoC_Simple_C_HandIK;

// Function ABP_AoC_Simple.ABP_AoC_Simple_C.LayerBleding
// 0x0040 (0x0040 - 0x0000)
struct ABP_AoC_Simple_C_LayerBleding final
{
public:
	struct FPoseLink                              BaseLayerInput;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              OverlayLayerInput;                                 // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              BasePosesInput;                                    // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LayerBleding_0;                                    // 0x0030(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_AoC_Simple_C_LayerBleding;

// Function ABP_AoC_Simple.ABP_AoC_Simple_C.OverlayLayer
// 0x0010 (0x0010 - 0x0000)
struct ABP_AoC_Simple_C_OverlayLayer final
{
public:
	struct FPoseLink                              OverlayLayer_0;                                    // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_AoC_Simple_C_OverlayLayer;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
