#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CharacterCreator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"
#include "ABP_CharacterCreator_structs.hpp"
#include "ControlRig_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_CharacterCreator.ABP_CharacterCreator_C
// 0x6500 (0x7650 - 0x1150)
class UABP_CharacterCreator_C final : public UCharacterCreatorAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1150(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_CharacterCreator::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;         // 0x1158(0x0014)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_116C[0x4];                                     // 0x116C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1170(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1178(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1180(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x11A0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x11E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x1210(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x1238(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x1260(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1288(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x12B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x12D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1300(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_10;                  // 0x1328(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27;                   // 0x1378(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26;                   // 0x13C0(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_9;                   // 0x1408(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x1458(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x1480(0x00E8)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_8;                   // 0x1568(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25;                   // 0x15B8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24;                   // 0x1600(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23;                   // 0x1648(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22;                   // 0x1690(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0x16D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x1720(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x1768(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x17B0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x17F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x1840(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_7;                   // 0x1888(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x18D8(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x18F8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x1918(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1960(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x1980(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x19C8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x19E8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1A30(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x1A50(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_6;                   // 0x1A98(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x1AE8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_5;                   // 0x1B30(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x1B80(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x1BC8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1BF0(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x1CD8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_4;                   // 0x1D20(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x1D70(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x1DB8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x1E00(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1E48(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1E90(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1ED8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1F20(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1F68(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3;                   // 0x1FB0(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2000(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2020(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x20E8(0x0050)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x2138(0x0158)(ContainsInstancedReference)
	struct FAnimNode_ModifyBones                  AnimGraphNode_ModifyBones_1;                       // 0x2290(0x0120)()
	struct FAnimNode_ModifyBones                  AnimGraphNode_ModifyBones;                         // 0x23B0(0x0120)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x24D0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x24F0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x2510(0x0080)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x2590(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x25E0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x2660(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x2688(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x26B0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x26D8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x2720(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x2770(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x2798(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x27E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x2810(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x2838(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_15;                       // 0x2860(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_14;                       // 0x2D18(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_13;                       // 0x31D0(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_12;                       // 0x3688(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x3B40(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_11;                       // 0x3B68(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x4020(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_10;                       // 0x4048(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x4500(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_9;                        // 0x4528(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x49E0(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_8;                        // 0x4A08(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x4EC0(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_7;                        // 0x4EE8(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x53A0(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_6;                        // 0x53C8(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_5;                        // 0x5880(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x5D38(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_4;                        // 0x5D60(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x6218(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_3;                        // 0x6240(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x66F8(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_2;                        // 0x6720(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x6BD8(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0x6C00(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x70B8(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x70E0(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x7598(0x0028)()
	double                                        __CustomProperty_Hands_Idle_Offset_00FF3ED54E8B9A689B79FEA410FDE198; // 0x75C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_D1502EB74E8C4D14257490A968DE01CE; // 0x75C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_FA3C4508472C64A3E091CDA9AE51B2D4; // 0x75D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_E2606461427365598D2F338FC404F0E8; // 0x75D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_64ADDAE641485F07DBF3E1A6F793D85A; // 0x75E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_9B894F4341AAD36826793B86E8CE1FA3; // 0x75E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_C7D2CD7A4845BFDAB7AEC489F7093D8A; // 0x75F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_49CEAC464E17174E5B0E2BA26312B545; // 0x75F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_49AF19C5495A757E0C19FB945581538C; // 0x7600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_4DBCEEF94BDE6C7D772CD4862926CBBE; // 0x7608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_065F336445AF049D76FD42A950CEC042; // 0x7610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_452FDAE84B0AF1DB9911BEB3FE228F64; // 0x7618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_8D20A0824E6463916F0850B47246739E; // 0x7620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_CC65A92B4DA23A641286B9A7E82E4A7C; // 0x7628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_16E3B0A341F5664F936FE9BB17AE43B9; // 0x7630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Hands_Idle_Offset_CFF2F411466936C5A4ACABBA60104A81; // 0x7638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IdlePlayRate;                                      // 0x7640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Height_Scale;                                      // 0x7648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterCreator_AnimGraphNode_TransitionResult_48C24EE24C5DB38AD18D2AACD97E379B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterCreator_AnimGraphNode_TransitionResult_627235B54BF45B6ED61625B999FB789C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterCreator_AnimGraphNode_TransitionResult_6D08D84A455C0898CE25FAA244CD1A74();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterCreator_AnimGraphNode_TransitionResult_931864D742775CDE940F2E85570DB8D2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterCreator_AnimGraphNode_TransitionResult_BAD7C720482F251A542D2B897CFC5A34();
	void ExecuteUbergraph_ABP_CharacterCreator(int32 EntryPoint);
	void OnBlendOut_653AAC084559323BDDEB13938CF195BC(class FName NotifyName);
	void OnCompleted_653AAC084559323BDDEB13938CF195BC(class FName NotifyName);
	void OnInterrupted_653AAC084559323BDDEB13938CF195BC(class FName NotifyName);
	void OnNotifyBegin_653AAC084559323BDDEB13938CF195BC(class FName NotifyName);
	void OnNotifyEnd_653AAC084559323BDDEB13938CF195BC(class FName NotifyName);
	void OnRaceChange();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_CharacterCreator_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_CharacterCreator_C")
	}
	static class UABP_CharacterCreator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_CharacterCreator_C>();
	}
};
DUMPER7_ASSERTS_UABP_CharacterCreator_C;

SDK_NAMESPACE_END
