#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AkAudio

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "WwiseResourceLoader_structs.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"


SDK_NAMESPACE_START

// Class AkAudio.AkPortalComponent
// 0x0200 (0x0490 - 0x0290)
class UAkPortalComponent final : public USceneComponent
{
public:
	bool                                          bDynamic;                                          // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAkAcousticPortalState                        InitialState;                                      // 0x0291(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_292[0x2];                                      // 0x0292(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InitialOcclusion;                                  // 0x0294(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ObstructionRefreshInterval;                        // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             ObstructionCollisionChannel;                       // 0x029C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29D[0x1F3];                                    // 0x029D(0x01F3)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisablePortal();
	void EnablePortal();
	void SetDynamic(bool bInDynamic);
	void SetPortalOcclusion(float InPortalOcclusion);

	EAkAcousticPortalState GetCurrentState() const;
	float GetPortalOcclusion() const;
	class UPrimitiveComponent* GetPrimitiveParent() const;
	bool PortalPlacementValid() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkPortalComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkPortalComponent")
	}
	static class UAkPortalComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkPortalComponent>();
	}
};
DUMPER7_ASSERTS_UAkPortalComponent;

// Class AkAudio.AkAcousticPortal
// 0x0010 (0x03B0 - 0x03A0)
class AAkAcousticPortal final : public AVolume
{
public:
	class UAkPortalComponent*                     Portal;                                            // 0x03A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	EAkAcousticPortalState                        InitialState;                                      // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bRequiresStateMigration;                           // 0x03A9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3AA[0x6];                                      // 0x03AA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisablePortal();
	void EnablePortal();

	EAkAcousticPortalState GetCurrentState() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAcousticPortal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAcousticPortal")
	}
	static class AAkAcousticPortal* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAkAcousticPortal>();
	}
};
DUMPER7_ASSERTS_AAkAcousticPortal;

// Class AkAudio.AkAudioType
// 0x0028 (0x0070 - 0x0048)
class UAkAudioType : public UObject
{
public:
	bool                                          bAutoLoad;                                         // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        UserData;                                          // 0x0050(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void LoadData();
	void UnloadData(bool bAsync);

	int32 GetWwiseShortId() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAudioType")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAudioType")
	}
	static class UAkAudioType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioType>();
	}
};
DUMPER7_ASSERTS_UAkAudioType;

// Class AkAudio.AkAcousticTexture
// 0x0020 (0x0090 - 0x0070)
class UAkAcousticTexture final : public UAkAudioType
{
public:
	struct FWwiseAcousticTextureCookedData        AcousticTextureCookedData;                         // 0x0070(0x001C)(Edit, Transient, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAcousticTexture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAcousticTexture")
	}
	static class UAkAcousticTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAcousticTexture>();
	}
};
DUMPER7_ASSERTS_UAkAcousticTexture;

// Class AkAudio.AkAcousticTextureSetComponent
// 0x0020 (0x02B0 - 0x0290)
#pragma pack(push, 0x1)
class SDK_ALIGN(0x10) UAkAcousticTextureSetComponent : public USceneComponent
{
public:
	uint8                                         Pad_290[0x18];                                     // 0x0290(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAcousticTextureSetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAcousticTextureSetComponent")
	}
	static class UAkAcousticTextureSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAcousticTextureSetComponent>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UAkAcousticTextureSetComponent;

// Class AkAudio.AkAmbientSound
// 0x0040 (0x03A8 - 0x0368)
class AAkAmbientSound : public AActor
{
public:
	class UAkAudioEvent*                          AkAudioEvent;                                      // 0x0368(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAkComponent*                           AkComponent;                                       // 0x0370(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	bool                                          StopWhenOwnerIsDestroyed;                          // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoPost;                                          // 0x0379(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_37A[0x2E];                                     // 0x037A(0x002E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void StartAmbientSound();
	void StopAmbientSound();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAmbientSound")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAmbientSound")
	}
	static class AAkAmbientSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAkAmbientSound>();
	}
};
DUMPER7_ASSERTS_AAkAmbientSound;

// Class AkAudio.AkPlatformInitializationSettingsBase
// 0x0000 (0x0048 - 0x0048)
class UAkPlatformInitializationSettingsBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkPlatformInitializationSettingsBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkPlatformInitializationSettingsBase")
	}
	static class UAkPlatformInitializationSettingsBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkPlatformInitializationSettingsBase>();
	}
};
DUMPER7_ASSERTS_UAkPlatformInitializationSettingsBase;

// Class AkAudio.AkAndroidInitializationSettings
// 0x0110 (0x0158 - 0x0048)
class UAkAndroidInitializationSettings final : public UAkPlatformInitializationSettingsBase
{
public:
	struct FAkCommonInitializationSettingsWithSampleRate CommonSettings;                             // 0x0048(0x00B0)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkCommunicationSettingsWithSystemInitialization CommunicationSettings;                   // 0x00F8(0x0020)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkAndroidAdvancedInitializationSettings AdvancedSettings;                                // 0x0118(0x0040)(Edit, Config, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	void MigrateMultiCoreRendering(bool NewValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAndroidInitializationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAndroidInitializationSettings")
	}
	static class UAkAndroidInitializationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAndroidInitializationSettings>();
	}
};
DUMPER7_ASSERTS_UAkAndroidInitializationSettings;

// Class AkAudio.AkPlatformInfo
// 0x0048 (0x0090 - 0x0048)
class UAkPlatformInfo : public UObject
{
public:
	uint8                                         Pad_48[0x48];                                      // 0x0048(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkPlatformInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkPlatformInfo")
	}
	static class UAkPlatformInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkPlatformInfo>();
	}
};
DUMPER7_ASSERTS_UAkPlatformInfo;

// Class AkAudio.AkAndroidPlatformInfo
// 0x0000 (0x0090 - 0x0090)
class UAkAndroidPlatformInfo final : public UAkPlatformInfo
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAndroidPlatformInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAndroidPlatformInfo")
	}
	static class UAkAndroidPlatformInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAndroidPlatformInfo>();
	}
};
DUMPER7_ASSERTS_UAkAndroidPlatformInfo;

// Class AkAudio.AkAudioBank
// 0x0008 (0x0078 - 0x0070)
class UAkAudioBank final : public UAkAudioType
{
public:
	bool                                          AutoLoad;                                          // 0x0070(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAudioBank")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAudioBank")
	}
	static class UAkAudioBank* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioBank>();
	}
};
DUMPER7_ASSERTS_UAkAudioBank;

// Class AkAudio.AkAudioDeviceShareSet
// 0x0010 (0x0080 - 0x0070)
class UAkAudioDeviceShareSet final : public UAkAudioType
{
public:
	struct FWwiseAudioDeviceShareSetCookedData    AudioDeviceShareSetCookedData;                     // 0x0070(0x000C)(Edit, Transient, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAudioDeviceShareSet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAudioDeviceShareSet")
	}
	static class UAkAudioDeviceShareSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioDeviceShareSet>();
	}
};
DUMPER7_ASSERTS_UAkAudioDeviceShareSet;

// Class AkAudio.AkAudioEvent
// 0x0080 (0x00F0 - 0x0070)
class UAkAudioEvent final : public UAkAudioType
{
public:
	float                                         MaxAttenuationRadius;                              // 0x0070(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsInfinite;                                        // 0x0074(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumDuration;                                   // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumDuration;                                   // 0x007C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWwiseLocalizedEventCookedData         EventCookedData;                                   // 0x0080(0x0060)(Edit, Transient, EditConst, NativeAccessSpecifierPublic)
	class UAkAudioBank*                           RequiredBank;                                      // 0x00E0(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 ExecuteAction(const EAkActionOnEventType ActionType, const class AActor* Actor, const int32 PlayingID, const int32 TransitionDuration, const EAkCurveInterpolation FadeCurve);
	int32 PostAtLocation(const struct FVector& Location, const struct FRotator& Orientation, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Callback, const int32 CallbackMask, const class UObject* WorldContextObject);
	int32 PostOnActor(const class AActor* Actor, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Delegate, const int32 CallbackMask, const bool bStopWhenAttachedObjectDestroyed);
	int32 PostOnActorAndWait(const class AActor* Actor, const bool bStopWhenAttachedObjectDestroyed, const struct FLatentActionInfo& LatentActionInfo);
	int32 PostOnComponent(class UAkComponent* Component, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Delegate, const int32 CallbackMask, const bool bStopWhenAttachedObjectDestroyed);
	int32 PostOnComponentAndWait(class UAkComponent* Component, const bool bStopWhenAttachedObjectDestroyed, const struct FLatentActionInfo& LatentActionInfo);
	int32 PostOnGameObject(class UAkGameObject* GameObject, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Delegate, const int32 CallbackMask);
	int32 PostOnGameObjectAndWait(class UAkGameObject* GameObject, const struct FLatentActionInfo& LatentActionInfo);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAudioEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAudioEvent")
	}
	static class UAkAudioEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioEvent>();
	}
};
DUMPER7_ASSERTS_UAkAudioEvent;

// Class AkAudio.AkGameObject
// 0x0020 (0x02B0 - 0x0290)
#pragma pack(push, 0x1)
class SDK_ALIGN(0x10) UAkGameObject : public USceneComponent
{
public:
	float                                         AttenuationScalingFactor;                          // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          AkAudioEvent;                                      // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_2A0[0x2];                                      // 0x02A0(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAttenuationScalingMigrated;                       // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A3[0x5];                                      // 0x02A3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 PostAkEvent(class UAkAudioEvent* AkEvent, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback);
	void PostAkEventAsync(const class UObject* WorldContextObject, class UAkAudioEvent* AkEvent, int32* PlayingID, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback, const struct FLatentActionInfo& LatentInfo);
	int32 PostAssociatedAkEvent(int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback);
	void PostAssociatedAkEventAsync(const class UObject* WorldContextObject, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback, const struct FLatentActionInfo& LatentInfo, int32* PlayingID);
	void SetAttenuationScalingFactor(float InAttenuationScalingFactor);
	void Stop();

	float GetAttenuationScalingFactor() const;
	void GetRTPCValue(class UAkRtpc* RTPCValue, ERTPCValueType InputValueType, float* Value, ERTPCValueType* OutputValueType, const class FString& RTPC, int32 PlayingID) const;
	void SetRTPCValue(class UAkRtpc* RTPCValue, float Value, int32 InterpolationTimeMs, const class FString& RTPC) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkGameObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkGameObject")
	}
	static class UAkGameObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkGameObject>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UAkGameObject;

// Class AkAudio.AkComponent
// 0x01F0 (0x04A0 - 0x02B0)
class UAkComponent : public UAkGameObject
{
public:
	bool                                          bUseSpatialAudio;                                  // 0x02A8(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	EAkCollisionChannel                           OcclusionCollisionChannel;                         // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OcclusionRefreshInterval;                          // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableSpotReflectors;                              // 0x02B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OuterRadius;                                       // 0x02BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InnerRadius;                                       // 0x02C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAuxBus*                              EarlyReflectionAuxBus;                             // 0x02C8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FString                                 EarlyReflectionAuxBusName;                         // 0x02D0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EarlyReflectionBusSendGain;                        // 0x02E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          DrawFirstOrderReflections;                         // 0x02E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawSecondOrderReflections;                        // 0x02E5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawHigherOrderReflections;                        // 0x02E6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawDiffraction;                                   // 0x02E7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StopWhenOwnerDestroyed;                            // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseReverbVolumes;                                 // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2EA[0x1B6];                                    // 0x02EA(0x01B6)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	ECollisionChannel GetOcclusionCollisionChannel();
	int32 PostAkEventAndWaitForEnd(class UAkAudioEvent* AkEvent, const struct FLatentActionInfo& LatentInfo);
	int32 PostAssociatedAkEventAndWaitForEnd(const struct FLatentActionInfo& LatentInfo);
	void PostTrigger(class UAkTrigger* TriggerValue);
	void SetEarlyReflectionsAuxBus(const class FString& AuxBusName);
	void SetEarlyReflectionsVolume(float SendVolume);
	void SetEnableSpotReflectors(bool in_enable);
	void SetGameObjectRadius(float in_outerRadius, float in_innerRadius);
	void SetListeners(const TArray<class UAkComponent*>& Listeners);
	void SetOutputBusVolume(float BusVolume);
	void SetStopWhenOwnerDestroyed(bool bStopWhenOwnerDestroyed);
	void SetSwitch(class UAkSwitchValue* SwitchValue);

	float GetAttenuationRadius() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkComponent")
	}
	static class UAkComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkComponent>();
	}
};
DUMPER7_ASSERTS_UAkComponent;

// Class AkAudio.AkAudioInputComponent
// 0x0030 (0x04D0 - 0x04A0)
#pragma pack(push, 0x1)
class SDK_ALIGN(0x10) UAkAudioInputComponent : public UAkComponent
{
public:
	uint8                                         Pad_4A0[0x28];                                     // 0x04A0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 PostAssociatedAudioInputEvent();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAudioInputComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAudioInputComponent")
	}
	static class UAkAudioInputComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioInputComponent>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UAkAudioInputComponent;

// Class AkAudio.AkAuxBus
// 0x0078 (0x00E8 - 0x0070)
class UAkAuxBus final : public UAkAudioType
{
public:
	float                                         MaxAttenuationRadius;                              // 0x0070(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwiseLocalizedAuxBusCookedData        AuxBusCookedData;                                  // 0x0078(0x0060)(Edit, Transient, NativeAccessSpecifierPublic)
	class UAkAudioBank*                           RequiredBank;                                      // 0x00D8(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAuxBus")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAuxBus")
	}
	static class UAkAuxBus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAuxBus>();
	}
};
DUMPER7_ASSERTS_UAkAuxBus;

// Class AkAudio.AkAssetData
// 0x0028 (0x0070 - 0x0048)
class UAkAssetData final : public UObject
{
public:
	uint8                                         Pad_48[0x28];                                      // 0x0048(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAssetData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAssetData")
	}
	static class UAkAssetData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAssetData>();
	}
};
DUMPER7_ASSERTS_UAkAssetData;

// Class AkAudio.AkAssetPlatformData
// 0x0008 (0x0050 - 0x0048)
class UAkAssetPlatformData final : public UObject
{
public:
	class UAkAssetData*                           CurrentAssetData;                                  // 0x0048(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAssetPlatformData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAssetPlatformData")
	}
	static class UAkAssetPlatformData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAssetPlatformData>();
	}
};
DUMPER7_ASSERTS_UAkAssetPlatformData;

// Class AkAudio.AkMediaAssetData
// 0x0010 (0x0058 - 0x0048)
class UAkMediaAssetData final : public UObject
{
public:
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkMediaAssetData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkMediaAssetData")
	}
	static class UAkMediaAssetData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkMediaAssetData>();
	}
};
DUMPER7_ASSERTS_UAkMediaAssetData;

// Class AkAudio.AkMediaAsset
// 0x0050 (0x0098 - 0x0048)
class UAkMediaAsset : public UObject
{
public:
	TMap<class FString, class UAkMediaAssetData*> MediaAssetDataPerPlatform;                         // 0x0048(0x0050)(Edit, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkMediaAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkMediaAsset")
	}
	static class UAkMediaAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkMediaAsset>();
	}
};
DUMPER7_ASSERTS_UAkMediaAsset;

// Class AkAudio.AkLocalizedMediaAsset
// 0x0000 (0x0098 - 0x0098)
class UAkLocalizedMediaAsset final : public UAkMediaAsset
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkLocalizedMediaAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkLocalizedMediaAsset")
	}
	static class UAkLocalizedMediaAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkLocalizedMediaAsset>();
	}
};
DUMPER7_ASSERTS_UAkLocalizedMediaAsset;

// Class AkAudio.AkExternalMediaAsset
// 0x0000 (0x0098 - 0x0098)
class UAkExternalMediaAsset final : public UAkMediaAsset
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkExternalMediaAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkExternalMediaAsset")
	}
	static class UAkExternalMediaAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkExternalMediaAsset>();
	}
};
DUMPER7_ASSERTS_UAkExternalMediaAsset;

// Class AkAudio.AkFolder
// 0x0000 (0x0070 - 0x0070)
class UAkFolder final : public UAkAudioType
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkFolder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkFolder")
	}
	static class UAkFolder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkFolder>();
	}
};
DUMPER7_ASSERTS_UAkFolder;

// Class AkAudio.DrawPortalComponent
// 0x0000 (0x0570 - 0x0570)
class UDrawPortalComponent final : public UPrimitiveComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DrawPortalComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DrawPortalComponent")
	}
	static class UDrawPortalComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDrawPortalComponent>();
	}
};
DUMPER7_ASSERTS_UDrawPortalComponent;

// Class AkAudio.DrawRoomComponent
// 0x0000 (0x0570 - 0x0570)
class UDrawRoomComponent final : public UPrimitiveComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DrawRoomComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DrawRoomComponent")
	}
	static class UDrawRoomComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDrawRoomComponent>();
	}
};
DUMPER7_ASSERTS_UDrawRoomComponent;

// Class AkAudio.AkEffectShareSet
// 0x0068 (0x00D8 - 0x0070)
class UAkEffectShareSet final : public UAkAudioType
{
public:
	struct FWwiseLocalizedShareSetCookedData      ShareSetCookedData;                                // 0x0070(0x0060)(Edit, Transient, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x8];                                       // 0x00D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkEffectShareSet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkEffectShareSet")
	}
	static class UAkEffectShareSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkEffectShareSet>();
	}
};
DUMPER7_ASSERTS_UAkEffectShareSet;

// Class AkAudio.AkGameplayStatics
// 0x0000 (0x0048 - 0x0048)
class UAkGameplayStatics final : public UBlueprintFunctionLibrary
{
public:
	static void AddOutput(const struct FAkOutputSettings& in_Settings, struct FAkOutputDeviceID* out_DeviceID, TArray<class UAkComponent*>& in_ListenerIDs);
	static void AddOutputCaptureMarker(const class FString& MarkerText);
	static void CancelEventCallback(const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback);
	static void ClearSoundBanksAndMedia();
	static class UObject* GetAkAudioTypeUserData(const class UAkAudioType* Instance, const class UClass* Type);
	static class UAkComponent* GetAkComponent(class USceneComponent* AttachToComponent, bool* ComponentCreated, class FName AttachPointName, const struct FVector& Location, EAttachLocation LocationType);
	static TArray<class FString> GetAvailableAudioCultures();
	static class FString GetCurrentAudioCulture();
	static struct FAkOutdoorsRoomParameters GetCurrentOutdoorsRoomParameters();
	static class UAkComponent* GetOrCreateAkComponent(class USceneComponent* AttachToComponent, bool* ComponentCreated, class FName AttachPointName);
	static void GetRTPCValue(class UAkRtpc* RTPCValue, int32 PlayingID, ERTPCValueType InputValueType, float* Value, ERTPCValueType* OutputValueType, class AActor* Actor);
	static void GetSpeakerAngles(TArray<float>* SpeakerAngles, float* HeightAngle, const class FString& DeviceShareSet);
	static bool IsEditor();
	static bool IsGame(class UObject* WorldContextObject);
	static void LoadInitBank();
	static int32 PostAndWaitForEndOfEvent(class UAkAudioEvent* AkEvent, class AActor* Actor, const struct FLatentActionInfo& LatentInfo, bool bStopWhenAttachedToDestroyed);
	static int32 PostEvent(class UAkAudioEvent* AkEvent, class AActor* Actor, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback, bool bStopWhenAttachedToDestroyed);
	static int32 PostEventAtLocation(class UAkAudioEvent* AkEvent, const struct FVector& Location, const struct FRotator& Orientation, class UObject* WorldContextObject);
	static int32 PostEventOutdoors(class UAkAudioEvent* AkEvent, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback);
	static void PostTrigger(class UAkTrigger* TriggerValue, class AActor* Actor);
	static void RemoveOutput(const struct FAkOutputDeviceID& in_OutputDeviceId);
	static void ReplaceMainOutput(const struct FAkOutputSettings& MainOutputSettings);
	static void ResetOutdoorsRoomParams();
	static void ResetRTPCValue(class UAkRtpc* RTPCValue, int32 InterpolationTimeMs, class AActor* Actor);
	static bool SetActorMixerEffect(const struct FAkUniqueID& InAudioNodeID, const int32 InEffectIndex, const class UAkEffectShareSet* InEffectShareSet);
	static bool SetAuxBusEffect(const class UAkAuxBus* InAuxBus, const int32 InEffectIndex, const class UAkEffectShareSet* InEffectShareSet);
	static void SetBusConfig(const class FString& BusName, EAkChannelConfiguration ChannelConfiguration);
	static bool SetBusEffectByID(const struct FAkUniqueID& InBusID, const int32 InEffectIndex, const class UAkEffectShareSet* InEffectShareSet);
	static bool SetBusEffectByName(const class FString& InBusName, const int32 InEffectIndex, const class UAkEffectShareSet* InEffectShareSet);
	static void SetCurrentAudioCulture(const class FString& AudioCulture, const struct FLatentActionInfo& LatentInfo, class UObject* WorldContextObject);
	static void SetCurrentAudioCultureAsync(const class FString& AudioCulture, const TDelegate<void(bool Succeeded)>& Completed);
	static void SetDiffractionOrder(int32 InDiffractionOrder, bool bInUpdatePaths);
	static void SetDistanceProbe(class AActor* Listener, class AActor* DistanceProbe);
	static void SetGameObjectToPortalObstruction(class UAkComponent* GameObjectAkComponent, class UAkPortalComponent* PortalComponent, float ObstructionValue);
	static void SetLoadBalancingSpread(int32 InNbFrames);
	static void SetMaxDiffractionPaths(int32 InMaxDiffractionPaths, class UAkGameObject* InGameObject);
	static void SetMaxEmitterRoomAuxSends(int32 InMaxEmitterRoomAuxSends);
	static void SetMaxGlobalReflectionPaths(int32 InMaxReflectionPaths);
	static void SetMultipleChannelEmitterPositions(class UAkComponent* GameObjectAkComponent, const TArray<EAkChannelConfiguration>& ChannelMasks, const TArray<struct FTransform>& Positions, EAkMultiPositionType MultiPositionType);
	static void SetMultipleChannelMaskEmitterPositions(class UAkComponent* GameObjectAkComponent, const TArray<struct FAkChannelMask>& ChannelMasks, const TArray<struct FTransform>& Positions, EAkMultiPositionType MultiPositionType);
	static void SetMultiplePositions(class UAkComponent* GameObjectAkComponent, const TArray<struct FTransform>& Positions, EAkMultiPositionType MultiPositionType);
	static void SetNumberOfPrimaryRays(int32 InNbPrimaryRays);
	static void SetOcclusionRefreshInterval(float RefreshInterval, class AActor* Actor);
	static void SetOutdoorsRoomParameters(const struct FAkOutdoorsRoomParameters& InOutdoorsRoomParameters);
	static void SetOutputBusVolume(float BusVolume, class AActor* Actor);
	static bool SetOutputDeviceEffect(const struct FAkOutputDeviceID& InDeviceId, const int32 InEffectIndex, const class UAkEffectShareSet* InEffectShareSet);
	static void SetPanningRule(EPanningRule PanRule);
	static void SetPortalObstructionAndOcclusion(class UAkPortalComponent* PortalComponent, float ObstructionValue, float OcclusionValue);
	static void SetPortalToPortalObstruction(class UAkPortalComponent* PortalComponent0, class UAkPortalComponent* PortalComponent1, float ObstructionValue);
	static void SetReflectionsOrder(int32 Order, bool RefreshPaths);
	static void SetRTPCValue(class UAkRtpc* RTPCValue, float Value, int32 InterpolationTimeMs, class AActor* Actor);
	static void SetSmoothingConstant(float InSmoothingConstantMs, class UAkGameObject* InGameObject);
	static void SetSpeakerAngles(const TArray<float>& SpeakerAngles, float HeightAngle, const class FString& DeviceShareSet);
	static void SetState(class UAkStateValue* StateValue);
	static void SetSwitch(class UAkSwitchValue* SwitchValue, class AActor* Actor);
	static class UAkComponent* SpawnAkComponentAtLocation(class UObject* WorldContextObject, class UAkAudioEvent* AkEvent, const struct FVector& Location, const struct FRotator& Orientation, bool AutoPost, bool AutoDestroy);
	static void StartAllAmbientSounds(class UObject* WorldContextObject);
	static void StartOutputCapture(const class FString& Filename);
	static void StartProfilerCapture(const class FString& Filename);
	static void StopActor(class AActor* Actor);
	static void StopAll();
	static void StopAllAmbientSounds(class UObject* WorldContextObject);
	static void StopOutdoors();
	static void StopOutputCapture();
	static void StopProfilerCapture();
	static void UnloadInitBank();
	static void UseReverbVolumes(bool inUseReverbVolumes, class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkGameplayStatics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkGameplayStatics")
	}
	static class UAkGameplayStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkGameplayStatics>();
	}
};
DUMPER7_ASSERTS_UAkGameplayStatics;

// Class AkAudio.AkCallbackInfo
// 0x0008 (0x0050 - 0x0048)
class UAkCallbackInfo : public UObject
{
public:
	class UAkComponent*                           AkComponent;                                       // 0x0048(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkCallbackInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkCallbackInfo")
	}
	static class UAkCallbackInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkCallbackInfo>();
	}
};
DUMPER7_ASSERTS_UAkCallbackInfo;

// Class AkAudio.AkEventCallbackInfo
// 0x0008 (0x0058 - 0x0050)
class UAkEventCallbackInfo : public UAkCallbackInfo
{
public:
	int32                                         PlayingID;                                         // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EventId;                                           // 0x0054(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkEventCallbackInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkEventCallbackInfo")
	}
	static class UAkEventCallbackInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkEventCallbackInfo>();
	}
};
DUMPER7_ASSERTS_UAkEventCallbackInfo;

// Class AkAudio.AkMIDIEventCallbackInfo
// 0x0010 (0x0068 - 0x0058)
class UAkMIDIEventCallbackInfo final : public UAkEventCallbackInfo
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetCc(struct FAkMidiCc* AsCc);
	uint8 GetChannel();
	bool GetChannelAftertouch(struct FAkMidiChannelAftertouch* AsChannelAftertouch);
	bool GetGeneric(struct FAkMidiGeneric* AsGeneric);
	bool GetNoteAftertouch(struct FAkMidiNoteAftertouch* AsNoteAftertouch);
	bool GetNoteOff(struct FAkMidiNoteOnOff* AsNoteOff);
	bool GetNoteOn(struct FAkMidiNoteOnOff* AsNoteOn);
	bool GetPitchBend(struct FAkMidiPitchBend* AsPitchBend);
	bool GetProgramChange(struct FAkMidiProgramChange* AsProgramChange);
	EAkMidiEventType GetType();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkMIDIEventCallbackInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkMIDIEventCallbackInfo")
	}
	static class UAkMIDIEventCallbackInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkMIDIEventCallbackInfo>();
	}
};
DUMPER7_ASSERTS_UAkMIDIEventCallbackInfo;

// Class AkAudio.AkMarkerCallbackInfo
// 0x0018 (0x0070 - 0x0058)
class UAkMarkerCallbackInfo final : public UAkEventCallbackInfo
{
public:
	int32                                         Identifier;                                        // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Position;                                          // 0x005C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Label;                                             // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkMarkerCallbackInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkMarkerCallbackInfo")
	}
	static class UAkMarkerCallbackInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkMarkerCallbackInfo>();
	}
};
DUMPER7_ASSERTS_UAkMarkerCallbackInfo;

// Class AkAudio.AkDurationCallbackInfo
// 0x0018 (0x0070 - 0x0058)
class UAkDurationCallbackInfo final : public UAkEventCallbackInfo
{
public:
	float                                         Duration;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EstimatedDuration;                                 // 0x005C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AudioNodeID;                                       // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MediaId;                                           // 0x0064(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStreaming;                                        // 0x0068(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkDurationCallbackInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkDurationCallbackInfo")
	}
	static class UAkDurationCallbackInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkDurationCallbackInfo>();
	}
};
DUMPER7_ASSERTS_UAkDurationCallbackInfo;

// Class AkAudio.AkMusicSyncCallbackInfo
// 0x0040 (0x0090 - 0x0050)
class UAkMusicSyncCallbackInfo final : public UAkCallbackInfo
{
public:
	int32                                         PlayingID;                                         // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAkSegmentInfo                         SegmentInfo;                                       // 0x0054(0x0024)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	EAkCallbackType                               MusicSyncType;                                     // 0x0078(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UserCueName;                                       // 0x0080(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkMusicSyncCallbackInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkMusicSyncCallbackInfo")
	}
	static class UAkMusicSyncCallbackInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkMusicSyncCallbackInfo>();
	}
};
DUMPER7_ASSERTS_UAkMusicSyncCallbackInfo;

// Class AkAudio.AkGeometryComponent
// 0x01C0 (0x0470 - 0x02B0)
class UAkGeometryComponent final : public UAkAcousticTextureSetComponent
{
public:
	EAkMeshType                                   MeshType;                                          // 0x02A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LOD;                                               // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WeldingThreshold;                                  // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UMaterialInterface*, struct FAkGeometrySurfaceOverride> StaticMeshSurfaceOverride;    // 0x02B8(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FAkGeometrySurfaceOverride             CollisionMeshSurfaceOverride;                      // 0x0308(0x0018)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnableDiffraction;                                // 0x0320(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableDiffractionOnBoundaryEdges;                 // 0x0321(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBypassPortalSubtraction;                          // 0x0322(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSolid;                                            // 0x0323(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_324[0xC];                                      // 0x0324(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAkGeometryData                        GeometryData;                                      // 0x0330(0x00A0)(NativeAccessSpecifierPrivate)
	TMap<int32, double>                           SurfaceAreas;                                      // 0x03D0(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_420[0x50];                                     // 0x0420(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ConvertMesh();
	bool GetAcousticPropertiesOverride(class UMaterialInterface* InMaterialInterface, struct FAkGeometrySurfaceOverride* OutAcousticPropertiesOverride);
	void RemoveGeometry();
	void SendGeometry();
	bool SetAcousticPropertiesOverride(class UMaterialInterface* InMaterialInterface, const struct FAkGeometrySurfaceOverride& InAcousticPropertiesOverride, struct FAkGeometrySurfaceOverride* OutAcousticPropertiesOverride);
	bool SetAcousticTextureOverride(class UMaterialInterface* InMaterialInterface, class UAkAcousticTexture* InAcousticTexture, struct FAkGeometrySurfaceOverride* OutAcousticPropertiesOverride);
	void SetEnableDiffraction(bool bInEnableDiffraction, bool bInEnableDiffractionOnBoundaryEdges);
	bool SetEnableTransmissionLossOverride(class UMaterialInterface* InMaterialInterface, bool bInEnableTransmissionLossOverride, struct FAkGeometrySurfaceOverride* OutAcousticPropertiesOverride);
	bool SetTransmissionLossOverride(class UMaterialInterface* InMaterialInterface, float InTransmissionLoss, bool bInEnableTransmissionLossOverride, struct FAkGeometrySurfaceOverride* OutAcousticPropertiesOverride);
	void UpdateGeometry();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkGeometryComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkGeometryComponent")
	}
	static class UAkGeometryComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkGeometryComponent>();
	}
};
DUMPER7_ASSERTS_UAkGeometryComponent;

// Class AkAudio.AkGroupValue
// 0x0020 (0x0090 - 0x0070)
class UAkGroupValue : public UAkAudioType
{
public:
	struct FWwiseGroupValueCookedData             GroupValueCookedData;                              // 0x0070(0x0014)(Edit, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        GroupShortId;                                      // 0x0084(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkGroupValue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkGroupValue")
	}
	static class UAkGroupValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkGroupValue>();
	}
};
DUMPER7_ASSERTS_UAkGroupValue;

// Class AkAudio.AkInitBank
// 0x0080 (0x00F0 - 0x0070)
class UAkInitBank final : public UAkAudioType
{
public:
	struct FWwiseInitBankCookedData               InitBankCookedData;                                // 0x0070(0x0078)(Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkInitBank")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkInitBank")
	}
	static class UAkInitBank* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkInitBank>();
	}
};
DUMPER7_ASSERTS_UAkInitBank;

// Class AkAudio.AkIOSInitializationSettings
// 0x0120 (0x0168 - 0x0048)
class UAkIOSInitializationSettings final : public UAkPlatformInitializationSettingsBase
{
public:
	struct FAkCommonInitializationSettingsWithSampleRate CommonSettings;                             // 0x0048(0x00B0)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkAudioSession                        AudioSession;                                      // 0x00F8(0x0010)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FAkCommunicationSettingsWithSystemInitialization CommunicationSettings;                   // 0x0108(0x0020)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkIOSAdvancedInitializationSettings   AdvancedSettings;                                  // 0x0128(0x0040)(Edit, Config, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkIOSInitializationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkIOSInitializationSettings")
	}
	static class UAkIOSInitializationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkIOSInitializationSettings>();
	}
};
DUMPER7_ASSERTS_UAkIOSInitializationSettings;

// Class AkAudio.AkIOSPlatformInfo
// 0x0000 (0x0090 - 0x0090)
class UAkIOSPlatformInfo final : public UAkPlatformInfo
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkIOSPlatformInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkIOSPlatformInfo")
	}
	static class UAkIOSPlatformInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkIOSPlatformInfo>();
	}
};
DUMPER7_ASSERTS_UAkIOSPlatformInfo;

// Class AkAudio.AkLateReverbComponent
// 0x0090 (0x0320 - 0x0290)
class UAkLateReverbComponent final : public USceneComponent
{
public:
	bool                                          bEnable;                                           // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SendLevel;                                         // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeRate;                                          // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Priority;                                          // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoAssignAuxBus;                                  // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAuxBus*                              AuxBus;                                            // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class FString                                 AuxBusName;                                        // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C0[0x8];                                      // 0x02C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAuxBus*                              AuxBusManual;                                      // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_2D0[0x50];                                     // 0x02D0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AssociateAkTextureSetComponent(class UAkAcousticTextureSetComponent* textureSetComponent);
	void SetAutoAssignAuxBus(bool bInEnable);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkLateReverbComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkLateReverbComponent")
	}
	static class UAkLateReverbComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkLateReverbComponent>();
	}
};
DUMPER7_ASSERTS_UAkLateReverbComponent;

// Class AkAudio.AkLinuxArm64InitializationSettings
// 0x0108 (0x0150 - 0x0048)
class UAkLinuxArm64InitializationSettings final : public UAkPlatformInitializationSettingsBase
{
public:
	struct FAkCommonInitializationSettingsWithSampleRate CommonSettings;                             // 0x0048(0x00B0)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkCommunicationSettingsWithSystemInitialization CommunicationSettings;                   // 0x00F8(0x0020)(Edit, Config, NativeAccessSpecifierPublic)
