#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AoCAIControllerBP

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function AoCAIControllerBP.AoCAIControllerBP_C.ExecuteUbergraph_AoCAIControllerBP
// 0x0018 (0x0018 - 0x0000)
struct AoCAIControllerBP_C_ExecuteUbergraph_AoCAIControllerBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_PossessedPawn;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_UnpossessedPawn;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AoCAIControllerBP_C_ExecuteUbergraph_AoCAIControllerBP;

// Function AoCAIControllerBP.AoCAIControllerBP_C.ReceivePossess
// 0x0008 (0x0008 - 0x0000)
struct AoCAIControllerBP_C_ReceivePossess final
{
public:
	class APawn*                                  PossessedPawn;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AoCAIControllerBP_C_ReceivePossess;

// Function AoCAIControllerBP.AoCAIControllerBP_C.ReceiveUnPossess
// 0x0008 (0x0008 - 0x0000)
struct AoCAIControllerBP_C_ReceiveUnPossess final
{
public:
	class APawn*                                  UnpossessedPawn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AoCAIControllerBP_C_ReceiveUnPossess;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
