#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AoCCharacterCreationControllerBP

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function AoCCharacterCreationControllerBP.AoCCharacterCreationControllerBP_C.CharacterSelected
// 0x02B8 (0x02B8 - 0x0000)
struct AoCCharacterCreationControllerBP_C_CharacterSelected final
{
public:
	struct FCharacterInformation                  CharacterInfo;                                     // 0x0000(0x02B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          FromCreate;                                        // 0x02B0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AoCCharacterCreationControllerBP_C_CharacterSelected;

// Function AoCCharacterCreationControllerBP.AoCCharacterCreationControllerBP_C.ExecuteUbergraph_AoCCharacterCreationControllerBP
// 0x0320 (0x0320 - 0x0000)
struct AoCCharacterCreationControllerBP_C_ExecuteUbergraph_AoCCharacterCreationControllerBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x0008(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0020(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable;                              // 0x0038(0x0018)(HasGetValueTypeHash)
	struct FCharacterInformation                  K2Node_CustomEvent_CharacterInfo;                  // 0x0050(0x02B0)()
	bool                                          K2Node_CustomEvent_FromCreate;                     // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0308(0x0018)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AoCCharacterCreationControllerBP_C_ExecuteUbergraph_AoCCharacterCreationControllerBP;

// Function AoCCharacterCreationControllerBP.AoCCharacterCreationControllerBP_C.InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct AoCCharacterCreationControllerBP_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AoCCharacterCreationControllerBP_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0;

// Function AoCCharacterCreationControllerBP.AoCCharacterCreationControllerBP_C.InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct AoCCharacterCreationControllerBP_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AoCCharacterCreationControllerBP_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1;

// Function AoCCharacterCreationControllerBP.AoCCharacterCreationControllerBP_C.InpActEvt_ToggleFPS_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct AoCCharacterCreationControllerBP_C_InpActEvt_ToggleFPS_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AoCCharacterCreationControllerBP_C_InpActEvt_ToggleFPS_K2Node_InputActionEvent_0;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
