#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AoCLoginGameModeBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function AoCLoginGameModeBP.AoCLoginGameModeBP_C.ExecuteUbergraph_AoCLoginGameModeBP
// 0x0038 (0x0038 - 0x0000)
struct AoCLoginGameModeBP_C_ExecuteUbergraph_AoCLoginGameModeBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_Username;                             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_Password;                             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AAoCPlayerController*                   K2Node_Event_PlayerController;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AoCLoginGameModeBP_C_ExecuteUbergraph_AoCLoginGameModeBP;

// Function AoCLoginGameModeBP.AoCLoginGameModeBP_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct AoCLoginGameModeBP_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AoCLoginGameModeBP_C_ReceiveEndPlay;

// Function AoCLoginGameModeBP.AoCLoginGameModeBP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct AoCLoginGameModeBP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AoCLoginGameModeBP_C_ReceiveTick;

// Function AoCLoginGameModeBP.AoCLoginGameModeBP_C.VerifyLoginInformation
// 0x0028 (0x0028 - 0x0000)
struct AoCLoginGameModeBP_C_VerifyLoginInformation final
{
public:
	class FString                                 UserName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Password;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class AAoCPlayerController*                   PlayerController;                                  // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AoCLoginGameModeBP_C_VerifyLoginInformation;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
