#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Automation

#include "Basic.hpp"

#include "InputCore_structs.hpp"


SDK_NAMESPACE_START

// Enum Automation.EAutomationMappingType
// NumValues: 0x0005
enum class EAutomationMappingType : uint8
{
	NotSet                                   = 0,
	Action                                   = 1,
	Axis                                     = 2,
	OverrideKey                              = 3,
	EAutomationMappingType_MAX               = 4,
};

// Enum Automation.EIntrepidInputEvent
// NumValues: 0x0004
enum class EIntrepidInputEvent : uint8
{
	Released                                 = 0,
	Pressed                                  = 1,
	OneShot                                  = 2,
	EIntrepidInputEvent_MAX                  = 3,
};

// ScriptStruct Automation.InputAutomationMapping
// 0x0038 (0x0038 - 0x0000)
struct FInputAutomationMapping final
{
public:
	class FName                                   MappingName;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   OverrideKey;                                       // 0x0010(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           OverrideMultiKeys;                                 // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInputAutomationMapping;

// ScriptStruct Automation.IntrepidInputActionKeyQueueItem
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FIntrepidInputActionKeyQueueItem final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIntrepidInputActionKeyQueueItem;

// ScriptStruct Automation.IntrepidInputActionKey
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FIntrepidInputActionKey final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIntrepidInputActionKey;

SDK_NAMESPACE_END
