#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BinkMediaPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "BinkMediaPlayer_structs.hpp"


SDK_NAMESPACE_START

// Class BinkMediaPlayer.BinkFunctionLibrary
// 0x0000 (0x0048 - 0x0048)
class UBinkFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void Bink_DrawOverlays();
	static struct FTimespan BinkLoadingMovie_GetDuration();
	static struct FTimespan BinkLoadingMovie_GetTime();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BinkFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BinkFunctionLibrary")
	}
	static class UBinkFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBinkFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UBinkFunctionLibrary;

// Class BinkMediaPlayer.BinkMediaPlayer
// 0x00E8 (0x0130 - 0x0048)
class UBinkMediaPlayer final : public UObject
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnMediaClosed;                                     // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& OpenedUrl)> OnMediaOpened;                    // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnMediaReachedEnd;                                 // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPlaybackSuspended;                               // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Looping : 1;                                       // 0x0090(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         StartImmediately : 1;                              // 0x0090(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         DelayedOpen : 1;                                   // 0x0090(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              BinkDestinationUpperLeft;                          // 0x0098(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BinkDestinationLowerRight;                         // 0x00A8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 URL;                                               // 0x00B8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBinkMediaPlayerBinkBufferModes               BinkBufferMode;                                    // 0x00C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBinkMediaPlayerBinkSoundTrack                BinkSoundTrack;                                    // 0x00C9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BinkSoundTrackStart;                               // 0x00CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBinkMediaPlayerBinkDrawStyle                 BinkDrawStyle;                                     // 0x00D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BinkLayerDepth;                                    // 0x00D4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x58];                                      // 0x00D8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CloseUrl();
	void Draw(class UTexture* Texture, bool tonemap, int32 out_nits, float Alpha, bool srgb_decode, bool hdr);
	bool OpenUrl(const class FString& NewURL);
	bool Pause();
	bool Play();
	bool Rewind();
	bool Seek(const struct FTimespan& InTime);
	bool SetLooping(bool InLooping);
	bool SetRate(float Rate);
	void SetVolume(float Rate);
	void Stop();

	bool CanPause() const;
	bool CanPlay() const;
	struct FTimespan GetDuration() const;
	float GetRate() const;
	struct FTimespan GetTime() const;
	class FString GetUrl() const;
	bool IsGotoing() const;
	bool IsInitialized() const;
	bool IsLooping() const;
	bool IsPaused() const;
	bool IsPlaying() const;
	bool IsStopped() const;
	bool SupportsRate(float Rate, bool Unthinned) const;
	bool SupportsScrubbing() const;
	bool SupportsSeeking() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BinkMediaPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BinkMediaPlayer")
	}
	static class UBinkMediaPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBinkMediaPlayer>();
	}
};
DUMPER7_ASSERTS_UBinkMediaPlayer;

// Class BinkMediaPlayer.BinkMediaTexture
// 0x0038 (0x0198 - 0x0160)
class UBinkMediaTexture final : public UTexture
{
public:
	ETextureAddress                               AddressX;                                          // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureAddress                               AddressY;                                          // 0x0161(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBinkMediaPlayer*                       MediaPlayer;                                       // 0x0168(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	EPixelFormat                                  PixelFormat;                                       // 0x0170(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          tonemap;                                           // 0x0171(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OutputNits;                                        // 0x0174(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x0178(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DecodeSRGB;                                        // 0x017C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17D[0x1B];                                     // 0x017D(0x001B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Clear();
	void SetMediaPlayer(class UBinkMediaPlayer* InMediaPlayer);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BinkMediaTexture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BinkMediaTexture")
	}
	static class UBinkMediaTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBinkMediaTexture>();
	}
};
DUMPER7_ASSERTS_UBinkMediaTexture;

// Class BinkMediaPlayer.BinkMoviePlayerSettings
// 0x0030 (0x0078 - 0x0048)
class UBinkMoviePlayerSettings final : public UObject
{
public:
	EBinkMoviePlayerBinkBufferModes               BinkBufferMode;                                    // 0x0048(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBinkMoviePlayerBinkSoundTrack                BinkSoundTrack;                                    // 0x0049(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BinkSoundTrackStart;                               // 0x004C(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BinkDestinationUpperLeft;                          // 0x0050(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BinkDestinationLowerRight;                         // 0x0060(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPixelFormat                                  BinkPixelFormat;                                   // 0x0070(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BinkMoviePlayerSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BinkMoviePlayerSettings")
	}
	static class UBinkMoviePlayerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBinkMoviePlayerSettings>();
	}
};
DUMPER7_ASSERTS_UBinkMoviePlayerSettings;

SDK_NAMESPACE_END
