#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosVehiclesCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// Enum ChaosVehiclesCore.EModuleInputValueType
// NumValues: 0x0006
enum class EModuleInputValueType : uint8
{
	MBoolean                                 = 0,
	MAxis1D                                  = 1,
	MAxis2D                                  = 2,
	MAxis3D                                  = 3,
	MInteger                                 = 4,
	EModuleInputValueType_MAX                = 5,
};

// Enum ChaosVehiclesCore.EFunctionType
// NumValues: 0x0004
enum class EFunctionType : uint8
{
	LinearFunction                           = 0,
	SquaredFunction                          = 1,
	CustomCurve                              = 2,
	EFunctionType_MAX                        = 3,
};

// Enum ChaosVehiclesCore.ESimTreeProcessingOrder
// NumValues: 0x0005
enum class ESimTreeProcessingOrder : uint8
{
	ManualOverride                           = 0,
	LeafFirst                                = 1,
	RootFirst                                = 2,
	LeafFirstBFS                             = 3,
	ESimTreeProcessingOrder_MAX              = 4,
};

// ScriptStruct ChaosVehiclesCore.ModuleInputValue
// 0x0020 (0x0020 - 0x0000)
struct FModuleInputValue final
{
public:
	struct FVector                                Value;                                             // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ValueInt;                                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EModuleInputValueType                         ValueType;                                         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bApplyInputDecay;                                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FModuleInputValue;

// ScriptStruct ChaosVehiclesCore.ModuleInputSetup
// 0x0020 (0x0020 - 0x0000)
struct FModuleInputSetup final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EModuleInputValueType                         Type;                                              // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UDefaultModularVehicleInputModifier> InputModifierClass;                       // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyInputDecay;                                  // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FModuleInputSetup;

// ScriptStruct ChaosVehiclesCore.ModuleInputContainer
// 0x0010 (0x0010 - 0x0000)
struct FModuleInputContainer final
{
public:
	TArray<struct FModuleInputValue>              InputValues;                                       // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FModuleInputContainer;

SDK_NAMESPACE_END
