#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ColorCorrectRegions

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DisplayClusterLightCardExtender_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ColorCorrectRegions.ColorCorrectRegion.SetDistanceFromCenter
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_SetDistanceFromCenter final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_SetDistanceFromCenter;

// Function ColorCorrectRegions.ColorCorrectRegion.SetLatitude
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_SetLatitude final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_SetLatitude;

// Function ColorCorrectRegions.ColorCorrectRegion.SetLongitude
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_SetLongitude final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_SetLongitude;

// Function ColorCorrectRegions.ColorCorrectRegion.SetOrigin
// 0x0060 (0x0060 - 0x0000)
struct ColorCorrectRegion_SetOrigin final
{
public:
	struct FTransform                             InOrigin;                                          // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_SetOrigin;

// Function ColorCorrectRegions.ColorCorrectRegion.SetPitch
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_SetPitch final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_SetPitch;

// Function ColorCorrectRegions.ColorCorrectRegion.SetPositionalParams
// 0x0048 (0x0048 - 0x0000)
struct ColorCorrectRegion_SetPositionalParams final
{
public:
	struct FDisplayClusterPositionalParams        InParams;                                          // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_SetPositionalParams;

// Function ColorCorrectRegions.ColorCorrectRegion.SetRadialOffset
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_SetRadialOffset final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_SetRadialOffset;

// Function ColorCorrectRegions.ColorCorrectRegion.SetScale
// 0x0010 (0x0010 - 0x0000)
struct ColorCorrectRegion_SetScale final
{
public:
	struct FVector2D                              InScale;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_SetScale;

// Function ColorCorrectRegions.ColorCorrectRegion.SetSpin
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_SetSpin final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_SetSpin;

// Function ColorCorrectRegions.ColorCorrectRegion.SetYaw
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_SetYaw final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_SetYaw;

// Function ColorCorrectRegions.ColorCorrectRegion.GetDistanceFromCenter
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_GetDistanceFromCenter final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_GetDistanceFromCenter;

// Function ColorCorrectRegions.ColorCorrectRegion.GetLatitude
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_GetLatitude final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_GetLatitude;

// Function ColorCorrectRegions.ColorCorrectRegion.GetLongitude
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_GetLongitude final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_GetLongitude;

// Function ColorCorrectRegions.ColorCorrectRegion.GetOrigin
// 0x0060 (0x0060 - 0x0000)
struct ColorCorrectRegion_GetOrigin final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_GetOrigin;

// Function ColorCorrectRegions.ColorCorrectRegion.GetPitch
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_GetPitch final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_GetPitch;

// Function ColorCorrectRegions.ColorCorrectRegion.GetPositionalParams
// 0x0048 (0x0048 - 0x0000)
struct ColorCorrectRegion_GetPositionalParams final
{
public:
	struct FDisplayClusterPositionalParams        ReturnValue;                                       // 0x0000(0x0048)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_GetPositionalParams;

// Function ColorCorrectRegions.ColorCorrectRegion.GetRadialOffset
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_GetRadialOffset final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_GetRadialOffset;

// Function ColorCorrectRegions.ColorCorrectRegion.GetScale
// 0x0010 (0x0010 - 0x0000)
struct ColorCorrectRegion_GetScale final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_GetScale;

// Function ColorCorrectRegions.ColorCorrectRegion.GetSpin
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_GetSpin final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_GetSpin;

// Function ColorCorrectRegions.ColorCorrectRegion.GetYaw
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_GetYaw final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ColorCorrectRegion_GetYaw;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
