#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ColorCorrectRegions

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ColorCorrectRegions_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DisplayClusterLightCardExtender_structs.hpp"


SDK_NAMESPACE_START

// Class ColorCorrectRegions.ColorCorrectRegion
// 0x0448 (0x07B0 - 0x0368)
#pragma pack(push, 0x1)
class SDK_ALIGN(0x10) AColorCorrectRegion : public AActor
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           MeshComponents;                                    // 0x0370(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	EColorCorrectRegionsType                      Type;                                              // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CustomStaticMesh;                                  // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	int32                                         Priority;                                          // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Intensity;                                         // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Inner;                                             // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Outer_0;                                           // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Invert;                                            // 0x03A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EColorCorrectRegionTemperatureType            TemperatureType;                                   // 0x03A5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A6[0x2];                                      // 0x03A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temperature;                                       // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Tint;                                              // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColorGradingSettings                  ColorGradingSettings;                              // 0x03B0(0x0290)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          Enabled;                                           // 0x0640(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnablePerActorCC;                                 // 0x0641(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EColorCorrectRegionStencilType                PerActorColorCorrection;                           // 0x0642(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_643[0x5];                                      // 0x0643(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<TSoftObjectPtr<class AActor>>            AffectedActors;                                    // 0x0648(0x0050)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_698[0x50];                                     // 0x0698(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UColorCorrectionInvisibleComponent*     IdentityComponent;                                 // 0x06E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FDisplayClusterPositionalParams        PositionalParams;                                  // 0x06F0(0x0048)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_738[0x8];                                      // 0x0738(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Origin;                                            // 0x0740(0x0060)(Edit, BlueprintVisible, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7A0[0x8];                                      // 0x07A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetDistanceFromCenter(double InValue);
	void SetLatitude(double InValue);
	void SetLongitude(double InValue);
	void SetOrigin(const struct FTransform& InOrigin);
	void SetPitch(double InValue);
	void SetPositionalParams(const struct FDisplayClusterPositionalParams& InParams);
	void SetRadialOffset(double InValue);
	void SetScale(const struct FVector2D& InScale);
	void SetSpin(double InValue);
	void SetYaw(double InValue);

	double GetDistanceFromCenter() const;
	double GetLatitude() const;
	double GetLongitude() const;
	struct FTransform GetOrigin() const;
	double GetPitch() const;
	struct FDisplayClusterPositionalParams GetPositionalParams() const;
	double GetRadialOffset() const;
	struct FVector2D GetScale() const;
	double GetSpin() const;
	double GetYaw() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ColorCorrectRegion")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ColorCorrectRegion")
	}
	static class AColorCorrectRegion* GetDefaultObj()
	{
		return GetDefaultObjImpl<AColorCorrectRegion>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_AColorCorrectRegion;

// Class ColorCorrectRegions.ColorCorrectionRegion
// 0x0000 (0x07B0 - 0x07B0)
class AColorCorrectionRegion final : public AColorCorrectRegion
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ColorCorrectionRegion")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ColorCorrectionRegion")
	}
	static class AColorCorrectionRegion* GetDefaultObj()
	{
		return GetDefaultObjImpl<AColorCorrectionRegion>();
	}
};
DUMPER7_ASSERTS_AColorCorrectionRegion;

// Class ColorCorrectRegions.ColorCorrectionInvisibleComponent
// 0x0000 (0x0570 - 0x0570)
class UColorCorrectionInvisibleComponent final : public UPrimitiveComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ColorCorrectionInvisibleComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ColorCorrectionInvisibleComponent")
	}
	static class UColorCorrectionInvisibleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UColorCorrectionInvisibleComponent>();
	}
};
DUMPER7_ASSERTS_UColorCorrectionInvisibleComponent;

// Class ColorCorrectRegions.ColorCorrectRegionsSubsystem
// 0x0070 (0x00D0 - 0x0060)
class UColorCorrectRegionsSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_60[0x70];                                      // 0x0060(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RefreshStenciIdAssignmentForAllCCR();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ColorCorrectRegionsSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ColorCorrectRegionsSubsystem")
	}
	static class UColorCorrectRegionsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UColorCorrectRegionsSubsystem>();
	}
};
DUMPER7_ASSERTS_UColorCorrectRegionsSubsystem;

// Class ColorCorrectRegions.ColorCorrectionWindow
// 0x0000 (0x07B0 - 0x07B0)
class AColorCorrectionWindow : public AColorCorrectRegion
{
public:
	EColorCorrectWindowType                       WindowType;                                        // 0x07A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7A9[0x7];                                      // 0x07A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ColorCorrectionWindow")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ColorCorrectionWindow")
	}
	static class AColorCorrectionWindow* GetDefaultObj()
	{
		return GetDefaultObjImpl<AColorCorrectionWindow>();
	}
};
DUMPER7_ASSERTS_AColorCorrectionWindow;

// Class ColorCorrectRegions.ColorCorrectWindow
// 0x0000 (0x07B0 - 0x07B0)
class AColorCorrectWindow final : public AColorCorrectionWindow
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ColorCorrectWindow")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ColorCorrectWindow")
	}
	static class AColorCorrectWindow* GetDefaultObj()
	{
		return GetDefaultObjImpl<AColorCorrectWindow>();
	}
};
DUMPER7_ASSERTS_AColorCorrectWindow;

SDK_NAMESPACE_END
