#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CompositeCore

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "DeveloperSettings_classes.hpp"


SDK_NAMESPACE_START

// Class CompositeCore.CompositeCoreSubsystem
// 0x0010 (0x0070 - 0x0060)
class UCompositeCoreSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RegisterPrimitive(class UPrimitiveComponent* InPrimitiveComponent);
	void UnregisterPrimitive(class UPrimitiveComponent* InPrimitiveComponent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CompositeCoreSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CompositeCoreSubsystem")
	}
	static class UCompositeCoreSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompositeCoreSubsystem>();
	}
};
DUMPER7_ASSERTS_UCompositeCoreSubsystem;

// Class CompositeCore.HoldoutCompositeComponent
// 0x0010 (0x02A0 - 0x0290)
class UHoldoutCompositeComponent final : public USceneComponent
{
public:
	bool                                          bIsEnabled;                                        // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_291[0xF];                                      // 0x0291(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetEnabled(bool bInEnabled);

	bool IsEnabled() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoldoutCompositeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoldoutCompositeComponent")
	}
	static class UHoldoutCompositeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoldoutCompositeComponent>();
	}
};
DUMPER7_ASSERTS_UHoldoutCompositeComponent;

// Class CompositeCore.CompositeCorePluginSettings
// 0x0088 (0x00E0 - 0x0058)
class UCompositeCorePluginSettings final : public UDeveloperSettings
{
public:
	uint8                                         bApplyPreExposure : 1;                             // 0x0058(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bApplyFXAA : 1;                                    // 0x0058(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSoftClassPath>                 DisabledPrimitiveClasses;                          // 0x0060(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FSoftClassPath>                 AllowedComponentClasses;                           // 0x0070(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	int32                                         SceneViewExtensionPriority;                        // 0x0080(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x5C];                                      // 0x0084(0x005C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CompositeCorePluginSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CompositeCorePluginSettings")
	}
	static class UCompositeCorePluginSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompositeCorePluginSettings>();
	}
};
DUMPER7_ASSERTS_UCompositeCorePluginSettings;

SDK_NAMESPACE_END
