#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CR_PC_MASTER_Universal_Headlook

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_classes.hpp"


SDK_NAMESPACE_START

// RigVMBlueprintGeneratedClass CR_PC_MASTER_Universal_Headlook.CR_PC_MASTER_Universal_Headlook_C
// 0x0048 (0x0BD8 - 0x0B90)
class UCR_PC_MASTER_Universal_Headlook_C final : public UControlRig
{
public:
	bool                                          ShouldDoHeadLook;                                  // 0x0B90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAiming;                                          // 0x0B91(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B92[0x6];                                      // 0x0B92(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                WorldLookAtLocation;                               // 0x0B98(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CRLookAtLocation;                                  // 0x0BB0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LOD_Level;                                         // 0x0BC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BCC[0x4];                                      // 0x0BCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Weight_From_Anim;                                  // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CR_PC_MASTER_Universal_Headlook_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CR_PC_MASTER_Universal_Headlook_C")
	}
	static class UCR_PC_MASTER_Universal_Headlook_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCR_PC_MASTER_Universal_Headlook_C>();
	}
};
DUMPER7_ASSERTS_UCR_PC_MASTER_Universal_Headlook_C;

SDK_NAMESPACE_END
