#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DesignDataPlugin

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "DesignDataPlugin_structs.hpp"


SDK_NAMESPACE_START

// Class DesignDataPlugin.AocExpressionSubsystem
// 0x0018 (0x0068 - 0x0050)
class UAocExpressionSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AocExpressionSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AocExpressionSubsystem")
	}
	static class UAocExpressionSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAocExpressionSubsystem>();
	}
};
DUMPER7_ASSERTS_UAocExpressionSubsystem;

// Class DesignDataPlugin.AocExpressionTestContexts
// 0x0040 (0x0088 - 0x0048)
class UAocExpressionTestContexts final : public UObject
{
public:
	class FString                                 PlayerExpression;                                  // 0x0048(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AbilitySystemExpression;                           // 0x0058(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AbilityEventExpression;                            // 0x0068(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EffectExpression;                                  // 0x0078(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AocExpressionTestContexts")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AocExpressionTestContexts")
	}
	static class UAocExpressionTestContexts* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAocExpressionTestContexts>();
	}
};
DUMPER7_ASSERTS_UAocExpressionTestContexts;

// Class DesignDataPlugin.CachedDesignDataAsset
// 0x0018 (0x0068 - 0x0050)
class UCachedDesignDataAsset final : public UDataAsset
{
public:
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CachedDesignDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CachedDesignDataAsset")
	}
	static class UCachedDesignDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCachedDesignDataAsset>();
	}
};
DUMPER7_ASSERTS_UCachedDesignDataAsset;

// Class DesignDataPlugin.DesignDataManagerBase
// 0x02B8 (0x0300 - 0x0048)
class UDesignDataManagerBase : public UObject
{
public:
	uint8                                         Pad_48[0x128];                                     // 0x0048(0x0128)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int64, struct FDesignDataTypeDef>        DesignDataTypeMap;                                 // 0x0170(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C0[0x138];                                    // 0x01C0(0x0138)(Fixing Size After Last Property [ Dumper-7 ])
	class URecordEditCache*                       EditCache;                                         // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	void Initialize();
	void OnDesignDataProviderConnected();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DesignDataManagerBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DesignDataManagerBase")
	}
	static class UDesignDataManagerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesignDataManagerBase>();
	}
};
DUMPER7_ASSERTS_UDesignDataManagerBase;

// Class DesignDataPlugin.DesignDataManager
// 0x0000 (0x0300 - 0x0300)
class UDesignDataManager : public UDesignDataManagerBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DesignDataManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DesignDataManager")
	}
	static class UDesignDataManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesignDataManager>();
	}
};
DUMPER7_ASSERTS_UDesignDataManager;

// Class DesignDataPlugin.RecordEditCache
// 0x0170 (0x01B8 - 0x0048)
class URecordEditCache final : public UObject
{
public:
	uint8                                         Pad_48[0x170];                                     // 0x0048(0x0170)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RecordEditCache")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RecordEditCache")
	}
	static class URecordEditCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<URecordEditCache>();
	}
};
DUMPER7_ASSERTS_URecordEditCache;

// Class DesignDataPlugin.PropertyMappingInfo
// 0x0028 (0x0070 - 0x0048)
class UPropertyMappingInfo final : public UObject
{
public:
	EPropertyMappingAction                        Action;                                            // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OldProperty;                                       // 0x0050(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class FString> GetOldPropertyOptions() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyMappingInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyMappingInfo")
	}
	static class UPropertyMappingInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyMappingInfo>();
	}
};
DUMPER7_ASSERTS_UPropertyMappingInfo;

SDK_NAMESPACE_END
