#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DesignDataPlugin

#include "Basic.hpp"


SDK_NAMESPACE_START

// Enum DesignDataPlugin.EDoltDesignDataProviderTask
// NumValues: 0x0008
enum class EDoltDesignDataProviderTask : uint32
{
	None                                     = 0,
	Conflict                                 = 1,
	CheckoutBranch                           = 2,
	MergeIntoMain                            = 3,
	MergeAndSyncChanges                      = 4,
	Revert                                   = 5,
	CreateBranch                             = 6,
	EDoltDesignDataProviderTask_MAX          = 7,
};

// Enum DesignDataPlugin.EExpressionResultType
// NumValues: 0x000B
enum class EExpressionResultType : uint8
{
	Unknown                                  = 0,
	Boolean                                  = 1,
	Integer                                  = 2,
	Float                                    = 3,
	Vector                                   = 4,
	VectorArray                              = 5,
	String                                   = 6,
	StringArray                              = 7,
	Guid                                     = 8,
	GuidArray                                = 9,
	EExpressionResultType_MAX                = 10,
};

// Enum DesignDataPlugin.EExpressionContextIdentifier
// NumValues: 0x0065
enum class EExpressionContextIdentifier : uint8
{
	PlayerGuid                               = 0,
	SourceLocation                           = 1,
	TargetLocation                           = 2,
	SourceNode                               = 3,
	TargetNode                               = 4,
	InteractionTargetGuid                    = 5,
	TargetGuid                               = 6,
	IterationGuid                            = 7,
	StartTemporaryWeakPointerIds             = 8,
	EventInstanceGuid                        = 9,
	EventStageRecordGuid                     = 10,
	EventObjectiveRecordGuid                 = 11,
	EventRecordGuid                          = 12,
	EventChallengeRating                     = 13,
	NarrativeContentGuid                     = 14,
	Source                                   = 15,
	Target                                   = 16,
	Owner                                    = 17,
	Instigator                               = 18,
	AbilityGuid                              = 19,
	ConsumedAbilityGuid                      = 20,
	EffectGuid                               = 21,
	EffectInstigator                         = 22,
	TickCount                                = 23,
	HitEvent                                 = 24,
	HitInProgress                            = 25,
	EffectInProgressRecordGuid               = 26,
	AbilityInstanceId                        = 27,
	FallDistanceAmount                       = 28,
	FallingVelocity                          = 29,
	FallTimeAtTerminalVelocity               = 30,
	NodeInstance                             = 31,
	PropertyOwnershipStatus                  = 32,
	FreeholdEstate                           = 33,
	VoteRatio                                = 34,
	CombatRegister1                          = 35,
	CombatRegister2                          = 36,
	CombatRegister3                          = 37,
	CombatRegister4                          = 38,
	CombatRegister5                          = 39,
	CombatRegister6                          = 40,
	CombatRegister7                          = 41,
	CombatRegister8                          = 42,
	CombatRegister9                          = 43,
	CombatRegister10                         = 44,
	StatRunningTotal                         = 45,
	AIIntelligenceComponent                  = 46,
	OwnerBeginPlayTime                       = 47,
	BehaviorRootStartTime                    = 48,
	BehaviorNodeStartTime                    = 49,
	BehaviorNodeCompletionTime               = 50,
	BehaviorNodeAbortionTime                 = 51,
	BehaviorNodeFinishedTime                 = 52,
	ItemRecordGuid                           = 53,
	CurrencyTierRecordGuid                   = 54,
	StorageMaxStackSizeStat                  = 55,
	GatheringBaseDuration                    = 56,
	RecipeBaseDuration                       = 57,
	RecipeQuality                            = 58,
	RecipeBaseCost                           = 59,
	ItemQuality                              = 60,
	ItemRarity                               = 61,
	CraftedItemRarity                        = 62,
	GatherableRarity                         = 63,
	ActivatedItemRarity                      = 64,
	ActivatedItemQuality                     = 65,
	ActivatedItemGuid                        = 66,
	CertificationTier                        = 67,
	MaxDurability                            = 68,
	ItemGrade                                = 69,
	EnchantmentBaseCost                      = 70,
	RawAdventuringExperience                 = 71,
	AdjustedAdventuringExperience            = 72,
	BiomeType                                = 73,
	RandomSeed                               = 74,
	RecordGuid                               = 75,
	RecordTypeId                             = 76,
	NPCLevel                                 = 77,
	PlayerLevel                              = 78,
	RewardQuantity                           = 79,
	OwnerPointer                             = 80,
	IntrepidAuthority                        = 81,
	LootMaxPlayerLevel                       = 82,
	LootAverageLuckPlayerStat                = 83,
	ElapsedTime                              = 84,
	DeclaringOrgPhasePoints                  = 85,
	TargetOrgPhasePoints                     = 86,
	DeclaringOrgTotalPoints                  = 87,
	TargetOrgTotalPoints                     = 88,
	WarGuid                                  = 89,
	CityNodeProvider                         = 90,
	AverageRespawnTime                       = 91,
	QuestManagerInterface                    = 92,
	QuestInstanceGuid                        = 93,
	ObjectiveInstanceGuid                    = 94,
	SourceActorGuid                          = 95,
	QuestRecordId                            = 96,
	ObjectiveRecordId                        = 97,
	FishLength                               = 98,
	FishWeight                               = 99,
	EExpressionContextIdentifier_MAX         = 100,
};

// Enum DesignDataPlugin.EProviderConnectionStatus
// NumValues: 0x0003
enum class EProviderConnectionStatus : uint8
{
	Connected                                = 0,
	Disconnected                             = 1,
	EProviderConnectionStatus_MAX            = 2,
};

// Enum DesignDataPlugin.EPropertyMappingAction
// NumValues: 0x0003
enum class EPropertyMappingAction : uint32
{
	None                                     = 0,
	Rename                                   = 1,
	EPropertyMappingAction_MAX               = 2,
};

// ScriptStruct DesignDataPlugin.IntrepidDuration
// 0x0008 (0x0008 - 0x0000)
struct FIntrepidDuration final
{
public:
	int64                                         Duration;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIntrepidDuration;

// ScriptStruct DesignDataPlugin.DesignDataObjectId
// 0x0038 (0x0038 - 0x0000)
struct FDesignDataObjectId
{
public:
	int64                                         Guid;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         TypeId;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x20];                                      // 0x0018(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDesignDataObjectId;

// ScriptStruct DesignDataPlugin.DesignDataTypeDef
// 0x0040 (0x0040 - 0x0000)
struct FDesignDataTypeDef final
{
public:
	int64                                         TypeId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Category;                                          // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ToolDisplayOrder;                                  // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x14];                                      // 0x002C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDesignDataTypeDef;

// ScriptStruct DesignDataPlugin.DesignDataRecordBase
// 0x0040 (0x0040 - 0x0000)
struct FDesignDataRecordBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Guid;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ParentGuid;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDevOnly;                                          // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RecordFilename;                                    // 0x0028(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDirty;                                          // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDesignDataRecordBase;

// ScriptStruct DesignDataPlugin.AoCExpression
// 0x0050 (0x0050 - 0x0000)
struct FAoCExpression final
{
public:
	class FString                                 Expression;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x40];                                      // 0x0010(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAoCExpression;

// ScriptStruct DesignDataPlugin.DesignDataRecord
// 0x0040 (0x0040 - 0x0000)
struct FDesignDataRecord final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Guid;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Parent;                                            // 0x0020(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RecordFilename;                                    // 0x0028(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDirty;                                          // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDesignDataRecord;

// ScriptStruct DesignDataPlugin.DesignDataRecordId
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FDesignDataRecordId final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDesignDataRecordId;

// ScriptStruct DesignDataPlugin.DesignDataTypeId
// 0x0008 (0x0008 - 0x0000)
struct FDesignDataTypeId final
{
public:
	int64                                         TypeId;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDesignDataTypeId;

// ScriptStruct DesignDataPlugin.DoltDesignDataProviderDelegateHandler
// 0x0040 (0x0040 - 0x0000)
struct FDoltDesignDataProviderDelegateHandler final
{
public:
	TMulticastInlineDelegate<void(const EDoltDesignDataProviderTask& TaskState)> OnTaskComplete;     // 0x0000(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnConflict;                                        // 0x0010(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& TaskError)> OnError;                          // 0x0020(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnDoltAndP4ConnectionEstablished;                  // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDoltDesignDataProviderDelegateHandler;

// ScriptStruct DesignDataPlugin.StatValue
// 0x0004 (0x0004 - 0x0000)
struct FStatValue final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStatValue;

SDK_NAMESPACE_END
