#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DialogAudio

#include "Basic.hpp"

#include "Engine_structs.hpp"


SDK_NAMESPACE_START

// Enum DialogAudio.EDialogueAudioRegistryOperationResult
// NumValues: 0x0005
enum class EDialogueAudioRegistryOperationResult : uint8
{
	Success                                  = 0,
	EntryAlreadyExists                       = 1,
	TableNotFound                            = 2,
	Failed                                   = 3,
	EDialogueAudioRegistryOperationResult_MAX = 4,
};

// ScriptStruct DialogAudio.DialogueAudioLookupRow
// 0x0028 (0x0030 - 0x0008)
struct FDialogueAudioLookupRow final : public FTableRowBase
{
public:
	class FName                                   VoiceName;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DialogueAudioRecordName;                           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RecordId;                                          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index;                                             // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AudioName;                                         // 0x0024(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDialogueAudioLookupRow;

SDK_NAMESPACE_END
