#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameUtilsPlugin

#include "Basic.hpp"


SDK_NAMESPACE_START

// Enum GameUtilsPlugin.EInteractDisplayType
// NumValues: 0x0004
enum class EInteractDisplayType : uint8
{
	Invalid                                  = 0,
	Discovered                               = 1,
	Prompt                                   = 2,
	EInteractDisplayType_MAX                 = 3,
};

// Enum GameUtilsPlugin.EConeAABBIntersectionResult
// NumValues: 0x0005
enum class EConeAABBIntersectionResult : uint8
{
	Intersection                             = 0,
	OutOfArc                                 = 1,
	OutOfRange                               = 2,
	InvalidTest                              = 3,
	EConeAABBIntersectionResult_MAX          = 4,
};

// Enum GameUtilsPlugin.EVertexRenderType
// NumValues: 0x0005
enum class EVertexRenderType : uint8
{
	None                                     = 0,
	Vertices                                 = 1,
	Faces                                    = 2,
	cCount                                   = 3,
	EVertexRenderType_MAX                    = 4,
};

// ScriptStruct GameUtilsPlugin.NamedTextArg
// 0x0020 (0x0020 - 0x0000)
struct FNamedTextArg final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNamedTextArg;

// ScriptStruct GameUtilsPlugin.TextLookupArg
// 0x0020 (0x0020 - 0x0000)
struct FTextLookupArg final
{
public:
	class FString                                 TableId;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTextLookupArg;

// ScriptStruct GameUtilsPlugin.NamedTextLookupArg
// 0x0030 (0x0030 - 0x0000)
struct FNamedTextLookupArg final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTextLookupArg                         Value;                                             // 0x0010(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNamedTextLookupArg;

// ScriptStruct GameUtilsPlugin.LocalizedMessage
// 0x0040 (0x0040 - 0x0000)
struct FLocalizedMessage final
{
public:
	class FString                                 StringTableId;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNamedTextArg>                  FormatArgs;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNamedTextLookupArg>            LookupArgs;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLocalizedMessage;

// ScriptStruct GameUtilsPlugin.IntrepidBitArray
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FIntrepidBitArray final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIntrepidBitArray;

// ScriptStruct GameUtilsPlugin.CyclicalTime
// 0x0004 (0x0004 - 0x0000)
struct FCyclicalTime final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FCyclicalTime;

// ScriptStruct GameUtilsPlugin.CyclicalTimeWithWorldContext
// 0x0008 (0x0008 - 0x0000)
struct FCyclicalTimeWithWorldContext final
{
public:
	struct FCyclicalTime                          CyclicalTime;                                      // 0x0000(0x0004)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         NoRep_WorldContextTime;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCyclicalTimeWithWorldContext;

// ScriptStruct GameUtilsPlugin.AoCTargetInfo
// 0x0090 (0x0090 - 0x0000)
struct alignas(0x08) FAoCTargetInfo final
{
public:
	uint8                                         Pad_0[0x90];                                       // 0x0000(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAoCTargetInfo;

// ScriptStruct GameUtilsPlugin.OctreeNode
// 0x00A0 (0x00A0 - 0x0000)
struct alignas(0x10) FOctreeNode final
{
public:
	uint8                                         Pad_0[0xA0];                                       // 0x0000(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FOctreeNode;

// ScriptStruct GameUtilsPlugin.OctreeTreeNode
// 0x00B8 (0x00B8 - 0x0000)
struct alignas(0x08) FOctreeTreeNode final
{
public:
	uint8                                         Pad_0[0xB8];                                       // 0x0000(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FOctreeTreeNode;

// ScriptStruct GameUtilsPlugin.Octree
// 0x01B0 (0x01B0 - 0x0000)
struct FOctree final
{
public:
	struct FOctreeTreeNode                        Root;                                              // 0x0000(0x00B8)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         MinimumSplitSize;                                  // 0x00B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LargestSize;                                       // 0x00BC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C0[0xC0];                                      // 0x00C0(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UOctreeNodeObj*>                 OctreeNodes;                                       // 0x0180(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UOctreeTreeNodeObj*>             OctreeTreeNodes;                                   // 0x0190(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class UOctreeNodeObj>>  FollowMovementActors;                              // 0x01A0(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FOctree;

SDK_NAMESPACE_END
