#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayStateTreeModule

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "StateTreeModule_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_classes.hpp"
#include "GameplayStateTreeModule_structs.hpp"


SDK_NAMESPACE_START

// Class GameplayStateTreeModule.BTTask_RunDynamicStateTree
// 0x0058 (0x0100 - 0x00A8)
class UBTTask_RunDynamicStateTree final : public UBTTaskNode
{
public:
	struct FStateTreeReference                    StateTreeRef;                                      // 0x00A8(0x0028)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FStateTreeInstanceData                 InstanceData;                                      // 0x00D0(0x0010)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           InjectionTag;                                      // 0x00E0(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x18];                                      // 0x00E8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTTask_RunDynamicStateTree")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_RunDynamicStateTree")
	}
	static class UBTTask_RunDynamicStateTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_RunDynamicStateTree>();
	}
};
DUMPER7_ASSERTS_UBTTask_RunDynamicStateTree;

// Class GameplayStateTreeModule.BTTask_RunStateTree
// 0x0050 (0x00F8 - 0x00A8)
class UBTTask_RunStateTree final : public UBTTaskNode
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeReference                    StateTreeRef;                                      // 0x00B0(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FStateTreeInstanceData                 InstanceData;                                      // 0x00D8(0x0010)(Transient, Protected, NativeAccessSpecifierProtected)
	float                                         Interval;                                          // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RandomDeviation;                                   // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTTask_RunStateTree")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_RunStateTree")
	}
	static class UBTTask_RunStateTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_RunStateTree>();
	}
};
DUMPER7_ASSERTS_UBTTask_RunStateTree;

// Class GameplayStateTreeModule.StateTreeComponent
// 0x0080 (0x01E0 - 0x0160)
class UStateTreeComponent : public UBrainComponent
{
public:
	uint8                                         Pad_160[0x10];                                     // 0x0160(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(EStateTreeRunStatus StateTreeRunStatus)> OnStateTreeRunStatusChanged; // 0x0170(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FStateTreeTransferMetadata             TransferData;                                      // 0x0180(0x0010)(NativeAccessSpecifierPublic)
	struct FStateTreeReference                    StateTreeRef;                                      // 0x0190(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FStateTreeReferenceOverrides           LinkedStateTreeOverrides;                          // 0x01B8(0x0010)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FStateTreeInstanceData                 InstanceData;                                      // 0x01C8(0x0010)(Transient, Protected, NativeAccessSpecifierProtected)
	bool                                          bStartLogicAutomatically;                          // 0x01D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         BitPad_1D9_0 : 1;                                  // 0x01D9(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bIsPaused : 1;                                     // 0x01D9(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddLinkedStateTreeOverrides(const struct FGameplayTag& StateTag, const struct FStateTreeReference& StateTreeReference);
	void RemoveLinkedStateTreeOverrides(const struct FGameplayTag& StateTag);
	void SendStateTreeEvent(const struct FStateTreeEvent& Event);
	void SetStartLogicAutomatically(const bool bInStartLogicAutomatically);
	void SetStateTree(class UStateTree* StateTree);
	void SetStateTreeReference(const struct FStateTreeReference& StateTreeReference);

	EStateTreeRunStatus GetStateTreeRunStatus() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StateTreeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StateTreeComponent")
	}
	static class UStateTreeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeComponent>();
	}
};
DUMPER7_ASSERTS_UStateTreeComponent;

// Class GameplayStateTreeModule.StateTreeAIComponent
// 0x0000 (0x01E0 - 0x01E0)
class UStateTreeAIComponent final : public UStateTreeComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StateTreeAIComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StateTreeAIComponent")
	}
	static class UStateTreeAIComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeAIComponent>();
	}
};
DUMPER7_ASSERTS_UStateTreeAIComponent;

// Class GameplayStateTreeModule.StateTreeComponentSchema
// 0x0020 (0x0068 - 0x0048)
class UStateTreeComponentSchema : public UStateTreeSchema
{
public:
	TSubclassOf<class AActor>                     ContextActorClass;                                 // 0x0048(0x0008)(Edit, ZeroConstructor, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeComponentSchemaScheduledTickPolicy  ScheduledTickPolicy;                               // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStateTreeExternalDataDesc>     ContextDataDescs;                                  // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StateTreeComponentSchema")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StateTreeComponentSchema")
	}
	static class UStateTreeComponentSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeComponentSchema>();
	}
};
DUMPER7_ASSERTS_UStateTreeComponentSchema;

// Class GameplayStateTreeModule.StateTreeAIComponentSchema
// 0x0008 (0x0070 - 0x0068)
class UStateTreeAIComponentSchema final : public UStateTreeComponentSchema
{
public:
	TSubclassOf<class AAIController>              AIControllerClass;                                 // 0x0068(0x0008)(Edit, ZeroConstructor, NoClear, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StateTreeAIComponentSchema")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StateTreeAIComponentSchema")
	}
	static class UStateTreeAIComponentSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeAIComponentSchema>();
	}
};
DUMPER7_ASSERTS_UStateTreeAIComponentSchema;

SDK_NAMESPACE_END
