#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeometryFlowCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// ScriptStruct GeometryFlowCore.Int32Setting
// 0x0004 (0x0004 - 0x0000)
struct FInt32Setting final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInt32Setting;

// ScriptStruct GeometryFlowCore.FloatSetting
// 0x0004 (0x0004 - 0x0000)
struct FFloatSetting final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFloatSetting;

// ScriptStruct GeometryFlowCore.DoubleSetting
// 0x0008 (0x0008 - 0x0000)
struct FDoubleSetting final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDoubleSetting;

// ScriptStruct GeometryFlowCore.Vector3fSetting
// 0x000C (0x000C - 0x0000)
struct FVector3fSetting final
{
public:
	struct FVector3f                              Value;                                             // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVector3fSetting;

// ScriptStruct GeometryFlowCore.Vector3dSetting
// 0x0018 (0x0018 - 0x0000)
struct FVector3dSetting final
{
public:
	struct FVector3d                              Value;                                             // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVector3dSetting;

// ScriptStruct GeometryFlowCore.NameSetting
// 0x0008 (0x0008 - 0x0000)
struct FNameSetting final
{
public:
	class FName                                   Value;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNameSetting;

SDK_NAMESPACE_END
