#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeometryFlowMeshProcessing

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// Enum GeometryFlowMeshProcessing.EGeometryFlow_SimpleCollisionGeometryType
// NumValues: 0x0009
enum class EGeometryFlow_SimpleCollisionGeometryType : uint8
{
	AlignedBoxes                             = 0,
	OrientedBoxes                            = 1,
	MinimalSpheres                           = 2,
	Capsules                                 = 3,
	ConvexHulls                              = 4,
	SweptHulls                               = 5,
	MinVolume                                = 6,
	None                                     = 7,
	EGeometryFlow_MAX                        = 8,
};

// Enum GeometryFlowMeshProcessing.EGeometryFlow_ProjectedHullAxisMode
// NumValues: 0x0006
enum class EGeometryFlow_ProjectedHullAxisMode : uint32
{
	X                                        = 0,
	Y                                        = 1,
	Z                                        = 2,
	SmallestBoxDimension                     = 3,
	SmallestVolume                           = 4,
	EGeometryFlow_MAX                        = 5,
};

// Enum GeometryFlowMeshProcessing.EGeometryFlow_SmoothTypes
// NumValues: 0x0004
enum class EGeometryFlow_SmoothTypes : uint32
{
	Uniform                                  = 0,
	Cotan                                    = 1,
	MeanValue                                = 2,
	EGeometryFlow_MAX                        = 3,
};

// Enum GeometryFlowMeshProcessing.EGeometryFlow_ComputeNormalsType
// NumValues: 0x0006
enum class EGeometryFlow_ComputeNormalsType : uint32
{
	PerTriangle                              = 0,
	PerVertex                                = 1,
	RecomputeExistingTopology                = 2,
	FromFaceAngleThreshold                   = 3,
	FromGroups                               = 4,
	EGeometryFlow_MAX                        = 5,
};

// Enum GeometryFlowMeshProcessing.EGeometryFlow_RecalculateUVsUnwrapType
// NumValues: 0x0004
enum class EGeometryFlow_RecalculateUVsUnwrapType : uint8
{
	Auto                                     = 0,
	ExpMap                                   = 1,
	Conformal                                = 2,
	EGeometryFlow_MAX                        = 3,
};

// Enum GeometryFlowMeshProcessing.EGeometryFlow_MeshSimplifyType
// NumValues: 0x0004
enum class EGeometryFlow_MeshSimplifyType : uint32
{
	Standard                                 = 0,
	VolumePreserving                         = 1,
	AttributeAware                           = 2,
	EGeometryFlow_MAX                        = 3,
};

// Enum GeometryFlowMeshProcessing.EGeomtryFlow_MeshSimplifyTargetType
// NumValues: 0x0005
enum class EGeomtryFlow_MeshSimplifyTargetType : uint32
{
	TriangleCount                            = 0,
	VertexCount                              = 1,
	TrianglePercentage                       = 2,
	GeometricDeviation                       = 3,
	EGeomtryFlow_MAX                         = 4,
};

// Enum GeometryFlowMeshProcessing.EGeometryFlow_EdgeRefineFlags
// NumValues: 0x0009
enum class EGeometryFlow_EdgeRefineFlags : uint32
{
	NoConstraint                             = 0,
	NoFlip                                   = 1,
	NoSplit                                  = 2,
	NoCollapse                               = 4,
	FullyConstrained                         = 7,
	SplitsOnly                               = 5,
	FlipOnly                                 = 6,
	CollapseOnly                             = 3,
	EGeometryFlow_MAX                        = 8,
};

// Enum GeometryFlowMeshProcessing.EGeometryFlow_ComputeTangentsType
// NumValues: 0x0003
enum class EGeometryFlow_ComputeTangentsType : uint32
{
	PerTriangle                              = 0,
	FastMikkT                                = 1,
	EGeometryFlow_MAX                        = 2,
};

// ScriptStruct GeometryFlowMeshProcessing.BakeMeshTextureImageSettings
// 0x0010 (0x0010 - 0x0000)
struct FBakeMeshTextureImageSettings
{
public:
	int32                                         DetailUVLayer;                                     // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxDistance;                                       // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBakeMeshTextureImageSettings;

// ScriptStruct GeometryFlowMeshProcessing.BakeMeshMultiTextureSettings
// 0x0000 (0x0010 - 0x0010)
struct FBakeMeshMultiTextureSettings final : public FBakeMeshTextureImageSettings
{
};
DUMPER7_ASSERTS_FBakeMeshMultiTextureSettings;

// ScriptStruct GeometryFlowMeshProcessing.BakeMeshNormalMapSettings
// 0x0008 (0x0008 - 0x0000)
struct FBakeMeshNormalMapSettings final
{
public:
	double                                        MaxDistance;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBakeMeshNormalMapSettings;

// ScriptStruct GeometryFlowMeshProcessing.GenerateConvexHullMeshSettings
// 0x0008 (0x0008 - 0x0000)
struct FGenerateConvexHullMeshSettings final
{
public:
	bool                                          bPrefilterVertices;                                // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PrefilterGridResolution;                           // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGenerateConvexHullMeshSettings;

// ScriptStruct GeometryFlowMeshProcessing.GenerateConvexHullSettings
// 0x000C (0x000C - 0x0000)
struct FGenerateConvexHullSettings final
{
public:
	int32                                         SimplifyToTriangleCount;                           // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrefilterVertices;                                // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PrefilterGridResolution;                           // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGenerateConvexHullSettings;

// ScriptStruct GeometryFlowMeshProcessing.GenerateSweptHullSettings
// 0x000C (0x000C - 0x0000)
struct FGenerateSweptHullSettings final
{
public:
	bool                                          bSimplifyPolygons;                                 // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EGeometryFlow_ProjectedHullAxisMode           SweepAxis;                                         // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HullTolerance;                                     // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGenerateSweptHullSettings;

// ScriptStruct GeometryFlowMeshProcessing.GenerateSimpleCollisionSettings
// 0x001C (0x001C - 0x0000)
struct FGenerateSimpleCollisionSettings final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGenerateConvexHullSettings            ConvexHullSettings;                                // 0x0004(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGenerateSweptHullSettings             SweptHullSettings;                                 // 0x0010(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGenerateSimpleCollisionSettings;

// ScriptStruct GeometryFlowMeshProcessing.MeshMakeBakingCacheSettings
// 0x0010 (0x0010 - 0x0000)
struct FMeshMakeBakingCacheSettings final
{
public:
	struct FIntPoint                              Dimensions;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UVLayer;                                           // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Thickness;                                         // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMeshMakeBakingCacheSettings;

// ScriptStruct GeometryFlowMeshProcessing.MeshMakeCleanGeometrySettings
// 0x0018 (0x0018 - 0x0000)
struct FMeshMakeCleanGeometrySettings final
{
public:
	int32                                         FillHolesEdgeCountThresh;                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FillHolesEstimatedAreaFraction;                    // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDiscardAllAttributes;                             // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClearUVs;                                         // 0x0011(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClearNormals;                                     // 0x0012(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClearTangents;                                    // 0x0013(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClearVertexColors;                                // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClearMaterialIDs;                                 // 0x0015(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputMeshVertexNormals;                          // 0x0016(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputOverlayVertexNormals;                       // 0x0017(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMeshMakeCleanGeometrySettings;

// ScriptStruct GeometryFlowMeshProcessing.MeshSimplifySettings
// 0x0028 (0x0028 - 0x0000)
struct FMeshSimplifySettings
{
public:
	EGeometryFlow_MeshSimplifyType                SimplifyType;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeomtryFlow_MeshSimplifyTargetType           TargetType;                                        // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetCount;                                       // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetFraction;                                    // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GeometricTolerance;                                // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDiscardAttributes;                                // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreventNormalFlips;                               // 0x0015(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreserveSharpEdges;                               // 0x0016(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowSeamCollapse;                                // 0x0017(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowSeamSplits;                                  // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EGeometryFlow_EdgeRefineFlags                 MeshBoundaryConstraints;                           // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeometryFlow_EdgeRefineFlags                 GroupBorderConstraints;                            // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeometryFlow_EdgeRefineFlags                 MaterialBorderConstraints;                         // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMeshSimplifySettings;

// ScriptStruct GeometryFlowMeshProcessing.MeshNormalFlowSettings
// 0x0014 (0x003C - 0x0028)
struct FMeshNormalFlowSettings final : public FMeshSimplifySettings
{
public:
	int32                                         MaxRemeshIterations;                               // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumExtraProjectionIterations;                      // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlips;                                            // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSplits;                                           // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCollapses;                                        // 0x0032(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EGeometryFlow_SmoothTypes                     SmoothingType;                                     // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmoothingStrength;                                 // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMeshNormalFlowSettings;

// ScriptStruct GeometryFlowMeshProcessing.MeshNormalsSettings
// 0x0010 (0x0010 - 0x0000)
struct FMeshNormalsSettings final
{
public:
	EGeometryFlow_ComputeNormalsType              NormalsType;                                       // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvert;                                           // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAreaWeighted;                                     // 0x0005(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAngleWeighted;                                    // 0x0006(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AngleThresholdDeg;                                 // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMeshNormalsSettings;

// ScriptStruct GeometryFlowMeshProcessing.MeshRecalculateUVsSettings
// 0x0008 (0x0008 - 0x0000)
struct FMeshRecalculateUVsSettings final
{
public:
	EGeometryFlow_RecalculateUVsUnwrapType        UnwrapType;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UVLayer;                                           // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMeshRecalculateUVsSettings;

// ScriptStruct GeometryFlowMeshProcessing.MeshRepackUVsSettings
// 0x0020 (0x0020 - 0x0000)
struct FMeshRepackUVsSettings final
{
public:
	int32                                         UVLayer;                                           // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TextureResolution;                                 // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GutterSize;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowFlips;                                       // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2f                              UVScale;                                           // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2f                              UVTranslation;                                     // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMeshRepackUVsSettings;

// ScriptStruct GeometryFlowMeshProcessing.MeshSolidifySettings
// 0x0010 (0x0010 - 0x0000)
struct FMeshSolidifySettings final
{
public:
	int32                                         VoxelResolution;                                   // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindingThreshold;                                  // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SurfaceConvergeSteps;                              // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtendBounds;                                      // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMeshSolidifySettings;

// ScriptStruct GeometryFlowMeshProcessing.MeshTangentsSettings
// 0x0008 (0x0008 - 0x0000)
struct FMeshTangentsSettings final
{
public:
	EGeometryFlow_ComputeTangentsType             TangentsType;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UVLayer;                                           // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMeshTangentsSettings;

// ScriptStruct GeometryFlowMeshProcessing.MeshThickenSettings
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FMeshThickenSettings final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMeshThickenSettings;

// ScriptStruct GeometryFlowMeshProcessing.VoxMorphologyOpSettings
// 0x0010 (0x0010 - 0x0000)
struct FVoxMorphologyOpSettings final
{
public:
	int32                                         VoxelResolution;                                   // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Distance;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVoxMorphologyOpSettings;

SDK_NAMESPACE_END
