#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HarvestableResource

#include "Basic.hpp"

#include "NPCPawn_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass HarvestableResource.HarvestableResource_C
// 0x0040 (0x24B0 - 0x2470)
class AHarvestableResource_C final : public ANPCPawn_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_HarvestableResource_C;              // 0x2470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHarvestingComponent*                   harvesting;                                        // 0x2478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APlayerCharacter*                       Player;                                            // 0x2480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          DirectHit;                                         // 0x2488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2489[0x7];                                     // 0x2489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HarvestLocation;                                   // 0x2490(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentBeginCursorOverSignature__DelegateSignature(class UPrimitiveComponent* TouchedComponent);
	void BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentOnClickedSignature__DelegateSignature(class UPrimitiveComponent* TouchedComponent, const struct FKey& ButtonPressed);
	void BndEvt__Mesh_K2Node_ComponentBoundEvent_1_ComponentEndCursorOverSignature__DelegateSignature(class UPrimitiveComponent* TouchedComponent);
	void ExecuteUbergraph_HarvestableResource(int32 EntryPoint);
	void On_Click_From_Player(const struct FVector& Location);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("HarvestableResource_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HarvestableResource_C")
	}
	static class AHarvestableResource_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHarvestableResource_C>();
	}
};
DUMPER7_ASSERTS_AHarvestableResource_C;

SDK_NAMESPACE_END
