#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Intrepid

#include "Basic.hpp"

#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function Intrepid.IntrepidSystemManager.Cleanup
// 0x0008 (0x0008 - 0x0000)
struct IntrepidSystemManager_Cleanup final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IntrepidSystemManager_Cleanup;

// Function Intrepid.IntrepidSystemManager.HandleActorEndPlay
// 0x0010 (0x0010 - 0x0000)
struct IntrepidSystemManager_HandleActorEndPlay final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IntrepidSystemManager_HandleActorEndPlay;

// Function Intrepid.IntrepidSystemManager.HandleComponentEndPlay
// 0x0008 (0x0008 - 0x0000)
struct IntrepidSystemManager_HandleComponentEndPlay final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IntrepidSystemManager_HandleComponentEndPlay;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
