#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IntrepidNetCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// Enum IntrepidNetCore.EIntrepidNetCommunicatorMessageType
// NumValues: 0x0005
enum class EIntrepidNetCommunicatorMessageType : uint8
{
	Connection                               = 0,
	Disconnection                            = 1,
	Error                                    = 2,
	PacketRecvd                              = 3,
	EIntrepidNetCommunicatorMessageType_MAX  = 4,
};

// Enum IntrepidNetCore.ESubdivisionAxis
// NumValues: 0x0004
enum class ESubdivisionAxis : uint8
{
	None                                     = 0,
	X                                        = 1,
	Y                                        = 2,
	ESubdivisionAxis_MAX                     = 3,
};

// Enum IntrepidNetCore.EServerCellState
// NumValues: 0x0006
enum class EServerCellState : uint8
{
	Offline                                  = 0,
	Initializing                             = 1,
	WarmingUp                                = 2,
	Online                                   = 3,
	ShuttingDown                             = 4,
	EServerCellState_MAX                     = 5,
};

// Enum IntrepidNetCore.EServerCellFlags
// NumValues: 0x0007
enum class EServerCellFlags : uint8
{
	None                                     = 0,
	DynamicallyCreated                       = 1,
	DynamicallyResized                       = 2,
	Resizing                                 = 4,
	WarmupPromotionFinished                  = 8,
	NewPlayersGated                          = 16,
	EServerCellFlags_MAX                     = 17,
};

// ScriptStruct IntrepidNetCore.PartitionTreeSubdivision
// 0x0008 (0x0008 - 0x0000)
struct FPartitionTreeSubdivision final
{
public:
	ESubdivisionAxis                              Axis;                                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPartitionTreeSubdivision;

// ScriptStruct IntrepidNetCore.IntrepidNetCoreConfig
// 0x0078 (0x0078 - 0x0000)
struct FIntrepidNetCoreConfig final
{
public:
	class FString                                 WorldName;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldOrigin;                                       // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldSize;                                         // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GridNodesX;                                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GridNodesY;                                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        PlayerStartLocations;                              // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsVariableDensity;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPartitionTreeSubdivision>      PartitionTree;                                     // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         MaxServers;                                        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIntrepidNetCoreConfig;

// ScriptStruct IntrepidNetCore.IntrepidNetDebugServerData
// 0x0058 (0x0058 - 0x0000)
struct FIntrepidNetDebugServerData final
{
public:
	int32                                         ServerId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   AuthorityBoundsBox;                                // 0x0008(0x0038)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CellId;                                            // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EServerCellState                              State;                                             // 0x0044(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EServerCellFlags                              Flags;                                             // 0x0045(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Neighbors;                                         // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIntrepidNetDebugServerData;

// ScriptStruct IntrepidNetCore.IntrepidNetCoreHeatPoint
// 0x0004 (0x0004 - 0x0000)
struct FIntrepidNetCoreHeatPoint final
{
public:
	uint16                                        X;                                                 // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        Y;                                                 // 0x0002(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIntrepidNetCoreHeatPoint;

// ScriptStruct IntrepidNetCore.IntrepidNetCoreHeatCell
// 0x0006 (0x0006 - 0x0000)
struct FIntrepidNetCoreHeatCell final
{
public:
	struct FIntrepidNetCoreHeatPoint              Point;                                             // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         HeatQuantized;                                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x1];                                        // 0x0005(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIntrepidNetCoreHeatCell;

// ScriptStruct IntrepidNetCore.IntrepidNetCoreServerHeatMap
// 0x0018 (0x0018 - 0x0000)
struct FIntrepidNetCoreServerHeatMap final
{
public:
	uint32                                        ServerId;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FIntrepidNetCoreHeatCell>       Cells;                                             // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIntrepidNetCoreServerHeatMap;

// ScriptStruct IntrepidNetCore.IntrepidNetCoreRealmHeatMap
// 0x0010 (0x0010 - 0x0000)
struct FIntrepidNetCoreRealmHeatMap final
{
public:
	TArray<struct FIntrepidNetCoreServerHeatMap>  ServerHeatMaps;                                    // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIntrepidNetCoreRealmHeatMap;

// ScriptStruct IntrepidNetCore.IntrepidNetCoreServiceConfig
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FIntrepidNetCoreServiceConfig final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIntrepidNetCoreServiceConfig;

SDK_NAMESPACE_END
