#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IntrepidNetCore

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


SDK_NAMESPACE_START

// Class IntrepidNetCore.AnalyticsLightProfiler
// 0x00A8 (0x00F0 - 0x0048)
class UAnalyticsLightProfiler final : public UObject
{
public:
	uint8                                         Pad_48[0xA0];                                      // 0x0048(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnabled;                                          // 0x00E8(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnalyticsLightProfiler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnalyticsLightProfiler")
	}
	static class UAnalyticsLightProfiler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnalyticsLightProfiler>();
	}
};
DUMPER7_ASSERTS_UAnalyticsLightProfiler;

// Class IntrepidNetCore.IntrepidNetCoreService
// 0x0020 (0x0068 - 0x0048)
class UIntrepidNetCoreService : public UObject
{
public:
	float                                         AnalyticsUpdateThrottleS;                          // 0x0048(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C[0x1C];                                      // 0x004C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidNetCoreService")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidNetCoreService")
	}
	static class UIntrepidNetCoreService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntrepidNetCoreService>();
	}
};
DUMPER7_ASSERTS_UIntrepidNetCoreService;

SDK_NAMESPACE_END
