#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IntrepidNet

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "IntrepidNetCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "OnlineSubsystemUtils_classes.hpp"
#include "ReplicationGraph_classes.hpp"
#include "IntrepidNet_structs.hpp"
#include "DeveloperSettings_classes.hpp"


SDK_NAMESPACE_START

// Class IntrepidNet.DynamicGriddingSubsystem
// 0x00B8 (0x0108 - 0x0050)
class UDynamicGriddingSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_50[0xB8];                                      // 0x0050(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicGriddingSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicGriddingSubsystem")
	}
	static class UDynamicGriddingSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicGriddingSubsystem>();
	}
};
DUMPER7_ASSERTS_UDynamicGriddingSubsystem;

// Class IntrepidNet.IntrepidNetConfig
// 0x0008 (0x0050 - 0x0048)
class UIntrepidNetConfig final : public UObject
{
public:
	float                                         ServerLevelStreamingExpansion;                     // 0x0048(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidNetConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidNetConfig")
	}
	static class UIntrepidNetConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntrepidNetConfig>();
	}
};
DUMPER7_ASSERTS_UIntrepidNetConfig;

// Class IntrepidNet.IntrepidNetConnection
// 0x00B0 (0x2070 - 0x1FC0)
class UIntrepidNetConnection final : public UIpConnection
{
public:
	uint8                                         Pad_1FC0[0xB0];                                    // 0x1FC0(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidNetConnection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidNetConnection")
	}
	static class UIntrepidNetConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntrepidNetConnection>();
	}
};
DUMPER7_ASSERTS_UIntrepidNetConnection;

// Class IntrepidNet.IntrepidNetDebugSystem
// 0x0200 (0x0260 - 0x0060)
class UIntrepidNetDebugSystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReplicationGraphUpdateThrottleS;                   // 0x0070(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReplicationGraphUpdateCountPerFrame;               // 0x0074(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x180];                                     // 0x0078(0x0180)(Fixing Size After Last Property [ Dumper-7 ])
	class UIntrepidNetGameInstance*               GameInstance;                                      // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_200[0x59];                                     // 0x0200(0x0059)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableIntrepidNetDebugger;                        // 0x0259(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnableReplicationGraphDebugData;                  // 0x025A(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_25B[0x5];                                      // 0x025B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidNetDebugSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidNetDebugSystem")
	}
	static class UIntrepidNetDebugSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntrepidNetDebugSystem>();
	}
};
DUMPER7_ASSERTS_UIntrepidNetDebugSystem;

// Class IntrepidNet.IntrepidNetDebugComponent
// 0x00D8 (0x01E0 - 0x0108)
class UIntrepidNetDebugComponent final : public UActorComponent
{
public:
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              ServerDataUpdated;                                 // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnDrawingRegionsToggled;                           // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FIntrepidNetTransferData               TransferData;                                      // 0x0130(0x0030)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FIntrepidNetClientServerDebugData      ClientsServerDebugData;                            // 0x0160(0x0058)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FIntrepidNetCoreRealmHeatMap           RealmHeatMap;                                      // 0x01B8(0x0010)(Net, RepNotify, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRealmHeatMapUpdated;                             // 0x01C8(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D8[0x4];                                      // 0x01D8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bClientIsHeatmapListener;                          // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientTransferDataRPC(const struct FTimespan& TimePromotionTook);
	void HandleServerDataUpdated();
	void MergeServers();
	void OnPromotion(bool bWasProxy);
	void OnRealmHeatMapChanged();
	void OnServerDataChanged();
	void ReleaseTargetPromotionLock();
	void ServerMergeServerCell();
	void ServerReleaseTargetPromotionLock();
	void ServerSetDynamicGriddingEnabled(const bool bEnabled);
	void ServerSetHeatmapListeningEnabled(const bool bEnabled);
	void ServerSplitServerCell(ESubdivisionAxis SubdivisionAxis, float Value, bool bUseLocation);
	void ServerSPMHeatMap(const class FString& CommandType);
	void ServerSPMHeatMapSetConfig(const class FString& Property, const class FString& Value);
	void SetDynamicGriddingEnabled(const bool bEnabled);
	void SetHeatmapListeningEnabled(const bool bEnabled);
	void SplitServerCell(const class FString& Axis, float SplitRatio);
	void SplitServerCellAt(const class FString& Axis, float Position);
	void SplitServerCellAtPlayer(const class FString& Axis);
	void SPMHeatMap(const class FString& CommandType);
	void SPMHeatMapSetConfig(const class FString& Property, const class FString& Value);

	bool IsDrawingServerRegions() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidNetDebugComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidNetDebugComponent")
	}
	static class UIntrepidNetDebugComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntrepidNetDebugComponent>();
	}
};
DUMPER7_ASSERTS_UIntrepidNetDebugComponent;

// Class IntrepidNet.IntrepidNetDriver
// 0x03C8 (0x0D50 - 0x0988)
class alignas(0x10) UIntrepidNetDriver final : public UIpNetDriver
{
public:
	class UIntrepidNetServerPackageMap*           ServerPackageMap;                                  // 0x0988(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_990[0x370];                                    // 0x0990(0x0370)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGuid, TWeakObjectPtr<class APlayerController>> TimingOutPlayers;                    // 0x0D00(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidNetDriver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidNetDriver")
	}
	static class UIntrepidNetDriver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntrepidNetDriver>();
	}
};
DUMPER7_ASSERTS_UIntrepidNetDriver;

// Class IntrepidNet.IntrepidNetGameInstance
// 0x00A0 (0x02C0 - 0x0220)
class UIntrepidNetGameInstance : public UGameInstance
{
public:
	uint8                                         Pad_220[0xA0];                                     // 0x0220(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidNetGameInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidNetGameInstance")
	}
	static class UIntrepidNetGameInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntrepidNetGameInstance>();
	}
};
DUMPER7_ASSERTS_UIntrepidNetGameInstance;

// Class IntrepidNet.IntrepidNetGameMode
// 0x0000 (0x0450 - 0x0450)
class AIntrepidNetGameMode final : public AGameMode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidNetGameMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidNetGameMode")
	}
	static class AIntrepidNetGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIntrepidNetGameMode>();
	}
};
DUMPER7_ASSERTS_AIntrepidNetGameMode;

// Class IntrepidNet.IntrepidNetGameModeBase
// 0x0000 (0x0408 - 0x0408)
class AIntrepidNetGameModeBase : public AGameModeBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidNetGameModeBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidNetGameModeBase")
	}
	static class AIntrepidNetGameModeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIntrepidNetGameModeBase>();
	}
};
DUMPER7_ASSERTS_AIntrepidNetGameModeBase;

// Class IntrepidNet.IntrepidNetReplicationGraphNode_ActorListFrequencyBuckets
// 0x00E8 (0x0158 - 0x0070)
class UIntrepidNetReplicationGraphNode_ActorListFrequencyBuckets final : public UReplicationGraphNode
{
public:
	uint8                                         Pad_70[0xE8];                                      // 0x0070(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidNetReplicationGraphNode_ActorListFrequencyBuckets")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidNetReplicationGraphNode_ActorListFrequencyBuckets")
	}
	static class UIntrepidNetReplicationGraphNode_ActorListFrequencyBuckets* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntrepidNetReplicationGraphNode_ActorListFrequencyBuckets>();
	}
};
DUMPER7_ASSERTS_UIntrepidNetReplicationGraphNode_ActorListFrequencyBuckets;

// Class IntrepidNet.IntrepidNetReplicationGraphNode_LargeCullDistance
// 0x0000 (0x00F0 - 0x00F0)
class UIntrepidNetReplicationGraphNode_LargeCullDistance final : public UReplicationGraphNode_ActorList
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidNetReplicationGraphNode_LargeCullDistance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidNetReplicationGraphNode_LargeCullDistance")
	}
	static class UIntrepidNetReplicationGraphNode_LargeCullDistance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntrepidNetReplicationGraphNode_LargeCullDistance>();
	}
};
DUMPER7_ASSERTS_UIntrepidNetReplicationGraphNode_LargeCullDistance;

// Class IntrepidNet.IntrepidNetReplicationGraphConnection
// 0x0008 (0x03C8 - 0x03C0)
class UIntrepidNetReplicationGraphConnection final : public UNetReplicationGraphConnection
{
public:
	class UIntrepidNetReplicationGraphNode_AlwaysRelevant_ForConnection* AlwaysRelevantForConnectionNode; // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidNetReplicationGraphConnection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidNetReplicationGraphConnection")
	}
	static class UIntrepidNetReplicationGraphConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntrepidNetReplicationGraphConnection>();
	}
};
DUMPER7_ASSERTS_UIntrepidNetReplicationGraphConnection;

// Class IntrepidNet.IntrepidNetReplicationGraph
// 0x0110 (0x0720 - 0x0610)
class UIntrepidNetReplicationGraph : public UReplicationGraph
{
public:
	float                                         SpatialGridCellSize;                               // 0x0608(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60C[0x14];                                     // 0x060C(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDisableSpatialRebuilding;                         // 0x0620(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnableMultiThreading;                             // 0x0621(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_622[0x9E];                                     // 0x0622(0x009E)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class AActor*, EClassRepPolicy>          OwnerDependencyActorPolicies;                      // 0x06C0(0x0050)(Protected, NativeAccessSpecifierProtected)
	TArray<class UClass*>                         ExplicitlySetClasses;                              // 0x0710(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidNetReplicationGraph")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidNetReplicationGraph")
	}
	static class UIntrepidNetReplicationGraph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntrepidNetReplicationGraph>();
	}
};
DUMPER7_ASSERTS_UIntrepidNetReplicationGraph;

// Class IntrepidNet.IntrepidNetReplicationGraphNode_AlwaysRelevant_ForConnection
// 0x0008 (0x0168 - 0x0160)
class UIntrepidNetReplicationGraphNode_AlwaysRelevant_ForConnection final : public UReplicationGraphNode_AlwaysRelevant_ForConnection
{
public:
	uint8                                         Pad_160[0x8];                                      // 0x0160(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidNetReplicationGraphNode_AlwaysRelevant_ForConnection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidNetReplicationGraphNode_AlwaysRelevant_ForConnection")
	}
	static class UIntrepidNetReplicationGraphNode_AlwaysRelevant_ForConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntrepidNetReplicationGraphNode_AlwaysRelevant_ForConnection>();
	}
};
DUMPER7_ASSERTS_UIntrepidNetReplicationGraphNode_AlwaysRelevant_ForConnection;

// Class IntrepidNet.IntrepidNetServerPackageMap
// 0x0090 (0x0190 - 0x0100)
class UIntrepidNetServerPackageMap final : public UPackageMap
{
public:
	uint8                                         Pad_100[0x90];                                     // 0x0100(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnObjectDestroyed(class UObject* Object);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidNetServerPackageMap")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidNetServerPackageMap")
	}
	static class UIntrepidNetServerPackageMap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntrepidNetServerPackageMap>();
	}
};
DUMPER7_ASSERTS_UIntrepidNetServerPackageMap;

// Class IntrepidNet.IntrepidNetServiceHandler
// 0x0018 (0x0078 - 0x0060)
class UIntrepidNetServiceHandler : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_60[0x18];                                      // 0x0060(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidNetServiceHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidNetServiceHandler")
	}
	static class UIntrepidNetServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntrepidNetServiceHandler>();
	}
};
DUMPER7_ASSERTS_UIntrepidNetServiceHandler;

// Class IntrepidNet.IntrepidNetServiceManager
// 0x00B0 (0x0110 - 0x0060)
class UIntrepidNetServiceManager final : public UTickableWorldSubsystem
{
public:
	TArray<class UIntrepidNetCoreService*>        ServicesToTick;                                    // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<class UClass*, class UIntrepidNetCoreService*> ServicesRunning;                             // 0x0070(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class UClass*, struct FIntrepidNetCoreServiceConfig> ServiceConfigurations;                 // 0x00C0(0x0050)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidNetServiceManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidNetServiceManager")
	}
	static class UIntrepidNetServiceManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntrepidNetServiceManager>();
	}
};
DUMPER7_ASSERTS_UIntrepidNetServiceManager;

// Class IntrepidNet.IntrepidNetSettings
// 0x0020 (0x0078 - 0x0058)
class UIntrepidNetSettings final : public UDeveloperSettings
{
public:
	struct FSoftObjectPath                        ServiceDefaultMap;                                 // 0x0058(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidNetSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidNetSettings")
	}
	static class UIntrepidNetSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntrepidNetSettings>();
	}
};
DUMPER7_ASSERTS_UIntrepidNetSettings;

// Class IntrepidNet.IntrepidNetUtilitySubsystem
// 0x0088 (0x00E8 - 0x0060)
class UIntrepidNetUtilitySubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_60[0x88];                                      // 0x0060(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BuildAndShowCurrentConfiguration();
	void BuildServerGrid(const struct FVector& Origin, const struct FVector& Extents, int32 NumX, int32 NumY);
	void ClearRegionsToDraw();
	TArray<class FString> GetIntrepidNetConfigProfiles();
	bool MakeIntrepidNetConfig(const class FString& Name_0, const struct FVector& WorldOrigin, const struct FVector& WorldSize, const int32 GridNodesX, const int32 GridNodesY, const TArray<struct FVector>& PlayerStartLocations, const int32 MaxServers);
	void OnConfigUpdated(const class FString& NewConfigFile);
	bool ReadConfig(const class FString& Filename, struct FIntrepidNetConfigUnreal* OutConfig, class FString* Error);
	bool WriteConfig(const class FString& Filename, const struct FIntrepidNetConfigUnreal& Config, class FString* Error);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidNetUtilitySubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidNetUtilitySubsystem")
	}
	static class UIntrepidNetUtilitySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntrepidNetUtilitySubsystem>();
	}
};
DUMPER7_ASSERTS_UIntrepidNetUtilitySubsystem;

// Class IntrepidNet.IntrepidRepKeyComponent
// 0x0010 (0x0118 - 0x0108)
class UIntrepidRepKeyComponent : public UActorComponent
{
public:
	uint8                                         Pad_108[0x10];                                     // 0x0108(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void MarkDirtyForReplication();
	void MarkDirtyForReplication_InterServerOnly();

	int32 GetInterServerReplicationKey() const;
	int32 GetReplicationKey() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntrepidRepKeyComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntrepidRepKeyComponent")
	}
	static class UIntrepidRepKeyComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntrepidRepKeyComponent>();
	}
};
DUMPER7_ASSERTS_UIntrepidRepKeyComponent;

SDK_NAMESPACE_END
