#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IntrepidNet

#include "Basic.hpp"

#include "IntrepidNetCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "NetCore_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START

// Enum IntrepidNet.EInterServerReplicationState
// NumValues: 0x0008
enum class EInterServerReplicationState : uint8
{
	None                                     = 0,
	PendingCreation                          = 1,
	Created                                  = 2,
	PendingDestroy                           = 3,
	PendingPromotion                         = 4,
	Promoting                                = 5,
	cCount                                   = 6,
	EInterServerReplicationState_MAX         = 7,
};

// Enum IntrepidNet.FIntrepidNetDebugActorDataType
// NumValues: 0x0004
enum class EFIntrepidNetDebugActorDataType : uint8
{
	OTHER                                    = 0,
	PLAYER                                   = 1,
	NPC                                      = 2,
	FIntrepidNetDebugActorDataType_MAX       = 3,
};

// Enum IntrepidNet.EClassRepPolicy
// NumValues: 0x000A
enum class EClassRepPolicy : uint8
{
	NotRouted                                = 0,
	RelevantAllConnections                   = 1,
	RelevantOwnerConnection                  = 2,
	UseOwnerRelevancy                        = 3,
	Spatialize_Static                        = 4,
	Spatialize_Dynamic                       = 5,
	Spatialize_Dormancy                      = 6,
	Spatialize_LargeCullDistance             = 7,
	Spatialize_VariableCullDistance          = 8,
	EClassRepPolicy_MAX                      = 9,
};

// Enum IntrepidNet.EHandlerRegistrationPacketType
// NumValues: 0x0004
enum class EHandlerRegistrationPacketType : uint8
{
	Unregister                               = 0,
	Register                                 = 1,
	Update                                   = 2,
	EHandlerRegistrationPacketType_MAX       = 3,
};

// ScriptStruct IntrepidNet.IntrepidNetDebugActorData
// 0x0034 (0x0040 - 0x000C)
struct FIntrepidNetDebugActorData final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name;                                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Location;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationYaw;                                       // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NodeIndex;                                         // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFIntrepidNetDebugActorDataType               Type;                                              // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIntrepidNetDebugActorData;

// ScriptStruct IntrepidNet.IntrepidNetDebugNodeFastArray
// 0x0010 (0x0118 - 0x0108)
struct FIntrepidNetDebugNodeFastArray final : public FFastArraySerializer
{
public:
	TArray<struct FIntrepidNetDebugActorData>     Items;                                             // 0x0108(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIntrepidNetDebugNodeFastArray;

// ScriptStruct IntrepidNet.IntrepidNetDebugRealmData
// 0x0050 (0x0050 - 0x0000)
struct FIntrepidNetDebugRealmData final
{
public:
	TArray<struct FIntrepidNetDebugServerData>    Servers;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FBox                                   RealmBounds;                                       // 0x0010(0x0038)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDynamicGriddingEnabled;                         // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIntrepidNetDebugRealmData;

// ScriptStruct IntrepidNet.IntrepidNetTransferData
// 0x0030 (0x0030 - 0x0000)
struct FIntrepidNetTransferData final
{
public:
	struct FTimespan                              LastTransferTime;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              TotalTime;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        TotalAvgTimeMs;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimespan                              MaxTime;                                           // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimespan                              MinTime;                                           // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIntrepidNetTransferData;

// ScriptStruct IntrepidNet.IntrepidNetClientServerDebugData
// 0x0058 (0x0058 - 0x0000)
struct FIntrepidNetClientServerDebugData final
{
public:
	int32                                         ClientsServerId;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntrepidNetDebugRealmData             RealmData;                                         // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIntrepidNetClientServerDebugData;

// ScriptStruct IntrepidNet.IntrepidNetInterServerManagerTickFunction
// 0x0008 (0x0030 - 0x0028)
struct FIntrepidNetInterServerManagerTickFunction final : public FTickFunction
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIntrepidNetInterServerManagerTickFunction;

// ScriptStruct IntrepidNet.IntrepidNetReplicationGraphGlobal
// 0x0018 (0x0018 - 0x0000)
struct FIntrepidNetReplicationGraphGlobal final
{
public:
	class UReplicationGraphNode_GridSpatialization2D* SpatialGridNode;                               // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UReplicationGraphNode_AlwaysRelevant*   AlwaysRelevantNode;                                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UIntrepidNetReplicationGraphNode_LargeCullDistance* LargeCullDistanceActors;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIntrepidNetReplicationGraphGlobal;

// ScriptStruct IntrepidNet.IntrepidNetConfigUnreal
// 0x0070 (0x0070 - 0x0000)
struct FIntrepidNetConfigUnreal final
{
public:
	class FString                                 WorldName;                                         // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldOrigin;                                       // 0x0010(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldSize;                                         // 0x0028(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GridNodesX;                                        // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GridNodesY;                                        // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        PlayerStartLocations;                              // 0x0048(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsVariableDensity;                                // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxServers;                                        // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPartitionTreeSubdivision>      PartitionTree;                                     // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIntrepidNetConfigUnreal;

SDK_NAMESPACE_END
