#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshModelingToolsExp

#include "Basic.hpp"

#include "ModelingOperators_structs.hpp"
#include "MeshModelingTools_structs.hpp"
#include "MeshModelingTools_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MeshModelingToolsExp_structs.hpp"
#include "InteractiveToolsFramework_classes.hpp"
#include "ModelingComponents_structs.hpp"
#include "ModelingComponents_classes.hpp"


SDK_NAMESPACE_START

// Class MeshModelingToolsExp.BakeInputMeshProperties
// 0x0098 (0x0160 - 0x00C8)
class UBakeInputMeshProperties final : public UInteractiveToolPropertySet
{
public:
	class UStaticMesh*                            TargetStaticMesh;                                  // 0x00C8(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class USkeletalMesh*                          TargetSkeletalMesh;                                // 0x00D0(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class AActor*                                 TargetDynamicMesh;                                 // 0x00D8(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class FString                                 TargetUVLayer;                                     // 0x00E0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasTargetUVLayer;                                 // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            SourceStaticMesh;                                  // 0x00F8(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class USkeletalMesh*                          SourceSkeletalMesh;                                // 0x0100(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class AActor*                                 SourceDynamicMesh;                                 // 0x0108(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	bool                                          bHideSourceMesh;                                   // 0x0110(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             SourceNormalMap;                                   // 0x0118(0x0008)(Edit, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class FString                                 SourceNormalMapUVLayer;                            // 0x0120(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBakeNormalSpace                              SourceNormalSpace;                                 // 0x0130(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasSourceNormalMap;                               // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ProjectionDistance;                                // 0x0138(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProjectionInWorldSpace;                           // 0x013C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         TargetUVLayerNamesList;                            // 0x0140(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         SourceUVLayerNamesList;                            // 0x0150(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	const TArray<class FString> GetSourceUVLayerNamesFunc() const;
	const TArray<class FString> GetTargetUVLayerNamesFunc() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BakeInputMeshProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BakeInputMeshProperties")
	}
	static class UBakeInputMeshProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeInputMeshProperties>();
	}
};
DUMPER7_ASSERTS_UBakeInputMeshProperties;

// Class MeshModelingToolsExp.BakeNormalMapToolProperties
// 0x0000 (0x00C8 - 0x00C8)
class UBakeNormalMapToolProperties final : public UInteractiveToolPropertySet
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BakeNormalMapToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BakeNormalMapToolProperties")
	}
	static class UBakeNormalMapToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeNormalMapToolProperties>();
	}
};
DUMPER7_ASSERTS_UBakeNormalMapToolProperties;

// Class MeshModelingToolsExp.BakeOcclusionMapToolProperties
// 0x0018 (0x00E0 - 0x00C8)
class UBakeOcclusionMapToolProperties final : public UInteractiveToolPropertySet
{
public:
	int32                                         OcclusionRays;                                     // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpreadAngle;                                       // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BiasAngle;                                         // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBakeNormalSpace                              NormalSpace;                                       // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BakeOcclusionMapToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BakeOcclusionMapToolProperties")
	}
	static class UBakeOcclusionMapToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeOcclusionMapToolProperties>();
	}
};
DUMPER7_ASSERTS_UBakeOcclusionMapToolProperties;

// Class MeshModelingToolsExp.BakeCurvatureMapToolProperties
// 0x0018 (0x00E0 - 0x00C8)
class UBakeCurvatureMapToolProperties final : public UInteractiveToolPropertySet
{
public:
	EBakeCurvatureTypeMode                        CurvatureType;                                     // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBakeCurvatureColorMode                       ColorMapping;                                      // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ColorRangeMultiplier;                              // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinRangeMultiplier;                                // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBakeCurvatureClampMode                       Clamping;                                          // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BakeCurvatureMapToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BakeCurvatureMapToolProperties")
	}
	static class UBakeCurvatureMapToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeCurvatureMapToolProperties>();
	}
};
DUMPER7_ASSERTS_UBakeCurvatureMapToolProperties;

// Class MeshModelingToolsExp.BakeUVShellMapToolProperties
// 0x0038 (0x0100 - 0x00C8)
class UBakeUVShellMapToolProperties final : public UInteractiveToolPropertySet
{
public:
	int32                                         UVLayer;                                           // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WireframeThickness;                                // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           WireframeColor;                                    // 0x00D0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ShellColor;                                        // 0x00E0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           BackgroundColor;                                   // 0x00F0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BakeUVShellMapToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BakeUVShellMapToolProperties")
	}
	static class UBakeUVShellMapToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeUVShellMapToolProperties>();
	}
};
DUMPER7_ASSERTS_UBakeUVShellMapToolProperties;

// Class MeshModelingToolsExp.BakeHeightMapToolProperties
// 0x0018 (0x00E0 - 0x00C8)
class UBakeHeightMapToolProperties final : public UInteractiveToolPropertySet
{
public:
	EBakeHeightRangeMode                          HeightRangeMode;                                   // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InnerDistance;                                     // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OuterDistance;                                     // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InnerBoundsDistance;                               // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OuterBoundsDistance;                               // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BakeHeightMapToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BakeHeightMapToolProperties")
	}
	static class UBakeHeightMapToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeHeightMapToolProperties>();
	}
};
DUMPER7_ASSERTS_UBakeHeightMapToolProperties;

// Class MeshModelingToolsExp.BakeTexture2DProperties
// 0x0028 (0x00F0 - 0x00C8)
class UBakeTexture2DProperties final : public UInteractiveToolPropertySet
{
public:
	class UTexture2D*                             SourceTexture;                                     // 0x00C8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class FString                                 UVLayer;                                           // 0x00D0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         UVLayerNamesList;                                  // 0x00E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	const TArray<class FString> GetUVLayerNamesFunc() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BakeTexture2DProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BakeTexture2DProperties")
	}
	static class UBakeTexture2DProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeTexture2DProperties>();
	}
};
DUMPER7_ASSERTS_UBakeTexture2DProperties;

// Class MeshModelingToolsExp.BakeMultiTexture2DProperties
// 0x0040 (0x0108 - 0x00C8)
class UBakeMultiTexture2DProperties final : public UInteractiveToolPropertySet
{
public:
	TArray<class UTexture2D*>                     MaterialIDSourceTextures;                          // 0x00C8(0x0010)(Edit, EditFixedSize, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	class FString                                 UVLayer;                                           // 0x00D8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         UVLayerNamesList;                                  // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UTexture2D*>                     AllSourceTextures;                                 // 0x00F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)

public:
	const TArray<class FString> GetUVLayerNamesFunc() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BakeMultiTexture2DProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BakeMultiTexture2DProperties")
	}
	static class UBakeMultiTexture2DProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeMultiTexture2DProperties>();
	}
};
DUMPER7_ASSERTS_UBakeMultiTexture2DProperties;

// Class MeshModelingToolsExp.BakeVisualizationProperties
// 0x0010 (0x00D8 - 0x00C8)
class UBakeVisualizationProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bPreviewAsMaterial;                                // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Brightness;                                        // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AOMultiplier;                                      // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BakeVisualizationProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BakeVisualizationProperties")
	}
	static class UBakeVisualizationProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeVisualizationProperties>();
	}
};
DUMPER7_ASSERTS_UBakeVisualizationProperties;

// Class MeshModelingToolsExp.ExtrudeMeshSelectionToolBuilder
// 0x0000 (0x0048 - 0x0048)
class UExtrudeMeshSelectionToolBuilder final : public USingleTargetWithSelectionToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExtrudeMeshSelectionToolBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExtrudeMeshSelectionToolBuilder")
	}
	static class UExtrudeMeshSelectionToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExtrudeMeshSelectionToolBuilder>();
	}
};
DUMPER7_ASSERTS_UExtrudeMeshSelectionToolBuilder;

// Class MeshModelingToolsExp.ExtrudeMeshSelectionToolProperties
// 0x0048 (0x0110 - 0x00C8)
class UExtrudeMeshSelectionToolProperties final : public UInteractiveToolPropertySet
{
public:
	EExtrudeMeshSelectionInteractionMode          InputMode;                                         // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ExtrudeDistance;                                   // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EExtrudeMeshSelectionRegionModifierMode       RegionMode;                                        // 0x00D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumSubdivisions;                                   // 0x00DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        CreaseAngle;                                       // 0x00E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RaycastMaxDistance;                                // 0x00E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShellsToSolids;                                   // 0x00F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInferGroupsFromNbrs;                              // 0x00F1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGroupPerSubdivision;                              // 0x00F2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReplaceSelectionGroups;                           // 0x00F3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        UVScale;                                           // 0x00F8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUVIslandPerGroup;                                 // 0x0100(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInferMaterialID;                                  // 0x0101(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SetMaterialID;                                     // 0x0104(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowInputMaterials;                               // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExtrudeMeshSelectionToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExtrudeMeshSelectionToolProperties")
	}
	static class UExtrudeMeshSelectionToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExtrudeMeshSelectionToolProperties>();
	}
};
DUMPER7_ASSERTS_UExtrudeMeshSelectionToolProperties;

// Class MeshModelingToolsExp.ExtrudeMeshSelectionTool
// 0x0748 (0x0888 - 0x0140)
class UExtrudeMeshSelectionTool final : public USingleTargetWithSelectionTool
{
public:
	class UExtrudeMeshSelectionToolProperties*    ExtrudeProperties;                                 // 0x0140(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_148[0x720];                                    // 0x0148(0x0720)(Fixing Size After Last Property [ Dumper-7 ])
	class UPreviewMesh*                           SourcePreview;                                     // 0x0868(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMeshOpPreviewWithBackgroundCompute*    EditCompute;                                       // 0x0870(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UCombinedTransformGizmo*                TransformGizmo;                                    // 0x0878(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UTransformProxy*                        TransformProxy;                                    // 0x0880(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExtrudeMeshSelectionTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExtrudeMeshSelectionTool")
	}
	static class UExtrudeMeshSelectionTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExtrudeMeshSelectionTool>();
	}
};
DUMPER7_ASSERTS_UExtrudeMeshSelectionTool;

// Class MeshModelingToolsExp.OffsetMeshSelectionToolBuilder
// 0x0000 (0x0048 - 0x0048)
class UOffsetMeshSelectionToolBuilder final : public USingleTargetWithSelectionToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OffsetMeshSelectionToolBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OffsetMeshSelectionToolBuilder")
	}
	static class UOffsetMeshSelectionToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOffsetMeshSelectionToolBuilder>();
	}
};
DUMPER7_ASSERTS_UOffsetMeshSelectionToolBuilder;

// Class MeshModelingToolsExp.OffsetMeshSelectionToolProperties
// 0x0038 (0x0100 - 0x00C8)
class UOffsetMeshSelectionToolProperties final : public UInteractiveToolPropertySet
{
public:
	double                                        OffsetDistance;                                    // 0x00C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOffsetMeshSelectionDirectionMode             Direction;                                         // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumSubdivisions;                                   // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        CreaseAngle;                                       // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShellsToSolids;                                   // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInferGroupsFromNbrs;                              // 0x00E1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGroupPerSubdivision;                              // 0x00E2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReplaceSelectionGroups;                           // 0x00E3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        UVScale;                                           // 0x00E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUVIslandPerGroup;                                 // 0x00F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInferMaterialID;                                  // 0x00F1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SetMaterialID;                                     // 0x00F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowInputMaterials;                               // 0x00F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OffsetMeshSelectionToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OffsetMeshSelectionToolProperties")
	}
	static class UOffsetMeshSelectionToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOffsetMeshSelectionToolProperties>();
	}
};
DUMPER7_ASSERTS_UOffsetMeshSelectionToolProperties;

// Class MeshModelingToolsExp.OffsetMeshSelectionTool
// 0x0738 (0x0878 - 0x0140)
class UOffsetMeshSelectionTool final : public USingleTargetWithSelectionTool
{
public:
	class UOffsetMeshSelectionToolProperties*     OffsetProperties;                                  // 0x0140(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_148[0x720];                                    // 0x0148(0x0720)(Fixing Size After Last Property [ Dumper-7 ])
	class UPreviewMesh*                           SourcePreview;                                     // 0x0868(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMeshOpPreviewWithBackgroundCompute*    EditCompute;                                       // 0x0870(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OffsetMeshSelectionTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OffsetMeshSelectionTool")
	}
	static class UOffsetMeshSelectionTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOffsetMeshSelectionTool>();
	}
};
DUMPER7_ASSERTS_UOffsetMeshSelectionTool;

// Class MeshModelingToolsExp.PatternToolBuilder
// 0x0008 (0x0050 - 0x0048)
class UPatternToolBuilder final : public UMultiSelectionMeshEditingToolBuilder
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PatternToolBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PatternToolBuilder")
	}
	static class UPatternToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPatternToolBuilder>();
	}
};
DUMPER7_ASSERTS_UPatternToolBuilder;

// Class MeshModelingToolsExp.PatternToolSettings
// 0x0018 (0x00E0 - 0x00C8)
class UPatternToolSettings final : public UInteractiveToolPropertySet
{
public:
	int32                                         Seed;                                              // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProjectElementsDown;                              // 0x00CC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ProjectionOffset;                                  // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideSources;                                      // 0x00D4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRelativeTransforms;                            // 0x00D5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRandomlyPickElements;                             // 0x00D6(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPatternToolShape                             Shape;                                             // 0x00D7(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPatternToolSingleAxis                        SingleAxis;                                        // 0x00D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPatternToolSinglePlane                       SinglePlane;                                       // 0x00D9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PatternToolSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PatternToolSettings")
	}
	static class UPatternToolSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPatternToolSettings>();
	}
};
DUMPER7_ASSERTS_UPatternToolSettings;

// Class MeshModelingToolsExp.PatternTool_BoundingBoxSettings
// 0x0010 (0x00D8 - 0x00C8)
class UPatternTool_BoundingBoxSettings final : public UInteractiveToolPropertySet
{
public:
	bool                                          bIgnoreTransforms;                                 // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Adjustment;                                        // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisualize;                                        // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PatternTool_BoundingBoxSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PatternTool_BoundingBoxSettings")
	}
	static class UPatternTool_BoundingBoxSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPatternTool_BoundingBoxSettings>();
	}
};
DUMPER7_ASSERTS_UPatternTool_BoundingBoxSettings;

// Class MeshModelingToolsExp.PatternTool_LinearSettings
// 0x0020 (0x00E8 - 0x00C8)
class UPatternTool_LinearSettings final : public UInteractiveToolPropertySet
{
public:
	EPatternToolAxisSpacingMode                   SpacingMode;                                       // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        StepSize;                                          // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Extent;                                            // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCentered;                                         // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PatternTool_LinearSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PatternTool_LinearSettings")
	}
	static class UPatternTool_LinearSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPatternTool_LinearSettings>();
	}
};
DUMPER7_ASSERTS_UPatternTool_LinearSettings;

// Class MeshModelingToolsExp.PatternTool_GridSettings
// 0x0038 (0x0100 - 0x00C8)
class UPatternTool_GridSettings final : public UInteractiveToolPropertySet
{
public:
	EPatternToolAxisSpacingMode                   SpacingX;                                          // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CountX;                                            // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        StepSizeX;                                         // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ExtentX;                                           // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCenteredX;                                        // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPatternToolAxisSpacingMode                   SpacingY;                                          // 0x00E1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CountY;                                            // 0x00E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        StepSizeY;                                         // 0x00E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ExtentY;                                           // 0x00F0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCenteredY;                                        // 0x00F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PatternTool_GridSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PatternTool_GridSettings")
	}
	static class UPatternTool_GridSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPatternTool_GridSettings>();
	}
};
DUMPER7_ASSERTS_UPatternTool_GridSettings;

// Class MeshModelingToolsExp.PatternTool_RadialSettings
// 0x0038 (0x0100 - 0x00C8)
class UPatternTool_RadialSettings final : public UInteractiveToolPropertySet
{
public:
	EPatternToolAxisSpacingMode                   SpacingMode;                                       // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        StepSize;                                          // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Radius;                                            // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        StartAngle;                                        // 0x00E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        EndAngle;                                          // 0x00E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        AngleShift;                                        // 0x00F0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOriented;                                         // 0x00F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PatternTool_RadialSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PatternTool_RadialSettings")
	}
	static class UPatternTool_RadialSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPatternTool_RadialSettings>();
	}
};
DUMPER7_ASSERTS_UPatternTool_RadialSettings;

// Class MeshModelingToolsExp.PatternTool_RotationSettings
// 0x0050 (0x0118 - 0x00C8)
class UPatternTool_RotationSettings final : public UInteractiveToolPropertySet
{
public:
	bool                                          bInterpolate;                                      // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bJitter;                                           // 0x00C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               StartRotation;                                     // 0x00D0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               EndRotation;                                       // 0x00E8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               Jitter;                                            // 0x0100(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PatternTool_RotationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PatternTool_RotationSettings")
	}
	static class UPatternTool_RotationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPatternTool_RotationSettings>();
	}
};
DUMPER7_ASSERTS_UPatternTool_RotationSettings;

// Class MeshModelingToolsExp.PatternTool_TranslationSettings
// 0x0050 (0x0118 - 0x00C8)
class UPatternTool_TranslationSettings final : public UInteractiveToolPropertySet
{
public:
	bool                                          bInterpolate;                                      // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bJitter;                                           // 0x00C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                StartTranslation;                                  // 0x00D0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndTranslation;                                    // 0x00E8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Jitter;                                            // 0x0100(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PatternTool_TranslationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PatternTool_TranslationSettings")
	}
	static class UPatternTool_TranslationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPatternTool_TranslationSettings>();
	}
};
DUMPER7_ASSERTS_UPatternTool_TranslationSettings;

// Class MeshModelingToolsExp.PatternTool_ScaleSettings
// 0x0050 (0x0118 - 0x00C8)
class UPatternTool_ScaleSettings final : public UInteractiveToolPropertySet
{
public:
	bool                                          bProportional;                                     // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterpolate;                                      // 0x00C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bJitter;                                           // 0x00CA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                StartScale;                                        // 0x00D0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndScale;                                          // 0x00E8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Jitter;                                            // 0x0100(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PatternTool_ScaleSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PatternTool_ScaleSettings")
	}
	static class UPatternTool_ScaleSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPatternTool_ScaleSettings>();
	}
};
DUMPER7_ASSERTS_UPatternTool_ScaleSettings;

// Class MeshModelingToolsExp.PatternTool_OutputSettings
// 0x0008 (0x00D0 - 0x00C8)
class UPatternTool_OutputSettings final : public UInteractiveToolPropertySet
{
public:
	bool                                          bSeparateActors;                                   // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConvertToDynamic;                                 // 0x00C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateISMCs;                                      // 0x00CA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHaveStaticMeshes;                                 // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableCreateISMCs;                                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PatternTool_OutputSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PatternTool_OutputSettings")
	}
	static class UPatternTool_OutputSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPatternTool_OutputSettings>();
	}
};
DUMPER7_ASSERTS_UPatternTool_OutputSettings;

// Class MeshModelingToolsExp.PatternTool
// 0x03B8 (0x0490 - 0x00D8)
class alignas(0x10) UPatternTool final : public UMultiSelectionMeshEditingTool
{
public:
	class UPatternToolSettings*                   Settings;                                          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UPatternTool_BoundingBoxSettings*       BoundingBoxSettings;                               // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UPatternTool_LinearSettings*            LinearSettings;                                    // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UPatternTool_GridSettings*              GridSettings;                                      // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UPatternTool_RadialSettings*            RadialSettings;                                    // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UPatternTool_RotationSettings*          RotationSettings;                                  // 0x0100(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UPatternTool_TranslationSettings*       TranslationSettings;                               // 0x0108(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UPatternTool_ScaleSettings*             ScaleSettings;                                     // 0x0110(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_118[0x58];                                     // 0x0118(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	class UPatternTool_OutputSettings*            OutputSettings;                                    // 0x0170(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UComponentBoundTransformProxy*          PatternGizmoProxy;                                 // 0x0178(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UInteractiveGizmo*                      PatternGizmo;                                      // 0x0180(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UPrimitiveComponent*                    PatternGizmoComponent;                             // 0x0188(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_190[0x18];                                     // 0x0190(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UDragAlignmentMechanic*                 DragAlignmentMechanic;                             // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UConstructionPlaneMechanic*             PlaneMechanic;                                     // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_1B8[0x1E0];                                    // 0x01B8(0x01E0)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UPrimitiveComponent*>              AllComponents;                                     // 0x0398(0x0050)(ExportObject, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_3E8[0xA0];                                     // 0x03E8(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	class UPreviewGeometry*                       PreviewGeometry;                                   // 0x0488(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PatternTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PatternTool")
	}
	static class UPatternTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPatternTool>();
	}
};
DUMPER7_ASSERTS_UPatternTool;

// Class MeshModelingToolsExp.RevolveSplineToolProperties
// 0x0050 (0x0188 - 0x0138)
class URevolveSplineToolProperties final : public URevolveProperties
{
public:
	ERevolveSplineSampleMode                      SampleMode;                                        // 0x0138(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ErrorTolerance;                                    // 0x0140(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        MaxSampleDistance;                                 // 0x0148(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERevolvePropertiesCapFillMode                 CapFillMode;                                       // 0x0150(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClosePathToAxis;                                  // 0x0151(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AxisOrigin;                                        // 0x0158(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              AxisOrientation;                                   // 0x0170(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetAxisOnStart;                                 // 0x0180(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RevolveSplineToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RevolveSplineToolProperties")
	}
	static class URevolveSplineToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<URevolveSplineToolProperties>();
	}
};
DUMPER7_ASSERTS_URevolveSplineToolProperties;

// Class MeshModelingToolsExp.RevolveSplineToolActionPropertySet
// 0x0008 (0x00D0 - 0x00C8)
class URevolveSplineToolActionPropertySet final : public UInteractiveToolPropertySet
{
public:
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ResetAxis();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RevolveSplineToolActionPropertySet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RevolveSplineToolActionPropertySet")
	}
	static class URevolveSplineToolActionPropertySet* GetDefaultObj()
	{
		return GetDefaultObjImpl<URevolveSplineToolActionPropertySet>();
	}
};
DUMPER7_ASSERTS_URevolveSplineToolActionPropertySet;

// Class MeshModelingToolsExp.BaseMeshFromSplinesTool
// 0x0068 (0x0120 - 0x00B8)
class UBaseMeshFromSplinesTool : public UInteractiveTool
{
public:
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCreateMeshObjectTypeProperties*        OutputTypeProperties;                              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
