#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshModelingToolsExp

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function MeshModelingToolsExp.BakeInputMeshProperties.GetSourceUVLayerNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeInputMeshProperties_GetSourceUVLayerNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BakeInputMeshProperties_GetSourceUVLayerNamesFunc;

// Function MeshModelingToolsExp.BakeInputMeshProperties.GetTargetUVLayerNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeInputMeshProperties_GetTargetUVLayerNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BakeInputMeshProperties_GetTargetUVLayerNamesFunc;

// Function MeshModelingToolsExp.BakeTexture2DProperties.GetUVLayerNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeTexture2DProperties_GetUVLayerNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BakeTexture2DProperties_GetUVLayerNamesFunc;

// Function MeshModelingToolsExp.BakeMultiTexture2DProperties.GetUVLayerNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeMultiTexture2DProperties_GetUVLayerNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BakeMultiTexture2DProperties_GetUVLayerNamesFunc;

// Function MeshModelingToolsExp.BakeMeshAttributeMapsToolProperties.GetMapPreviewNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BakeMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc;

// Function MeshModelingToolsExp.BakeMultiMeshAttributeMapsToolProperties.GetMapPreviewNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeMultiMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BakeMultiMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc;

// Function MeshModelingToolsExp.BakeMultiMeshInputToolProperties.GetTargetUVLayerNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeMultiMeshInputToolProperties_GetTargetUVLayerNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BakeMultiMeshInputToolProperties_GetTargetUVLayerNamesFunc;

// Function MeshModelingToolsExp.MeshInspectorMaterialProperties.GetUVChannelNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct MeshInspectorMaterialProperties_GetUVChannelNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MeshInspectorMaterialProperties_GetUVChannelNamesFunc;

// Function MeshModelingToolsExp.TransferMeshToolProperties.GetSourceLODNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct TransferMeshToolProperties_GetSourceLODNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TransferMeshToolProperties_GetSourceLODNamesFunc;

// Function MeshModelingToolsExp.TransferMeshToolProperties.GetTargetLODNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct TransferMeshToolProperties_GetTargetLODNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TransferMeshToolProperties_GetTargetLODNamesFunc;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
