#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MorphTool

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass MorphTool.MorphTool_C
// 0x0058 (0x03F8 - 0x03A0)
class UMorphTool_C final : public UMorphTool
{
public:
	class UImage*                                 Image;                                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_75;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterCreatorWidgetComponent*       MorphTargetSpot;                                   // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MouseStartPosition;                                // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCharacterCustomizationMorphSections   ActiveMorphSection;                                // 0x03C8(0x0030)(Edit, BlueprintVisible)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MorphTool_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MorphTool_C")
	}
	static class UMorphTool_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMorphTool_C>();
	}
};
DUMPER7_ASSERTS_UMorphTool_C;

SDK_NAMESPACE_END
