#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NetCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// Enum NetCore.ENetworkFailure
// NumValues: 0x000C
enum class ENetworkFailure : uint8
{
	NetDriverAlreadyExists                   = 0,
	NetDriverCreateFailure                   = 1,
	NetDriverListenFailure                   = 2,
	ConnectionLost                           = 3,
	ConnectionTimeout                        = 4,
	FailureReceived                          = 5,
	OutdatedClient                           = 6,
	OutdatedServer                           = 7,
	PendingConnectionFailure                 = 8,
	NetGuidMismatch                          = 9,
	NetChecksumMismatch                      = 10,
	ENetworkFailure_MAX                      = 11,
};

// Enum NetCore.EReplicationSystem
// NumValues: 0x0004
enum class EReplicationSystem : uint8
{
	Default                                  = 0,
	Generic                                  = 1,
	Iris                                     = 2,
	EReplicationSystem_MAX                   = 3,
};

// Enum NetCore.ENetCloseResult
// NumValues: 0x0072
enum class ENetCloseResult : uint8
{
	NetDriverAlreadyExists                   = 0,
	NetDriverCreateFailure                   = 1,
	NetDriverListenFailure                   = 2,
	ConnectionLost                           = 3,
	ConnectionTimeout                        = 4,
	FailureReceived                          = 5,
	OutdatedClient                           = 6,
	OutdatedServer                           = 7,
	PendingConnectionFailure                 = 8,
	NetGuidMismatch                          = 9,
	NetChecksumMismatch                      = 10,
	SecurityMalformedPacket                  = 11,
	SecurityInvalidData                      = 12,
	SecurityClosed                           = 13,
	Unknown                                  = 14,
	Success                                  = 15,
	Extended                                 = 16,
	HostClosedConnection                     = 17,
	Disconnect                               = 18,
	Upgrade                                  = 19,
	PreLoginFailure                          = 20,
	JoinFailure                              = 21,
	JoinSplitFailure                         = 22,
	AddressResolutionFailed                  = 23,
	RPCDoS                                   = 24,
	Cleanup                                  = 25,
	MissingLevelPackage                      = 26,
	PacketHandlerIncomingError               = 27,
	ZeroLastByte                             = 28,
	ZeroSize                                 = 29,
	ReadHeaderFail                           = 30,
	ReadHeaderExtraFail                      = 31,
	AckSequenceMismatch                      = 32,
	BunchBadChannelIndex                     = 33,
	BunchChannelNameFail                     = 34,
	BunchWrongChannelType                    = 35,
	BunchHeaderOverflow                      = 36,
	BunchDataOverflow                        = 37,
	BunchServerPackageMapExports             = 38,
	BunchPrematureControlChannel             = 39,
	BunchPrematureChannel                    = 40,
	BunchPrematureControlClose               = 41,
	UnknownChannelType                       = 42,
	PrematureSend                            = 43,
	CorruptData                              = 44,
	SocketSendFailure                        = 45,
	BadChildConnectionIndex                  = 46,
	LogLimitInstant                          = 47,
	LogLimitSustained                        = 48,
	EncryptionFailure                        = 49,
	EncryptionTokenMissing                   = 50,
	ReceivedNetGUIDBunchFail                 = 51,
	ReceivedNetExtBunchFail                  = 52,
	MaxReliableExceeded                      = 53,
	ReceivedNextBunchFail                    = 54,
	ReceivedNextBunchQueueFail               = 55,
	PartialInitialReliableDestroy            = 56,
	PartialMergeReliableDestroy              = 57,
	PartialInitialNonByteAligned             = 58,
	PartialNonByteAligned                    = 59,
	PartialFinalPackageMapExports            = 60,
	PartialTooLarge                          = 61,
	AlreadyOpen                              = 62,
	ReliableBeforeOpen                       = 63,
	ReliableBufferOverflow                   = 64,
	RPCReliableBufferOverflow                = 65,
	ControlChannelClose                      = 66,
	ControlChannelEndianCheck                = 67,
	ControlChannelPlayerChannelFail          = 68,
	ControlChannelMessageUnknown             = 69,
	ControlChannelMessageFail                = 70,
	ControlChannelMessagePayloadFail         = 71,
	ControlChannelBunchOverflowed            = 72,
	ControlChannelQueueBunchOverflowed       = 73,
	ClientHasMustBeMappedGUIDs               = 74,
	ClientSentDestructionInfo                = 75,
	UnregisteredMustBeMappedGUID             = 76,
	ObjectReplicatorReceivedBunchFail        = 77,
	ContentBlockFail                         = 78,
	ContentBlockHeaderRepLayoutFail          = 79,
	ContentBlockHeaderIsActorFail            = 80,
	ContentBlockHeaderObjFail                = 81,
	ContentBlockHeaderPrematureEnd           = 82,
	ContentBlockHeaderSubObjectActor         = 83,
	ContentBlockHeaderBadParent              = 84,
	ContentBlockHeaderInvalidCreate          = 85,
	ContentBlockHeaderStablyNamedFail        = 86,
	ContentBlockHeaderNoSubObjectClass       = 87,
	ContentBlockHeaderUObjectSubObject       = 88,
	ContentBlockHeaderAActorSubObject        = 89,
	ContentBlockHeaderFail                   = 90,
	ContentBlockPayloadBitsFail              = 91,
	FieldHeaderRepIndex                      = 92,
	FieldHeaderBadRepIndex                   = 93,
	FieldHeaderPayloadBitsFail               = 94,
	FieldPayloadFail                         = 95,
	ReplicationChannelCountMaxedOut          = 96,
	BeaconControlFlowError                   = 97,
	BeaconUnableToParsePacket                = 98,
	BeaconAuthenticationFailure              = 99,
	BeaconLoginInvalidIdError                = 100,
	BeaconLoginInvalidAuthHandlerError       = 101,
	BeaconAuthError                          = 102,
	BeaconSpawnClientWorldPackageNameError   = 103,
	BeaconSpawnExistingActorError            = 104,
	BeaconSpawnFailureError                  = 105,
	BeaconSpawnNetGUIDAckNoActor             = 106,
	BeaconSpawnNetGUIDAckNoHost              = 107,
	BeaconSpawnUnexpectedError               = 108,
	IrisProtocolMismatch                     = 109,
	IrisNetRefHandleError                    = 110,
	FaultDisconnect                          = 111,
	NotRecoverable                           = 112,
	ENetCloseResult_MAX                      = 113,
};

// Enum NetCore.EFastArraySerializerDeltaFlags
// NumValues: 0x0005
enum class EFastArraySerializerDeltaFlags : uint8
{
	None                                     = 0,
	HasBeenSerialized                        = 1,
	HasDeltaBeenRequested                    = 2,
	IsUsingDeltaSerialization                = 4,
	EFastArraySerializerDeltaFlags_MAX       = 5,
};

// ScriptStruct NetCore.FastArraySerializer
// 0x0108 (0x0108 - 0x0000)
struct alignas(0x08) FFastArraySerializer
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IDCounter;                                         // 0x0050(0x0004)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ArrayReplicationKey;                               // 0x0054(0x0004)(ZeroConstructor, SubobjectReference, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0xA8];                                      // 0x0058(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	EFastArraySerializerDeltaFlags                DeltaFlags;                                        // 0x0100(0x0001)(ZeroConstructor, Transient, SubobjectReference, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFastArraySerializer;

// ScriptStruct NetCore.FastMapHelper
// 0x0008 (0x0110 - 0x0108)
struct FFastMapHelper : public FFastArraySerializer
{
public:
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFastMapHelper;

// ScriptStruct NetCore.FastArraySerializerItem
// 0x000C (0x000C - 0x0000)
struct FFastArraySerializerItem
{
public:
	int32                                         ReplicationID;                                     // 0x0000(0x0004)(ZeroConstructor, SubobjectReference, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReplicationKey;                                    // 0x0004(0x0004)(ZeroConstructor, SubobjectReference, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MostRecentArrayReplicationKey;                     // 0x0008(0x0004)(ZeroConstructor, SubobjectReference, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFastArraySerializerItem;

// ScriptStruct NetCore.int64int64MapElement
// 0x0014 (0x0020 - 0x000C)
struct Fint64int64MapElement final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Value;                                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Key;                                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Fint64int64MapElement;

// ScriptStruct NetCore.FMapint64int64
// 0x00E0 (0x01F0 - 0x0110)
struct FFMapint64int64 final : public FFastMapHelper
{
public:
	TArray<struct Fint64int64MapElement>          Items;                                             // 0x0110(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<int64, int64>                            LookUp;                                            // 0x0120(0x0050)(Transient, RepSkip, NativeAccessSpecifierPublic)
	TMap<int64, int64>                            OldLookup;                                         // 0x0170(0x0050)(Transient, RepSkip, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C0[0x30];                                     // 0x01C0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFMapint64int64;

// ScriptStruct NetCore.int64uint16MapElement
// 0x000C (0x0018 - 0x000C)
struct Fint64uint16MapElement final : public FFastArraySerializerItem
{
public:
	uint16                                        Value;                                             // 0x000C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Key;                                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Fint64uint16MapElement;

// ScriptStruct NetCore.FMapint64uint16
// 0x00E0 (0x01F0 - 0x0110)
struct FFMapint64uint16 final : public FFastMapHelper
{
public:
	TArray<struct Fint64uint16MapElement>         Items;                                             // 0x0110(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<int64, uint16>                           LookUp;                                            // 0x0120(0x0050)(Transient, RepSkip, NativeAccessSpecifierPublic)
	TMap<int64, uint16>                           OldLookup;                                         // 0x0170(0x0050)(Transient, RepSkip, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C0[0x30];                                     // 0x01C0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFMapint64uint16;

// ScriptStruct NetCore.int64uint32MapElement
// 0x000C (0x0018 - 0x000C)
struct Fint64uint32MapElement final : public FFastArraySerializerItem
{
public:
	uint32                                        Value;                                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Key;                                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Fint64uint32MapElement;

// ScriptStruct NetCore.FMapint64uint32
// 0x00E0 (0x01F0 - 0x0110)
struct FFMapint64uint32 final : public FFastMapHelper
{
public:
	TArray<struct Fint64uint32MapElement>         Items;                                             // 0x0110(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<int64, uint32>                           LookUp;                                            // 0x0120(0x0050)(Transient, RepSkip, NativeAccessSpecifierPublic)
	TMap<int64, uint32>                           OldLookup;                                         // 0x0170(0x0050)(Transient, RepSkip, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C0[0x30];                                     // 0x01C0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFMapint64uint32;

// ScriptStruct NetCore.int64uint64MapElement
// 0x0014 (0x0020 - 0x000C)
struct Fint64uint64MapElement final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        Value;                                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Key;                                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Fint64uint64MapElement;

// ScriptStruct NetCore.FMapint64uint64
// 0x00E0 (0x01F0 - 0x0110)
struct FFMapint64uint64 final : public FFastMapHelper
{
public:
	TArray<struct Fint64uint64MapElement>         Items;                                             // 0x0110(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<int64, uint64>                           LookUp;                                            // 0x0120(0x0050)(Transient, RepSkip, NativeAccessSpecifierPublic)
	TMap<int64, uint64>                           OldLookup;                                         // 0x0170(0x0050)(Transient, RepSkip, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C0[0x30];                                     // 0x01C0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFMapint64uint64;

// ScriptStruct NetCore.int64int32MapElement
// 0x000C (0x0018 - 0x000C)
struct Fint64int32MapElement final : public FFastArraySerializerItem
{
public:
	int32                                         Value;                                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Key;                                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Fint64int32MapElement;

// ScriptStruct NetCore.FMapint64int32
// 0x00E0 (0x01F0 - 0x0110)
struct FFMapint64int32 final : public FFastMapHelper
{
public:
	TArray<struct Fint64int32MapElement>          Items;                                             // 0x0110(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<int64, int32>                            LookUp;                                            // 0x0120(0x0050)(Transient, RepSkip, NativeAccessSpecifierPublic)
	TMap<int64, int32>                            OldLookup;                                         // 0x0170(0x0050)(Transient, RepSkip, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C0[0x30];                                     // 0x01C0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFMapint64int32;

// ScriptStruct NetCore.int64uint8MapElement
// 0x000C (0x0018 - 0x000C)
struct Fint64uint8MapElement final : public FFastArraySerializerItem
{
public:
	uint8                                         Value;                                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Key;                                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Fint64uint8MapElement;

// ScriptStruct NetCore.FMapint64uint8
// 0x00E0 (0x01F0 - 0x0110)
struct FFMapint64uint8 final : public FFastMapHelper
{
public:
	TArray<struct Fint64uint8MapElement>          Items;                                             // 0x0110(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<int64, uint8>                            LookUp;                                            // 0x0120(0x0050)(Transient, RepSkip, NativeAccessSpecifierPublic)
	TMap<int64, uint8>                            OldLookup;                                         // 0x0170(0x0050)(Transient, RepSkip, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C0[0x30];                                     // 0x01C0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFMapint64uint8;

// ScriptStruct NetCore.int64FVectorMapElement
// 0x0024 (0x0030 - 0x000C)
struct Fint64FVectorMapElement final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Value;                                             // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Key;                                               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Fint64FVectorMapElement;

// ScriptStruct NetCore.FMapint64FVector
// 0x00E0 (0x01F0 - 0x0110)
struct FFMapint64FVector final : public FFastMapHelper
{
public:
	TArray<struct Fint64FVectorMapElement>        Items;                                             // 0x0110(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<int64, struct FVector>                   LookUp;                                            // 0x0120(0x0050)(Transient, RepSkip, NativeAccessSpecifierPublic)
	TMap<int64, struct FVector>                   OldLookup;                                         // 0x0170(0x0050)(Transient, RepSkip, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C0[0x30];                                     // 0x01C0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFMapint64FVector;

// ScriptStruct NetCore.int64floatMapElement
// 0x000C (0x0018 - 0x000C)
struct Fint64floatMapElement final : public FFastArraySerializerItem
{
public:
	float                                         Value;                                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Key;                                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Fint64floatMapElement;

// ScriptStruct NetCore.FMapint64float
// 0x00E0 (0x01F0 - 0x0110)
struct FFMapint64float final : public FFastMapHelper
{
public:
	TArray<struct Fint64floatMapElement>          Items;                                             // 0x0110(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<int64, float>                            LookUp;                                            // 0x0120(0x0050)(Transient, RepSkip, NativeAccessSpecifierPublic)
	TMap<int64, float>                            OldLookup;                                         // 0x0170(0x0050)(Transient, RepSkip, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C0[0x30];                                     // 0x01C0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFMapint64float;

// ScriptStruct NetCore.uint8uint8MapElement
// 0x0004 (0x0010 - 0x000C)
struct Fuint8uint8MapElement final : public FFastArraySerializerItem
{
public:
	uint8                                         Value;                                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Key;                                               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Fuint8uint8MapElement;

// ScriptStruct NetCore.FMapuint8uint8
// 0x00E0 (0x01F0 - 0x0110)
struct FFMapuint8uint8 final : public FFastMapHelper
{
public:
	TArray<struct Fuint8uint8MapElement>          Items;                                             // 0x0110(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<uint8, uint8>                            LookUp;                                            // 0x0120(0x0050)(Transient, RepSkip, NativeAccessSpecifierPublic)
	TMap<uint8, uint8>                            OldLookup;                                         // 0x0170(0x0050)(Transient, RepSkip, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C0[0x30];                                     // 0x01C0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFMapuint8uint8;

// ScriptStruct NetCore.NetAnalyticsDataConfig
// 0x000C (0x000C - 0x0000)
struct FNetAnalyticsDataConfig final
{
public:
	class FName                                   DataName;                                          // 0x0000(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0008(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNetAnalyticsDataConfig;

// ScriptStruct NetCore.StateStruct
// 0x0018 (0x0018 - 0x0000)
struct FStateStruct
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StateName;                                         // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FStateStruct;

// ScriptStruct NetCore.EscalationState
// 0x0018 (0x0030 - 0x0018)
struct FEscalationState : public FStateStruct
{
public:
	bool                                          bLogEscalate;                                      // 0x0018(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDormant;                                          // 0x0019(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         CooloffTime;                                       // 0x001A(0x0002)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         AutoEscalateTime;                                  // 0x001C(0x0002)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          HighestTimePeriod;                                 // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int8>                                  AllTimePeriods;                                    // 0x0020(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FEscalationState;

// ScriptStruct NetCore.NetFaultState
// 0x0010 (0x0040 - 0x0030)
struct FNetFaultState final : public FEscalationState
{
public:
	bool                                          bCloseConnection;                                  // 0x0030(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x1];                                       // 0x0031(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int16                                         EscalateQuotaFaultsPerPeriod;                      // 0x0032(0x0002)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          EscalateQuotaFaultPercentPerPeriod;                // 0x0034(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x1];                                       // 0x0035(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int16                                         DescalateQuotaFaultsPerPeriod;                     // 0x0036(0x0002)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          DescalateQuotaFaultPercentPerPeriod;               // 0x0038(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          EscalateQuotaTimePeriod;                           // 0x0039(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNetFaultState;

SDK_NAMESPACE_END
