#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NetCore

#include "Basic.hpp"

#include "NetCore_structs.hpp"
#include "CoreUObject_classes.hpp"


SDK_NAMESPACE_START

// Class NetCore.NetAnalyticsAggregatorConfig
// 0x0010 (0x0058 - 0x0048)
class UNetAnalyticsAggregatorConfig final : public UObject
{
public:
	TArray<struct FNetAnalyticsDataConfig>        NetAnalyticsData;                                  // 0x0048(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetAnalyticsAggregatorConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetAnalyticsAggregatorConfig")
	}
	static class UNetAnalyticsAggregatorConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetAnalyticsAggregatorConfig>();
	}
};
DUMPER7_ASSERTS_UNetAnalyticsAggregatorConfig;

// Class NetCore.StatePerObjectConfig
// 0x0040 (0x0088 - 0x0048)
class UStatePerObjectConfig : public UObject
{
public:
	uint8                                         Pad_48[0x28];                                      // 0x0048(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PerObjectConfigSection;                            // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnabled;                                          // 0x0080(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StatePerObjectConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StatePerObjectConfig")
	}
	static class UStatePerObjectConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatePerObjectConfig>();
	}
};
DUMPER7_ASSERTS_UStatePerObjectConfig;

// Class NetCore.EscalationManagerConfig
// 0x0020 (0x00A8 - 0x0088)
class UEscalationManagerConfig : public UStatePerObjectConfig
{
public:
	TArray<class FString>                         EscalationSeverity;                                // 0x0088(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x10];                                      // 0x0098(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EscalationManagerConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EscalationManagerConfig")
	}
	static class UEscalationManagerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEscalationManagerConfig>();
	}
};
DUMPER7_ASSERTS_UEscalationManagerConfig;

SDK_NAMESPACE_END
