#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NiagaraUIRenderer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function NiagaraUIRenderer.NiagaraSystemWidget.ActivateSystem
// 0x0001 (0x0001 - 0x0000)
struct NiagaraSystemWidget_ActivateSystem final
{
public:
	bool                                          Reset;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NiagaraSystemWidget_ActivateSystem;

// Function NiagaraUIRenderer.NiagaraSystemWidget.GetNiagaraComponent
// 0x0008 (0x0008 - 0x0000)
struct NiagaraSystemWidget_GetNiagaraComponent final
{
public:
	class UNiagaraUIComponent*                    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NiagaraSystemWidget_GetNiagaraComponent;

// Function NiagaraUIRenderer.NiagaraSystemWidget.GetRemapMaterial
// 0x0010 (0x0010 - 0x0000)
struct NiagaraSystemWidget_GetRemapMaterial final
{
public:
	class UMaterialInterface*                     OriginalMaterial;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NiagaraSystemWidget_GetRemapMaterial;

// Function NiagaraUIRenderer.NiagaraSystemWidget.SetColorAndOpacity
// 0x0010 (0x0010 - 0x0000)
struct NiagaraSystemWidget_SetColorAndOpacity final
{
public:
	struct FLinearColor                           InColorAndOpacity;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NiagaraSystemWidget_SetColorAndOpacity;

// Function NiagaraUIRenderer.NiagaraSystemWidget.SetDesiredWidgetSize
// 0x0010 (0x0010 - 0x0000)
struct NiagaraSystemWidget_SetDesiredWidgetSize final
{
public:
	struct FVector2D                              NewDesiredSize;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NiagaraSystemWidget_SetDesiredWidgetSize;

// Function NiagaraUIRenderer.NiagaraSystemWidget.SetRemapMaterial
// 0x0010 (0x0010 - 0x0000)
struct NiagaraSystemWidget_SetRemapMaterial final
{
public:
	class UMaterialInterface*                     OriginalMaterial;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     RemapMaterial;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NiagaraSystemWidget_SetRemapMaterial;

// Function NiagaraUIRenderer.NiagaraSystemWidget.UpdateNiagaraSystemReference
// 0x0008 (0x0008 - 0x0000)
struct NiagaraSystemWidget_UpdateNiagaraSystemReference final
{
public:
	class UNiagaraSystem*                         NewNiagaraSystem;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NiagaraSystemWidget_UpdateNiagaraSystemReference;

// Function NiagaraUIRenderer.NiagaraSystemWidget.UpdateTickWhenPaused
// 0x0001 (0x0001 - 0x0000)
struct NiagaraSystemWidget_UpdateTickWhenPaused final
{
public:
	bool                                          NewTickWhenPaused;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NiagaraSystemWidget_UpdateTickWhenPaused;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
