#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OodleNetworkHandlerComponent

#include "Basic.hpp"

#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// Class OodleNetworkHandlerComponent.OodleNetworkTrainerCommandlet
// 0x0020 (0x00C0 - 0x00A0)
class UOodleNetworkTrainerCommandlet final : public UCommandlet
{
public:
	bool                                          bCompressionTest;                                  // 0x00A0(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWriteV5Dictionaries;                              // 0x00A1(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HashTableSize;                                     // 0x00A4(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DictionarySize;                                    // 0x00A8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DictionaryTrials;                                  // 0x00AC(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TrialRandomness;                                   // 0x00B0(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TrialGenerations;                                  // 0x00B4(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNoTrials;                                         // 0x00B8(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OodleNetworkTrainerCommandlet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OodleNetworkTrainerCommandlet")
	}
	static class UOodleNetworkTrainerCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOodleNetworkTrainerCommandlet>();
	}
};
DUMPER7_ASSERTS_UOodleNetworkTrainerCommandlet;

SDK_NAMESPACE_END
