#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCGNiagaraInterop

#include "Basic.hpp"

#include "PCG_structs.hpp"
#include "PCG_classes.hpp"


SDK_NAMESPACE_START

// Class PCGNiagaraInterop.PCGWriteToNiagaraDataChannelSettings
// 0x0080 (0x0160 - 0x00E0)
class UPCGWriteToNiagaraDataChannelSettings final : public UPCGSettings
{
public:
	TSoftObjectPtr<class UNiagaraDataChannelAsset> DataChannel;                                      // 0x00E0(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FPCGAttributePropertyInputSelector> NiagaraVariablesPCGAttributeMapping; // 0x0108(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bVisibleToGame;                                    // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisibleToCPU;                                     // 0x0159(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisibleToGPU;                                     // 0x015A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSynchronousLoad;                                  // 0x015B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGWriteToNiagaraDataChannelSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGWriteToNiagaraDataChannelSettings")
	}
	static class UPCGWriteToNiagaraDataChannelSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGWriteToNiagaraDataChannelSettings>();
	}
};
DUMPER7_ASSERTS_UPCGWriteToNiagaraDataChannelSettings;

SDK_NAMESPACE_END
