#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplineTwistCorrect

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "SplineTwistCorrect_structs.hpp"


SDK_NAMESPACE_START

// Class SplineTwistCorrect.SplineTwistCorrectBPLibrary
// 0x0000 (0x0048 - 0x0048)
class USplineTwistCorrectBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void BuildCorrectedSpline(const class USplineComponent* SplineUser, const class USplineComponent* SplineOffset, class USplineComponent* SplineFinal, const float IdealLength);
	static void BuildOffsetSpline(const class USplineComponent* SplineUser, class USplineComponent* SplineOffset, const float RotFromUp, const float OffsetDist);
	static void CalcRailLength(const class USplineComponent* Spline, int32* Number, float* Length, const float IdealLength);
	static void CalcRotFromUp(float* Rotation, const class USplineComponent* Spline, const int32 Index_0, const float Length);
	static void CalcStartEnd(const class USplineComponent* Spline, struct FVector* LocStart, struct FVector* TanStart, struct FVector* LocEnd, struct FVector* TanEnd, const int32 Index_0, const float Length);
	static void ConfigSplineMesh(const int32& Index_0, const float& Length, const class USplineComponent* SplineFinal, class USplineMeshComponent* SplineMesh, const class AActor* Actor, class UMaterialInterface* Material, class UStaticMesh* StaticMesh, const struct FStartEndScale2& StartEndScale, const float Roll);
	static void FixTangents(const class USplineComponent* SplineUser, class USplineComponent* SplineOffset);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SplineTwistCorrectBPLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SplineTwistCorrectBPLibrary")
	}
	static class USplineTwistCorrectBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<USplineTwistCorrectBPLibrary>();
	}
};
DUMPER7_ASSERTS_USplineTwistCorrectBPLibrary;

// Class SplineTwistCorrect.SplineWithMesh
// 0x00C0 (0x06E0 - 0x0620)
class USplineWithMesh final : public USplineComponent
{
public:
	EMeshToUse                                    MeshToUse;                                         // 0x0620(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_621[0x3];                                      // 0x0621(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SubSegmentLength;                                  // 0x0624(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StaticMeshDefault;                                 // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UStaticMesh*>                    StaticMeshArray;                                   // 0x0630(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StaticMesh;                                        // 0x0640(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Length;                                            // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Number;                                            // 0x064C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                       OffsetSpline;                                      // 0x0650(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                       CorrectedSpline;                                   // 0x0658(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USplineMeshComponent*>           SplineMeshArray;                                   // 0x0660(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     MaterialDefault;                                   // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             MaterialArray;                                     // 0x0678(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Material;                                          // 0x0688(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UArrowComponent*>                DirectionArrows;                                   // 0x0690(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UArrowComponent*                        Arrow;                                             // 0x06A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineMeshComponent*                   SplineMesh;                                        // 0x06A8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        Root;                                              // 0x06B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x06B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddDirectionArrows;                               // 0x06C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bArrows;                                           // 0x06C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C2[0x6];                                      // 0x06C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	EMeshScalingType                              MeshScalingType;                                   // 0x06C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C9[0x3];                                      // 0x06C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Scale;                                             // 0x06CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveVector*                           ScaleCurve;                                        // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMeshRollType                                 MeshRollType;                                      // 0x06D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D9[0x3];                                      // 0x06D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RollIncrement;                                     // 0x06DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void AddDirectionArrows();
	void AddMesh(class AActor* PActor);
	void AddRootToParent();
	float GetRollMesh(int32 I);
	struct FStartEndScale2 GetScaleMesh(int32 I);
	void RemoveDirectionArrows();
	void RemoveMesh();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SplineWithMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SplineWithMesh")
	}
	static class USplineWithMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<USplineWithMesh>();
	}
};
DUMPER7_ASSERTS_USplineWithMesh;

// Class SplineTwistCorrect.STC_MathFunctions
// 0x0000 (0x0048 - 0x0048)
class USTC_MathFunctions final : public UBlueprintFunctionLibrary
{
public:
	static void CalcIcosahedron(TArray<struct FVector>* Vertices, const float Radius);
	static bool FindNextSplineLocation(class UObject* WorldContextObject, struct FVector* NextLocation, struct FVector* NextUpVector, const float SegmentLength, const struct FVector& LastLocation, const struct FVector& LastDirection, const int32 Seed);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("STC_MathFunctions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"STC_MathFunctions")
	}
	static class USTC_MathFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTC_MathFunctions>();
	}
};
DUMPER7_ASSERTS_USTC_MathFunctions;

SDK_NAMESPACE_END
