#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_DamageMeterHitData

#include "Basic.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_DamageMeterHitData.ST_DamageMeterHitData
// 0x0038 (0x0038 - 0x0000)
struct FST_DamageMeterHitData final
{
public:
	double                                        hitTotal_16_3A29219E4D7DAA522F8004894ADD1B40;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        critTotal_17_8D2358794BB08EE3340DE281573A300F;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        effectiveHitTotal_20_1F4673254B7C7A80780BC797F40BE160; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        effectiveCritTotal_22_1444362F4437E8BDD2360381DCF40701; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        baseTotal_26_85BAFC6F43ED7EED82C4E6A9B7985EBC;     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         hitCount_11_2FA3C35547B60A30C630E3BC598CC797;      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         critCount_13_EB6665C24266CAAA7C4051A1504AD65A;     // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         missCount_15_614C4FF647C39DE2BEF603AE193690FB;     // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_DamageMeterHitData;

SDK_NAMESPACE_END
