#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_DamageMeterTimeData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_DamageMeterTimeData.ST_DamageMeterTimeData
// 0x0040 (0x0040 - 0x0000)
struct FST_DamageMeterTimeData final
{
public:
	struct FGuid                                  instigator_16_766E359449780554AA266B8D88FA7430;    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        newValue_32_E97C725C449E656CF2EC03A202C8B4A7;      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        maxHP_30_3DD85F804938E62B5968DBA6E019F714;         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        delta_25_E23027C84A4F0C5F3C3F0098E0A658F5;         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        time_21_7EF0D7E3488B062282F0E79808F4FC4A;          // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         hit_24_478A28B64A4C5D386EC7D989A199356E;           // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          rebasedBefore_34_0F7BAD5F4DFA95807FE40B81256750DF; // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         hitFlags_37_F057CF8243009082AA97E88C459A2CD3;      // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_DamageMeterTimeData;

SDK_NAMESPACE_END
