#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TextureUtilitiesCommon

#include "Basic.hpp"

#include "TextureUtilitiesCommon_structs.hpp"
#include "DeveloperSettings_classes.hpp"


SDK_NAMESPACE_START

// Class TextureUtilitiesCommon.TextureImportSettings
// 0x0010 (0x0068 - 0x0058)
class UTextureImportSettings final : public UDeveloperSettings
{
public:
	int32                                         AutoVTSize;                                        // 0x0058(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AutoLimitDimension;                                // 0x005C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableNormalizeNormals;                           // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFastMipFilter;                              // 0x0061(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureImportFloatingPointFormat             CompressedFormatForFloatTextures;                  // 0x0062(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureImportPNGInfill                       PNGInfill;                                         // 0x0063(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TextureImportSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TextureImportSettings")
	}
	static class UTextureImportSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextureImportSettings>();
	}
};
DUMPER7_ASSERTS_UTextureImportSettings;

// Class TextureUtilitiesCommon.TextureImportUserSettings
// 0x0008 (0x0060 - 0x0058)
class UTextureImportUserSettings final : public UDeveloperSettings
{
public:
	ETextureImportPNGInfill                       PNGInfill;                                         // 0x0058(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TextureImportUserSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TextureImportUserSettings")
	}
	static class UTextureImportUserSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextureImportUserSettings>();
	}
};
DUMPER7_ASSERTS_UTextureImportUserSettings;

SDK_NAMESPACE_END
