#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "PBIK_structs.hpp"
#include "RigVM_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimationCore_structs.hpp"


SDK_NAMESPACE_START

// PropertyBag Transient.PropertyBag_0
// 0x0000 (0x0000 - 0x0000)
struct FPropertyBag_0 final
{
};
DUMPER7_ASSERTS_FPropertyBag_0;

// PropertyBag Transient.PropertyBag_f61ce0ae812e7cfe
// 0x07E0 (0x07E0 - 0x0000)
struct FPropertyBag_f61ce0ae812e7cfe final
{
public:
	struct FRigElementKey                         RigVMModel___ParentConstraint_Child__Const;        // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___ParentConstraint_bMaintainOffset__Const; // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransformFilter                       RigVMModel___ParentConstraint_Filter__Const;       // 0x000D(0x0009)(Edit, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              RigVMModel___ParentConstraint_Parents__Const;      // 0x0018(0x0010)(Edit)
	struct FRigUnit_ParentConstraint_AdvancedSettings RigVMModel___ParentConstraint_AdvancedSettings__Const; // 0x0028(0x0002)(Edit, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___ParentConstraint_Weight__Const;       // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ParentConstraint_3_Child__Const;      // 0x0030(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              RigVMModel___ParentConstraint_3_Parents__Const;    // 0x0040(0x0010)(Edit)
	struct FRigUnit_ParentConstraint_AdvancedSettings RigVMModel___ParentConstraint_3_AdvancedSettings__Const; // 0x0050(0x0002)(Edit, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RigVMModel___GetCurveValue_Curve__Const;           // 0x0054(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___DISPATCH_RigVMDispatch_If_1_False__Const; // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___GetTransform_2_Space__Const;          // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___GetTransform_2_bInitial__Const;       // 0x0061(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           RigVMModel___RigVMFunction_MathQuaternionToEuler_3_RotationOrder__Const; // 0x0062(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Remap_SourceMinimum__Const;           // 0x0068(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_SourceMaximum__Const;           // 0x0070(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_TargetMinimum__Const;           // 0x0078(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_TargetMaximum__Const;           // 0x0080(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_Item__Const;     // 0x0088(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_Item__Const;             // 0x0094(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Greater_1_B__Const;                   // 0x00A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Greater_B__Const;                     // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_1_1_SourceMaximum__Const;       // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMDebugDrawSettings                RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_DebugDrawSettings__Const; // 0x00B8(0x0008)(Edit, NoDestructor)
	ERigUnitDebugTransformMode                    RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Color__Const; // 0x00C4(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Thickness__Const; // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_WorldOffset__Const; // 0x00E0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_2_1_Item__Const;        // 0x0140(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterp_1_Strength__Const;       // 0x014C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SpringInterp_1_Force__Const;          // 0x0150(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_1_1_1_1_Item__Const;          // 0x0168(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_1_1_1_1_Secondary__Const;     // 0x0178(0x0048)(Edit, NoDestructor)
	double                                        RigVMModel___Multiply_A__Const;                    // 0x01C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C8[0x8];                                      // 0x01C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         RigVMModel___AimItem_1_1_1_1_DebugSettings__Const; // 0x01D0(0x0070)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___AimItem_1_1_1_Item__Const;            // 0x0240(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Multiply_2_A__Const;                  // 0x0250(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_1_1_Item__Const;              // 0x0258(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Multiply_3_A__Const;                  // 0x0268(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_1_Item__Const;                // 0x0270(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Multiply_4_A__Const;                  // 0x0280(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_Item__Const;                  // 0x0288(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SpawnControl_1_Parent__Const;         // 0x0294(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SpawnControl_1_Name__Const;           // 0x02A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___SpawnControl_1_Settings__Const; // 0x02B0(0x0180)(Edit)
	class FName                                   RigVMModel___SpawnControl_Name__Const;             // 0x0430(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SpawnControl_2_2_Parent__Const;       // 0x0438(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SpawnControl_2_2_Name__Const;         // 0x0444(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___SpawnControl_2_2_OffsetTransform__Const; // 0x0450(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Add_B__Const;                         // 0x04B0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C8[0x8];                                      // 0x04C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___SpawnControl_2_2_Settings__Const; // 0x04D0(0x0180)(Edit)
	class FName                                   RigVMModel___SpawnControl_1_1_1_Name__Const;       // 0x0650(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___SpawnControl_1_1_1_OffsetSpace__Const; // 0x0658(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___SpawnControl_1_1_1_Settings__Const; // 0x0660(0x0180)(Edit)
};
DUMPER7_ASSERTS_FPropertyBag_f61ce0ae812e7cfe;

// PropertyBag Transient.PropertyBag_2bfff30a2279f83b
// 0x04D0 (0x04D0 - 0x0000)
struct FPropertyBag_2bfff30a2279f83b final
{
public:
	struct FRigElementKey                         RigVMModel___Set_Transform_Item__Const;            // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___Set_Transform_Space__Const;           // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Set_Transform_bInitial__Const;        // 0x000D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_Item__Const;         // 0x0010(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Set_Transform_Weight__Const;          // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Set_Transform_bPropagateToChildren__Const; // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Set_Transform_1_Item__Const;          // 0x0024(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_3_1_Item__Const;         // 0x0030(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_2_Item__Const;          // 0x003C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_3_2_Item__Const;         // 0x0048(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___trace_z_Slope_Degree__Const;          // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___trace_z_Ray_Cast_Start__Const;        // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___trace_z_Ray_Cast_End__Const;          // 0x0068(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___trace_z_Offset_For_Geo_Thickness__Const; // 0x0070(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  LocalVariableDefault__trace_z_foot_normal_hit_L__Const; // 0x0080(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__trace_z_foot_normal_hit_target__Const; // 0x00A0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMDebugDrawSettings                trace_z___trace_z_RigVMFunction_DebugLineNoSpace_DebugDrawSettings__Const; // 0x00C0(0x0008)(Edit, NoDestructor)
	bool                                          trace_z___trace_z_GetTransform_bInitial__Const;    // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        trace_z___trace_z_Remap_SourceMinimum__Const;      // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        trace_z___trace_z_Remap_SourceMaximum__Const;      // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        trace_z___trace_z_Remap_TargetMinimum__Const;      // 0x00E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           trace_z___trace_z_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x00E8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             trace_z___trace_z_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0100(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          trace_z___trace_z_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x0160(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               trace_z___trace_z_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0161(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    trace_z___trace_z_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0162(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163[0x1];                                      // 0x0163(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         trace_z___trace_z_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x0164(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_1_ItemToModify__Const; // 0x0168(0x0010)(Edit)
	double                                        RigVMModel___Remap_SourceMaximum__Const;           // 0x0178(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_TargetMaximum__Const;           // 0x0180(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Multiply_B__Const;                    // 0x0188(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___ModifyTransforms_1_1_WeightMinimum__Const; // 0x0190(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EControlRigModifyBoneMode                     RigVMModel___ModifyTransforms_1_1_Mode__Const;     // 0x0194(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_ItemToModify__Const; // 0x0198(0x0010)(Edit)
	double                                        RigVMModel___Remap_1_TargetMaximum__Const;         // 0x01A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_2_ItemToModify__Const; // 0x01B0(0x0010)(Edit)
	class FName                                   RigVMModel___GetCurveValue_2_1_3_Curve__Const;     // 0x01C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___PBIK_Root__Const;                     // 0x01C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_Effectors__Const;                // 0x01D0(0x0010)(Edit)
	class FName                                   RigVMModel___GetCurveValue_2_1_Curve__Const;       // 0x01E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_2_1_1_1_Curve__Const;   // 0x01E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_2_1_1_Curve__Const;     // 0x01F0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKBoneSetting>               RigVMModel___PBIK_BoneSettings__Const;             // 0x01F8(0x0010)(Edit)
	TArray<class FName>                           RigVMModel___PBIK_ExcludedBones__Const;            // 0x0208(0x0010)(Edit)
	struct FPBIKSolverSettings                    RigVMModel___PBIK_Settings__Const;                 // 0x0218(0x0040)(Edit, NoDestructor)
	struct FPBIKDebug                             RigVMModel___PBIK_Debug__Const;                    // 0x0258(0x0008)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_Item__Const;    // 0x0260(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_Parent__Const;  // 0x026C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___Control_Stack_at_Item_Name__Const;    // 0x0278(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___Control_Stack_at_Item_Settings__Const; // 0x0280(0x0180)(Edit)
	class FName                                   RigVMModel___Control_Stack_at_Item_Control_Suffix__Const; // 0x0400(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___Control_Stack_at_Item_Null_Suffix__Const; // 0x0408(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Item___Control_Stack_at_Item_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x0410(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_control__Const; // 0x0418(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__Control_Stack_at_Position_the_null__Const; // 0x0424(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_Parent__Const; // 0x0430(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_OffsetSpace__Const; // 0x043C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D[0x3];                                      // 0x043D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_Concat_2_B__Const; // 0x0440(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_Name__Const; // 0x0448(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigMetaDataNameSpace                         Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_NameSpace__Const; // 0x0450(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_Concat_1_1_B__Const; // 0x0454(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_2_Name__Const; // 0x045C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_1_Name__Const; // 0x0464(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_SetMetadataTag_Tag__Const; // 0x046C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Item___Control_Stack_at_Item_DISPATCH_RigDispatch_SetMetadata_1_1_1_Name__Const; // 0x0474(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_1_Item__Const;  // 0x047C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_1_Parent__Const; // 0x0488(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___Control_Stack_at_Item_1_Name__Const;  // 0x0494(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_1_1_Item__Const; // 0x049C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___Control_Stack_at_Item_1_1_Name__Const; // 0x04A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_1_2_Item__Const; // 0x04B0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___Control_Stack_at_Item_1_2_Name__Const; // 0x04BC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_2bfff30a2279f83b;

// PropertyBag Transient.PropertyBag_1ea394170ff447b7
// 0x0F80 (0x0F80 - 0x0000)
struct FPropertyBag_1ea394170ff447b7 final
{
public:
	struct FTransform                             RigVMModel___GetTransform_2_1_Transform;           // 0x0000(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_1_CachedIndex;         // 0x0060(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_CachedIndex;            // 0x0070(0x0010)(Edit)
	struct FTransform                             RigVMModel___GetTransform_3_1_Transform;           // 0x0080(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_3_1_CachedIndex;         // 0x00E0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_1_CachedIndex;          // 0x00F0(0x0010)(Edit)
	struct FTransform                             RigVMModel___GetTransform_3_2_Transform;           // 0x0100(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_3_2_CachedIndex;         // 0x0160(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_2_CachedIndex;          // 0x0170(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_1_ItemToModify__IO; // 0x0180(0x0010)(Edit)
	double                                        RigVMModel___Remap_Result;                         // 0x0190(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_1_1_WorkData;    // 0x0198(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_ItemToModify__IO; // 0x01A8(0x0010)(Edit)
	double                                        RigVMModel___Remap_1_Result;                       // 0x01B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_1_WorkData;      // 0x01C0(0x0010)(Edit)
	float                                         RigVMModel___If_1_2_1_3_Result;                    // 0x01D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigVMInstructionSetExecuteState       BlockExecuteState_1414009129;                      // 0x01D8(0x0050)(Edit)
	bool                                          RigVMModel___GetCurveValue_2_1_3_Valid;            // 0x0228(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___GetCurveValue_2_1_3_Value;            // 0x022C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetCurveValue_2_1_3_CachedCurveIndex; // 0x0230(0x0010)(Edit)
	bool                                          RigVMModel___If_1_2_1_3_Condition;                 // 0x0240(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_2_WorkData;      // 0x0248(0x0010)(Edit)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_Effectors__IO;                   // 0x0258(0x0010)(Edit)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___GetTransform_Transform;               // 0x0270(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_CachedIndex;             // 0x02D0(0x0010)(Edit)
	float                                         RigVMModel___If_1_2_1_Result;                      // 0x02E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigVMInstructionSetExecuteState       BlockExecuteState_470272901;                       // 0x02E8(0x0050)(Edit)
	bool                                          RigVMModel___GetCurveValue_2_1_Valid;              // 0x0338(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___GetCurveValue_2_1_Value;              // 0x033C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetCurveValue_2_1_CachedCurveIndex;   // 0x0340(0x0010)(Edit)
	bool                                          RigVMModel___If_1_2_1_Condition;                   // 0x0350(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___If_1_2_1_1_1_Result;                  // 0x0354(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMInstructionSetExecuteState       BlockExecuteState_2469067345;                      // 0x0358(0x0050)(Edit)
	bool                                          RigVMModel___GetCurveValue_2_1_1_1_Valid;          // 0x03A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___GetCurveValue_2_1_1_1_Value;          // 0x03AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetCurveValue_2_1_1_1_CachedCurveIndex; // 0x03B0(0x0010)(Edit)
	bool                                          RigVMModel___If_1_2_1_1_1_Condition;               // 0x03C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0xF];                                      // 0x03C1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___GetTransform_1_Transform;             // 0x03D0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_1_CachedIndex;           // 0x0430(0x0010)(Edit)
	float                                         RigVMModel___If_1_2_1_1_Result;                    // 0x0440(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigVMInstructionSetExecuteState       BlockExecuteState_3535998025;                      // 0x0448(0x0050)(Edit)
	bool                                          RigVMModel___GetCurveValue_2_1_1_Valid;            // 0x0498(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x3];                                      // 0x0499(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___GetCurveValue_2_1_1_Value;            // 0x049C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetCurveValue_2_1_1_CachedCurveIndex; // 0x04A0(0x0010)(Edit)
	bool                                          RigVMModel___If_1_2_1_1_Condition;                 // 0x04B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0xF];                                      // 0x04B1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___GetTransform_2_Transform;             // 0x04C0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_CachedIndex;           // 0x0520(0x0010)(Edit)
	float                                         RigVMModel___If_1_2_1_2_Result;                    // 0x0530(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigVMInstructionSetExecuteState       BlockExecuteState_946181682;                       // 0x0538(0x0050)(Edit)
	bool                                          RigVMModel___GetCurveValue_2_1_2_Valid;            // 0x0588(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___GetCurveValue_2_1_2_Value;            // 0x058C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetCurveValue_2_1_2_CachedCurveIndex; // 0x0590(0x0010)(Edit)
	bool                                          RigVMModel___If_1_2_1_2_Condition;                 // 0x05A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TArray<int32>>                         RigVMModel___PBIK_EffectorSolverIndices;           // 0x05A8(0x0010)(Edit)
	TArray<struct FPBIKWorkData>                  RigVMModel___PBIK_WorkData;                        // 0x05B8(0x0010)(Edit)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_Control;        // 0x05C8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_Null;           // 0x05D4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_Secondary;      // 0x05E0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_Bottom_Null;    // 0x05EC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F8[0x8];                                      // 0x05F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Control_Stack_at_Item___Control_Stack_at_Item_GetTransform_1_Transform; // 0x0600(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              Control_Stack_at_Item___Control_Stack_at_Item_GetTransform_1_CachedIndex; // 0x0660(0x0010)(Edit)
	class FName                                   Control_Stack_at_Item___Control_Stack_at_Item_If_Result; // 0x0670(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Control_Stack_at_Item___Control_Stack_at_Item_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x0678(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Control_Stack_at_Item___Control_Stack_at_Item_If_Condition; // 0x0679(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67A[0x2];                                      // 0x067A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Item___Control_Stack_at_Item_If_False; // 0x067C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_Concat_Result; // 0x0684(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_Item; // 0x068C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Control_Stack_at_Position___Control_Stack_at_Position_Make_Relative_Local; // 0x06A0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Control_Stack_at_Position___Control_Stack_at_Position_GetTransform_1_Transform; // 0x0700(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_GetTransform_1_CachedIndex; // 0x0760(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_1_CachedIndex; // 0x0770(0x0010)(Edit)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x0780(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_788[0x8];                                      // 0x0788(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Control_Stack_at_Position___Control_Stack_at_Position_GetTransform_2_Transform; // 0x0790(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_GetTransform_2_CachedIndex; // 0x07F0(0x0010)(Edit)
	struct FTransform                             Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_1_1_Value__IO; // 0x0800(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_1_1_CachedIndex; // 0x0860(0x0010)(Edit)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_RigVMFunction_ControlFlowBranch_1_1_BlockToRun; // 0x0870(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_Concat_2_1_Result; // 0x0878(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_Concat_2_Result; // 0x0880(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Control_Stack_at_Position___Control_Stack_at_Position_SpawnControl_1_Item; // 0x0888(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_BranchNode_2_BlockToRun; // 0x0894(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Control_Stack_at_Position___Control_Stack_at_Position_Add_Null_Above_Null; // 0x089C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Add_Null_Above___Add_Null_Above_HierarchyGetParent_Parent; // 0x08A8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B4[0x4];                                      // 0x08B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              Add_Null_Above___Add_Null_Above_HierarchyGetParent_CachedChild; // 0x08B8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Add_Null_Above___Add_Null_Above_HierarchyGetParent_CachedParent; // 0x08C8(0x0010)(Edit)
	class FName                                   Add_Null_Above___Add_Null_Above_Concat_Result;     // 0x08D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Add_Null_Above___Add_Null_Above_Replace_Result;    // 0x08E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Add_Null_Above___Add_Null_Above_Replace_Name;      // 0x08E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Add_Null_Above___Add_Null_Above_GetTransform_1_Transform; // 0x08F0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              Add_Null_Above___Add_Null_Above_GetTransform_1_CachedIndex; // 0x0950(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_Cache; // 0x0960(0x0010)(Edit)
	bool                                          Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_Success; // 0x0970(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_971[0xF];                                      // 0x0971(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Control_Stack_at_Position___Control_Stack_at_Position_GetTransform_Transform; // 0x0980(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_GetTransform_CachedIndex; // 0x09E0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_CachedIndex; // 0x09F0(0x0010)(Edit)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0A00(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_Branch_BlockToRun; // 0x0A08(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Control_Stack_at_Position___Control_Stack_at_Position_If_1_Result; // 0x0A10(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	bool                                          Control_Stack_at_Position___Control_Stack_at_Position_If_1_Condition; // 0x0A1C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1D[0x3];                                      // 0x0A1D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_Concat_1_1_Result; // 0x0A20(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Control_Stack_at_Position___Control_Stack_at_Position_HierarchyAddNull_1_Item; // 0x0A28(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A34[0x4];                                      // 0x0A34(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_2_Cache; // 0x0A38(0x0010)(Edit)
	bool                                          Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_2_Success; // 0x0A48(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A49[0x3];                                      // 0x0A49(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_BranchNode_1_BlockToRun; // 0x0A4C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A54[0x4];                                      // 0x0A54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_1_Cache; // 0x0A58(0x0010)(Edit)
	bool                                          Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_1_Success; // 0x0A68(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A69[0x7];                                      // 0x0A69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_SetMetadataTag_CachedIndex; // 0x0A70(0x0010)(Edit)
	class FName                                   Control_Stack_at_Position___Control_Stack_at_Position_RigVMFunction_ControlFlowBranch_2_BlockToRun; // 0x0A80(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              Control_Stack_at_Item___Control_Stack_at_Item_DISPATCH_RigDispatch_SetMetadata_1_1_1_Cache; // 0x0A88(0x0010)(Edit)
	bool                                          Control_Stack_at_Item___Control_Stack_at_Item_DISPATCH_RigDispatch_SetMetadata_1_1_1_Success; // 0x0A98(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A99[0x3];                                      // 0x0A99(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_1_Control;      // 0x0A9C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_1_Null;         // 0x0AA8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_1_Secondary;    // 0x0AB4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_1_Bottom_Null;  // 0x0AC0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ACC[0x4];                                      // 0x0ACC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Control_Stack_at_Item_1___Control_Stack_at_Item_GetTransform_1_Transform; // 0x0AD0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              Control_Stack_at_Item_1___Control_Stack_at_Item_GetTransform_1_CachedIndex; // 0x0B30(0x0010)(Edit)
	class FName                                   Control_Stack_at_Item_1___Control_Stack_at_Item_If_Result; // 0x0B40(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Control_Stack_at_Item_1___Control_Stack_at_Item_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x0B48(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Control_Stack_at_Item_1___Control_Stack_at_Item_If_Condition; // 0x0B49(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4A[0x2];                                      // 0x0B4A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Item_1___Control_Stack_at_Item_If_False; // 0x0B4C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B54[0x4];                                      // 0x0B54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_GetTransform_1_CachedIndex_01; // 0x0B58(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_1_CachedIndex_01; // 0x0B68(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_GetTransform_2_CachedIndex_01; // 0x0B78(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_1_1_CachedIndex_01; // 0x0B88(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Add_Null_Above___Add_Null_Above_HierarchyGetParent_CachedChild_01; // 0x0B98(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Add_Null_Above___Add_Null_Above_HierarchyGetParent_CachedParent_01; // 0x0BA8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Add_Null_Above___Add_Null_Above_GetTransform_1_CachedIndex_01; // 0x0BB8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_Cache_01; // 0x0BC8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_GetTransform_CachedIndex_01; // 0x0BD8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_CachedIndex_01; // 0x0BE8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_2_Cache_01; // 0x0BF8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_1_Cache_01; // 0x0C08(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_SetMetadataTag_CachedIndex_01; // 0x0C18(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Item_1___Control_Stack_at_Item_DISPATCH_RigDispatch_SetMetadata_1_1_1_Cache; // 0x0C28(0x0010)(Edit)
	bool                                          Control_Stack_at_Item_1___Control_Stack_at_Item_DISPATCH_RigDispatch_SetMetadata_1_1_1_Success; // 0x0C38(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C39[0x3];                                      // 0x0C39(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_1_1_Control;    // 0x0C3C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_1_1_Null;       // 0x0C48(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_1_1_Secondary;  // 0x0C54(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Control_Stack_at_Item_1_1_Bottom_Null; // 0x0C60(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6C[0x4];                                      // 0x0C6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Control_Stack_at_Item_1_1___Control_Stack_at_Item_GetTransform_1_Transform; // 0x0C70(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              Control_Stack_at_Item_1_1___Control_Stack_at_Item_GetTransform_1_CachedIndex; // 0x0CD0(0x0010)(Edit)
	class FName                                   Control_Stack_at_Item_1_1___Control_Stack_at_Item_If_Result; // 0x0CE0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Control_Stack_at_Item_1_1___Control_Stack_at_Item_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x0CE8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Control_Stack_at_Item_1_1___Control_Stack_at_Item_If_Condition; // 0x0CE9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CEA[0x2];                                      // 0x0CEA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Control_Stack_at_Item_1_1___Control_Stack_at_Item_If_False; // 0x0CEC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF4[0x4];                                      // 0x0CF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_GetTransform_1_CachedIndex_02; // 0x0CF8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_1_CachedIndex_02; // 0x0D08(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_GetTransform_2_CachedIndex_02; // 0x0D18(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_1_1_CachedIndex_02; // 0x0D28(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Add_Null_Above___Add_Null_Above_HierarchyGetParent_CachedChild_02; // 0x0D38(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Add_Null_Above___Add_Null_Above_HierarchyGetParent_CachedParent_02; // 0x0D48(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Add_Null_Above___Add_Null_Above_GetTransform_1_CachedIndex_02; // 0x0D58(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_Cache_02; // 0x0D68(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_GetTransform_CachedIndex_02; // 0x0D78(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_Set_Transform_CachedIndex_02; // 0x0D88(0x0010)(Edit)
	TArray<struct FCachedRigElement>              Control_Stack_at_Position___Control_Stack_at_Position_DISPATCH_RigDispatch_SetMetadata_2_Cache_02; // 0x0D98(0x0010)(Edit)
