#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Accordion

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Accordion.WBP_Accordion_C.ExecuteUbergraph_WBP_Accordion
// 0x0008 (0x0008 - 0x0000)
struct WBP_Accordion_C_ExecuteUbergraph_WBP_Accordion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Accordion_C_ExecuteUbergraph_WBP_Accordion;

// Function WBP_Accordion.WBP_Accordion_C.GetBreadcrumbWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Accordion_C_GetBreadcrumbWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Accordion_C_GetBreadcrumbWidget;

// Function WBP_Accordion.WBP_Accordion_C.GetButtonContainer
// 0x0008 (0x0008 - 0x0000)
struct WBP_Accordion_C_GetButtonContainer final
{
public:
	class UPanelWidget*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Accordion_C_GetButtonContainer;

// Function WBP_Accordion.WBP_Accordion_C.GetEvenButtonStyle
// 0x0008 (0x0008 - 0x0000)
struct WBP_Accordion_C_GetEvenButtonStyle final
{
public:
	TSubclassOf<class UCommonButtonStyle>         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Accordion_C_GetEvenButtonStyle;

// Function WBP_Accordion.WBP_Accordion_C.GetOddButtonStyle
// 0x0008 (0x0008 - 0x0000)
struct WBP_Accordion_C_GetOddButtonStyle final
{
public:
	TSubclassOf<class UCommonButtonStyle>         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Accordion_C_GetOddButtonStyle;

// Function WBP_Accordion.WBP_Accordion_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Accordion_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Accordion_C_PreConstruct;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
