#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JournalAccordion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_JournalAccordion.WBP_JournalAccordion_C
// 0x0028 (0x0698 - 0x0670)
class UWBP_JournalAccordion_C final : public UJournalAccordion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_JournalItem_C*                     WBP_JournalItem_2;                                 // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_JournalItem_C*                     WBP_JournalItem_1;                                 // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_JournalItem_C*                     WBP_JournalItem;                                   // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnreadNotifier;                                    // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_JournalAccordion(int32 EntryPoint);
	class UWidget* GetBreadcrumbWidget();
	class UPanelWidget* GetButtonContainer();
	TSubclassOf<class UCommonButtonStyle> GetEvenButtonStyle();
	TSubclassOf<class UCommonButtonStyle> GetOddButtonStyle();
	void Set_Chapter_Text(const class FText& Chapter_Text);
	void Set_Story_Arc_Type_Icon(class UTexture2D* Story_Arc_Type_Icon);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_JournalAccordion_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_JournalAccordion_C")
	}
	static class UWBP_JournalAccordion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_JournalAccordion_C>();
	}
};
DUMPER7_ASSERTS_UWBP_JournalAccordion_C;

SDK_NAMESPACE_END
