#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BulletinBoard_ActiveConstructionItem

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_BulletinBoard_ActiveConstructionItem.WBP_BulletinBoard_ActiveConstructionItem_C
// 0x0030 (0x03D0 - 0x03A0)
class UWBP_BulletinBoard_ActiveConstructionItem_C final : public UActiveConstructionItem
{
public:
	class UWBP_BB_ConstructionResourceItem_C*     WBP_BB_ConstructionResourceItem_3;                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BB_ConstructionResourceItem_C*     WBP_BB_ConstructionResourceItem_2;                 // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BB_ConstructionResourceItem_C*     WBP_BB_ConstructionResourceItem_1;                 // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BB_ConstructionResourceItem_C*     WBP_BB_ConstructionResourceItem;                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TimeRemainingPanel;                                // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          HeaderBorder;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_BulletinBoard_ActiveConstructionItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_BulletinBoard_ActiveConstructionItem_C")
	}
	static class UWBP_BulletinBoard_ActiveConstructionItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BulletinBoard_ActiveConstructionItem_C>();
	}
};
DUMPER7_ASSERTS_UWBP_BulletinBoard_ActiveConstructionItem_C;

SDK_NAMESPACE_END
