#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorldMapIconButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_WorldMapIconButton.WBP_WorldMapIconButton_C.ExecuteUbergraph_WBP_WorldMapIconButton
// 0x0148 (0x0148 - 0x0000)
struct WBP_WorldMapIconButton_C_ExecuteUbergraph_WBP_WorldMapIconButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0008(0x0080)(ConstParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0088(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C0(0x0080)(ConstParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_WorldMapIconButton_C_ExecuteUbergraph_WBP_WorldMapIconButton;

// Function WBP_WorldMapIconButton.WBP_WorldMapIconButton_C.OnMouseEnter
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_WorldMapIconButton_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_WorldMapIconButton_C_OnMouseEnter;

// Function WBP_WorldMapIconButton.WBP_WorldMapIconButton_C.OnMouseLeave
// 0x0080 (0x0080 - 0x0000)
struct WBP_WorldMapIconButton_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_WorldMapIconButton_C_OnMouseLeave;

// Function WBP_WorldMapIconButton.WBP_WorldMapIconButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_WorldMapIconButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_WorldMapIconButton_C_PreConstruct;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
