#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TrackedEvent

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameSystemsPlugin_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_TrackedEvent.WBP_TrackedEvent_C.ExecuteUbergraph_WBP_TrackedEvent
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCommonButtonTextStyles                Temp_struct_Variable;                              // 0x0008(0x0050)(ConstParm)
	class UWBP_NarrativeObjectiveItem_C*          CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_NarrativeObjectiveItem_C*          CallFunc_Create_ReturnValue_1;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Event_AlignmentJoinButton_C*       CallFunc_Create_ReturnValue_2;                     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0098(0x0010)(ConstParm)
	struct FMargin                                Temp_struct_Variable_1;                            // 0x00A8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FDataTableRowHandle                    Temp_struct_Variable_2;                            // 0x00B8(0x0010)(ConstParm, NoDestructor)
};
DUMPER7_ASSERTS_WBP_TrackedEvent_C_ExecuteUbergraph_WBP_TrackedEvent;

// Function WBP_TrackedEvent.WBP_TrackedEvent_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TrackedEvent_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TrackedEvent_C_PreConstruct;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
