#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MayoralAvailableCommissionItem

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_MayoralAvailableCommissionItem.WBP_MayoralAvailableCommissionItem_C
// 0x0030 (0x17D0 - 0x17A0)
class UWBP_MayoralAvailableCommissionItem_C final : public UMayoralAvailableCommissionItem
{
public:
	class UWBP_RewardContainerIcon_C*             WBP_RewardContainerIcon_3;                         // 0x17A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardContainerIcon_C*             WBP_RewardContainerIcon_2;                         // 0x17A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardContainerIcon_C*             WBP_RewardContainerIcon_1;                         // 0x17B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RewardContainerIcon_C*             WBP_RewardContainerIcon;                           // 0x17B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RewardsSection;                                    // 0x17C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          B_AlternatingBG;                                   // 0x17C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UCommonBorder* GetBorder();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_MayoralAvailableCommissionItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_MayoralAvailableCommissionItem_C")
	}
	static class UWBP_MayoralAvailableCommissionItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MayoralAvailableCommissionItem_C>();
	}
};
DUMPER7_ASSERTS_UWBP_MayoralAvailableCommissionItem_C;

SDK_NAMESPACE_END
