#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Subaccordion_NodeRelationships

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Subaccordion_NodeRelationships.WBP_Subaccordion_NodeRelationships_C
// 0x0028 (0x04E8 - 0x04C0)
class UWBP_Subaccordion_NodeRelationships_C final : public UNodeRelationshipsAccordion
{
public:
	class UWBP_ListItem_C*                        WBP_ListItem_3;                                    // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ListItem_C*                        WBP_ListItem_2;                                    // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ListItem_C*                        WBP_ListItem_1;                                    // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ListItem_C*                        WBP_ListItem;                                      // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnreadNotifier;                                    // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UWidget* GetBreadcrumbWidget();
	class UAoCCommonButtonBase* GetButton();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Subaccordion_NodeRelationships_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Subaccordion_NodeRelationships_C")
	}
	static class UWBP_Subaccordion_NodeRelationships_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Subaccordion_NodeRelationships_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Subaccordion_NodeRelationships_C;

SDK_NAMESPACE_END
