#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerHousingDebugUI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_PlayerHousingDebugUI.WBP_PlayerHousingDebugUI_C.BndEvt__PlayerHousingUI_PropListView_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerHousingDebugUI_C_BndEvt__PlayerHousingUI_PropListView_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PlayerHousingDebugUI_C_BndEvt__PlayerHousingUI_PropListView_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature;

// Function WBP_PlayerHousingDebugUI.WBP_PlayerHousingDebugUI_C.ExecuteUbergraph_WBP_PlayerHousingDebugUI
// 0x0048 (0x0048 - 0x0000)
struct WBP_PlayerHousingDebugUI_C_ExecuteUbergraph_WBP_PlayerHousingDebugUI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PlayerHousingDebugUI_C_ExecuteUbergraph_WBP_PlayerHousingDebugUI;

// Function WBP_PlayerHousingDebugUI.WBP_PlayerHousingDebugUI_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_PlayerHousingDebugUI_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PlayerHousingDebugUI_C_Tick;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
