#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ArtisanshipMaterialItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_ArtisanshipMaterialItem.WBP_ArtisanshipMaterialItem_C
// 0x0028 (0x0558 - 0x0530)
class UWBP_ArtisanshipMaterialItem_C final : public UArtisanshipMaterialItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          AlternatingBG;                                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Rarity;                                            // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Have;                                              // 0x0548(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Need;                                              // 0x054C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             MaterialTexture;                                   // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ArtisanshipMaterialItem(int32 EntryPoint);
	class UCommonBorder* GetBorder();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ArtisanshipMaterialItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ArtisanshipMaterialItem_C")
	}
	static class UWBP_ArtisanshipMaterialItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ArtisanshipMaterialItem_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ArtisanshipMaterialItem_C;

SDK_NAMESPACE_END
