#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EnchantingMenu

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_EnchantingMenu.WBP_EnchantingMenu_C
// 0x0030 (0x0908 - 0x08D8)
class UWBP_EnchantingMenu_C final : public UEnchantingMenu
{
public:
	class UWBP_EnchantingDataItem_C*              WBP_EnchantingDataItem_3;                          // 0x08D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EnchantingDataItem_C*              WBP_EnchantingDataItem_2;                          // 0x08E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EnchantingDataItem_C*              WBP_EnchantingDataItem_1;                          // 0x08E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EnchantingDataItem_C*              WBP_EnchantingDataItem;                            // 0x08F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           Ret_OutputItemMask;                                // 0x08F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CurrencySection;                                   // 0x0900(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UPanelWidget* GetBorderContainer();
	TSubclassOf<class UCommonBorderStyle> GetEvenBorderStyle();
	TSubclassOf<class UCommonBorderStyle> GetOddBorderStyle();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_EnchantingMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_EnchantingMenu_C")
	}
	static class UWBP_EnchantingMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EnchantingMenu_C>();
	}
};
DUMPER7_ASSERTS_UWBP_EnchantingMenu_C;

SDK_NAMESPACE_END
