#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CombatTooltipGenerator

#include "Basic.hpp"

#include "GameSystemsPlugin_structs.hpp"
#include "GameSystemsPlugin_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_CombatTooltipGenerator.WBP_CombatTooltipGenerator_C
// 0x0300 (0x0960 - 0x0660)
class UWBP_CombatTooltipGenerator_C final : public UCombatTooltipText
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<struct FGameplayTag, class FText>        TagFormat;                                         // 0x0668(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         TooltipEffectList;                                 // 0x06B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         TooltipAppendEffectList;                           // 0x06C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 RichText;                                          // 0x06D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   PhysicalTag;                                       // 0x06E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FGameplayTag>                   MagicalTag;                                        // 0x06F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FGameplayTag>                   healingTag;                                        // 0x0708(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 descript;                                          // 0x0718(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TSet<int64>                                   TooltipEffects;                                    // 0x0728(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSet<class FName>                             SkipStats;                                         // 0x0778(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int64, int64>                            ContestedStatMap;                                  // 0x07C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int64, int64>                            ContestedStatCurveMap;                             // 0x0818(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSet<int64>                                   AttribStats;                                       // 0x0868(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<ECharacterClass, int64>                  ArchStatInitMap;                                   // 0x08B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, int64>              DmgSubTypeTagStatMap;                              // 0x0908(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddRichTextMarkupToEachLine(const class FString& Input, const class FString& markup, class FString* Output);
	void BuildFinalTooltip(const class FString& txt);
	void CheckSetApplyArgs(class FString& searchStr, bool& Hide, bool& dur, bool& for_0, bool Append, class FString* outStr);
	void CheckSpecificEffectArgs(const class FString& Args, const struct FEffectRecordBase& EffectRecord, class ABaseCharacter* Source, class FString* ret);
	void CheckSpecificLingeringEffectArgs(const class FString& Args, const struct FLingeringEffectRecord& rec, class ABaseCharacter* Source, class FString* Str);
	void Construct();
	void EvalExpressionBool(struct FAoCExpression& Expression, class ABaseCharacter*& Source, class ABaseCharacter*& Target, class ABaseCharacter*& Instigator, class ABaseCharacter*& Owner, bool* Value);
	void EvalExpressionFloat(struct FAoCExpression& Expression, class ABaseCharacter*& Source, class ABaseCharacter*& Target, class ABaseCharacter*& Instigator, class ABaseCharacter*& Owner, double* Value);
	void ExecuteUbergraph_WBP_CombatTooltipGenerator(int32 EntryPoint);
	void FindFormat(TArray<struct FGameplayTag>& Tags, class FText* Format);
	void Get_Stat_Base_By_Init(class AAoCPlayerController* Player, int64 statGuid, int64 statInitGuid, double* base);
	void GetAbilityDescription_Internal(struct FAoCAbilityRecord& Ability, class FString* Description);
	void GetAbilityDescriptionRichText(const struct FAoCAbilityRecord& AbilityDescription, TArray<class FString>* EffectStrings);
	void GetChunks(const class FString& Description, TArray<class FString>* ret);
	void GetChunks_FAST(const class FString& Description, TArray<class FString>* ret);
	void GetDelimRest(const class FString& Str, class FString* Left, class FString* Rest);
	void GetDisplayStat(class UAoCStatsComponent* Stats, const struct FStatTypeDefRecord& StatRecord, double* ret);
	void GetDisplayStatFromRaw(const struct FStatTypeDefRecord& StatRecord, double Raw, double* ret);
	void GetEffectDescriptionRichText(const struct FEffectRecord& EffectRecord, const struct FEffectInstUI& EffectInst, TArray<class FString>* EffectStrings);
	void GetEffectString(class ABaseCharacter* Source, const struct FEffectRecord& Record, const class FString& Args, class FString* Str);
	void GetExpansionDescriptionText(const struct FExpansionRecord& ExpansionRecord);
	void GetGuildEffectDescriptionRichText(const struct FGuildEffectRecord& GuildEffectRecord);
	void GetHitString(class ABaseCharacter* Source, const struct FAbilityHitRecord& Record, const class FString& Args, class FString* Str);
	void GetIndexBetter(const class FString& Str, const class FString& substr, int32* Index_0);
	void GetItemCertificationText(const class FText& Text);
	void GetItemDescriptionText(const struct FItemRecord& ItemRecord);
	void GetPercentValue(double Value, bool isPercent, class FText* Str);
	void GetPowerMult(class UAoCStatsComponent* Stats, TArray<struct FGameplayTag>& hitTags, double* mult);
	void GetRankTooltip(struct FStatFormulaTypeRecord& formula, const class FString& Args, class ABaseCharacter* Source, class FString* outputStr);
	void GetRich(const class FString& Str, TArray<struct FGameplayTag>& Tags, class FString* rich);
	void GetRichPower(const class FString& Str, const class FString& Args, class FString* outStr, bool* has);
	void GetSkillTreeName(const class FString& String, class AActor* Actor, class FString* SkillTreeName);
	void GetStatContested(double RawStatValue, int32 Level, int64 ContestedRatingCurve, double* ContestedValue);
	void GetStatContested_Target(double PercentValue, double PercentValue_Contesting, double* ContestedValue);
	void GetStatDescription(struct FStatTypeDefRecord& Stat);
	void GetStatDescriptionRichText(const struct FStatTypeDefRecord& StatRecord);
	void GetStatModString(class ABaseCharacter* Source, const struct FStatModRecord& Record, const class FString& Args, TArray<struct FGameplayTag>& hitFlags, class FString* Str);
	void GetTimeStr(double Time, bool trim1, class FString* Str);
	void ParseDescription(const class FString& descr, class ABaseCharacter* Source, const struct FEffectRecord& EffectRecord, const struct FAoCAbilityRecord& AbilityRecord, class FString* Output);
	void PreConstruct(bool IsDesignTime);
	void RecurseFindRecord(const class FString& Input, const struct FAoCAbilityRecord& AbilityRecord, const struct FAbilityHitRecord& HitRecord, const struct FEffectRecord& EffectRecord, const struct FStatModRecord& StatModRecord, const struct FLingeringEffectRecord& LingeringEffectRecord, const struct FProjectileRecord& ProjectileRecord, const struct FReactionRecord& ReactionRecord, struct FAbilityHitRecord* Hit, struct FEffectRecord* Effect, struct FStatModRecord* StatMod, struct FLingeringEffectRecord* LingeringEffect, struct FProjectileRecord* Projectile, struct FReactionRecord* Reaction);
	void TranslateAndApplyTextWithItemRecord(const class FText& InText, const struct FItemRecord& ItemRecord);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_CombatTooltipGenerator_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_CombatTooltipGenerator_C")
	}
	static class UWBP_CombatTooltipGenerator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CombatTooltipGenerator_C>();
	}
};
DUMPER7_ASSERTS_UWBP_CombatTooltipGenerator_C;

SDK_NAMESPACE_END
