#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerWarLeaderboard

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_PlayerWarLeaderboard.WBP_PlayerWarLeaderboard_C
// 0x0050 (0x03C8 - 0x0378)
class UWBP_PlayerWarLeaderboard_C final : public UIndividualWarStatsMenu
{
public:
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem_9;                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem_8;                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem_7;                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem_6;                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem_5;                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem_4;                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem_3;                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem_2;                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem_1;                    // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerWarLeaderboardItem_C*        WBP_PlayerWarLeaderboardItem;                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_PlayerWarLeaderboard_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_PlayerWarLeaderboard_C")
	}
	static class UWBP_PlayerWarLeaderboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerWarLeaderboard_C>();
	}
};
DUMPER7_ASSERTS_UWBP_PlayerWarLeaderboard_C;

SDK_NAMESPACE_END
