#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MorphGroupHighLight

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_MorphGroupHighLight.WBP_MorphGroupHighLight_C.ExecuteUbergraph_WBP_MorphGroupHighLight
// 0x0040 (0x0040 - 0x0000)
struct WBP_MorphGroupHighLight_C_ExecuteUbergraph_WBP_MorphGroupHighLight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MorphGroupHighLight_C_ExecuteUbergraph_WBP_MorphGroupHighLight;

// Function WBP_MorphGroupHighLight.WBP_MorphGroupHighLight_C.GetToolTipText_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_MorphGroupHighLight_C_GetToolTipText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class UCharacterCreatorWidgetComponent*       K2Node_DynamicCast_AsCharacter_Creator_Widget_Component; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0020(0x0010)()
};
DUMPER7_ASSERTS_WBP_MorphGroupHighLight_C_GetToolTipText_0;

// Function WBP_MorphGroupHighLight.WBP_MorphGroupHighLight_C.OnMouseButtonUp
// 0x0228 (0x0228 - 0x0000)
struct WBP_MorphGroupHighLight_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0170(0x00B8)()
};
DUMPER7_ASSERTS_WBP_MorphGroupHighLight_C_OnMouseButtonUp;

// Function WBP_MorphGroupHighLight.WBP_MorphGroupHighLight_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_MorphGroupHighLight_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MorphGroupHighLight_C_Tick;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
