#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DamageMeterHealthLog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_DamageMeterHealthLog.WBP_DamageMeterHealthLog_C
// 0x0050 (0x03B8 - 0x0368)
class UWBP_DamageMeterHealthLog_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ScrollWindow_Gradient_C*           WBP_ScrollWindow;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        InstigatorsCB;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HoverText;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           BarVertBox;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DamageMeter_C*                     DamageMeter;                                       // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_DamageMeterHealthLogBar_C*> Bars;                                              // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         HovIndex;                                          // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__DamageMeterHealthLog_InstigatorsCB_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void ClearData();
	void ExecuteUbergraph_WBP_DamageMeterHealthLog(int32 EntryPoint);
	void GetBarAtIndex(int32 Index_0, TArray<class UWBP_DamageMeterHealthLogBar_C*>& Bars_0, class UVerticalBox* Layout, class UWBP_DamageMeterHealthLogBar_C** Bar);
	void Initialize(class UWBP_DamageMeter_C* DamageMeter_0);
	void RebaseBars();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TrimBars(int32 Needed);
	void UpdateBars();
	void UpdateHoverText();
	void UpdateInstigators();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_DamageMeterHealthLog_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_DamageMeterHealthLog_C")
	}
	static class UWBP_DamageMeterHealthLog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DamageMeterHealthLog_C>();
	}
};
DUMPER7_ASSERTS_UWBP_DamageMeterHealthLog_C;

SDK_NAMESPACE_END
