#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JournalAccordion

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_JournalAccordion.WBP_JournalAccordion_C.ExecuteUbergraph_WBP_JournalAccordion
// 0x0020 (0x0020 - 0x0000)
struct WBP_JournalAccordion_C_ExecuteUbergraph_WBP_JournalAccordion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_CustomEvent_Story_Arc_Type_Icon;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Chapter_Text;                   // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_WBP_JournalAccordion_C_ExecuteUbergraph_WBP_JournalAccordion;

// Function WBP_JournalAccordion.WBP_JournalAccordion_C.GetBreadcrumbWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_JournalAccordion_C_GetBreadcrumbWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_JournalAccordion_C_GetBreadcrumbWidget;

// Function WBP_JournalAccordion.WBP_JournalAccordion_C.GetButtonContainer
// 0x0008 (0x0008 - 0x0000)
struct WBP_JournalAccordion_C_GetButtonContainer final
{
public:
	class UPanelWidget*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_JournalAccordion_C_GetButtonContainer;

// Function WBP_JournalAccordion.WBP_JournalAccordion_C.GetEvenButtonStyle
// 0x0008 (0x0008 - 0x0000)
struct WBP_JournalAccordion_C_GetEvenButtonStyle final
{
public:
	TSubclassOf<class UCommonButtonStyle>         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_JournalAccordion_C_GetEvenButtonStyle;

// Function WBP_JournalAccordion.WBP_JournalAccordion_C.GetOddButtonStyle
// 0x0008 (0x0008 - 0x0000)
struct WBP_JournalAccordion_C_GetOddButtonStyle final
{
public:
	TSubclassOf<class UCommonButtonStyle>         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_JournalAccordion_C_GetOddButtonStyle;

// Function WBP_JournalAccordion.WBP_JournalAccordion_C.Set Chapter Text
// 0x0010 (0x0010 - 0x0000)
struct WBP_JournalAccordion_C_Set_Chapter_Text final
{
public:
	class FText                                   Chapter_Text;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_JournalAccordion_C_Set_Chapter_Text;

// Function WBP_JournalAccordion.WBP_JournalAccordion_C.Set Story Arc Type Icon
// 0x0008 (0x0008 - 0x0000)
struct WBP_JournalAccordion_C_Set_Story_Arc_Type_Icon final
{
public:
	class UTexture2D*                             Story_Arc_Type_Icon;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_JournalAccordion_C_Set_Story_Arc_Type_Icon;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
