#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SummonCaravanMenu

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_SummonCaravanMenu.WBP_SummonCaravanMenu_C
// 0x0030 (0x0400 - 0x03D0)
class UWBP_SummonCaravanMenu_C final : public USummonCaravanMenu
{
public:
	class UWBP_SummonCaravanItem_C*               WBP_SummonCaravanItem_5;                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SummonCaravanItem_C*               WBP_SummonCaravanItem_4;                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SummonCaravanItem_C*               WBP_SummonCaravanItem_3;                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SummonCaravanItem_C*               WBP_SummonCaravanItem_2;                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SummonCaravanItem_C*               WBP_SummonCaravanItem_1;                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SummonCaravanItem_C*               WBP_SummonCaravanItem;                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_SummonCaravanMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SummonCaravanMenu_C")
	}
	static class UWBP_SummonCaravanMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SummonCaravanMenu_C>();
	}
};
DUMPER7_ASSERTS_UWBP_SummonCaravanMenu_C;

SDK_NAMESPACE_END
