#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReputationBenefitsTooltip

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_ReputationBenefitsTooltip.WBP_ReputationBenefitsTooltip_C
// 0x0028 (0x03E8 - 0x03C0)
class UWBP_ReputationBenefitsTooltip_C final : public UReputationBenefitsTooltip
{
public:
	class UWBP_ReputationBenefitsTier_C*          WBP_ReputationBenefitsTier_4;                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReputationBenefitsTier_C*          WBP_ReputationBenefitsTier_3;                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReputationBenefitsTier_C*          WBP_ReputationBenefitsTier_2;                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReputationBenefitsTier_C*          WBP_ReputationBenefitsTier_1;                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReputationBenefitsTier_C*          WBP_ReputationBenefitsTier;                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ReputationBenefitsTooltip_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ReputationBenefitsTooltip_C")
	}
	static class UWBP_ReputationBenefitsTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReputationBenefitsTooltip_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ReputationBenefitsTooltip_C;

SDK_NAMESPACE_END
