#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BulletinBoard_Commissions

#include "Basic.hpp"

#include "GameSystemsPlugin_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_BulletinBoard_Commissions.WBP_BulletinBoard_Commissions_C
// 0x0030 (0x0450 - 0x0420)
class UWBP_BulletinBoard_Commissions_C final : public UBulletinBoardCommissions
{
public:
	class UWBP_ScrollWindow_NoFrameNoPadding_C*   WBP_ScrollWindow_NoFrameNoPadding;                 // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BulletinBoard_CommissionBoardOverview_C* WBP_BulletinBoard_CommissionBoardOverview_2; // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BulletinBoard_CommissionBoardOverview_C* WBP_BulletinBoard_CommissionBoardOverview_1; // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BulletinBoard_CommissionBoardOverview_C* WBP_BulletinBoard_CommissionBoardOverview;   // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               CommissionsBox;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonIconButton_C*                    BackButton;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_BulletinBoard_Commissions_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_BulletinBoard_Commissions_C")
	}
	static class UWBP_BulletinBoard_Commissions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BulletinBoard_Commissions_C>();
	}
};
DUMPER7_ASSERTS_UWBP_BulletinBoard_Commissions_C;

SDK_NAMESPACE_END
