#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WwisePackagingRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// Enum WwisePackagingRuntime.EWwiseAssetLibraryRefType
// NumValues: 0x0006
enum class EWwiseAssetLibraryRefType : uint32
{
	Unknown                                  = 0,
	InitBank                                 = 1,
	SoundBank                                = 2,
	Media                                    = 3,
	ExternalSource                           = 4,
	EWwiseAssetLibraryRefType_MAX            = 5,
};

// ScriptStruct WwisePackagingRuntime.WwiseAssetLibraryRef
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FWwiseAssetLibraryRef final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EWwiseAssetLibraryRefType                     Type;                                              // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x000C(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x001C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0020(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LanguageId;                                        // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SoundBankId;                                       // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWwiseAssetLibraryRef;

// ScriptStruct WwisePackagingRuntime.WwiseAssetLibraryInfo
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FWwiseAssetLibraryInfo final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWwiseAssetLibraryInfo;

SDK_NAMESPACE_END
