#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WwiseNiagara

#include "Basic.hpp"

#include "Niagara_classes.hpp"


SDK_NAMESPACE_START

// Class WwiseNiagara.NiagaraDataInterfaceWwiseEvent
// 0x0028 (0x0080 - 0x0058)
class UNiagaraDataInterfaceWwiseEvent final : public UNiagaraDataInterface
{
public:
	class UAkAudioEvent*                          EventToPost;                                       // 0x0058(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<class UAkRtpc*>                        GameParameters;                                    // 0x0060(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	bool                                          bLimitPostsPerTick;                                // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxPostsPerTick;                                   // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopWhenComponentIsDestroyed;                     // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceWwiseEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceWwiseEvent")
	}
	static class UNiagaraDataInterfaceWwiseEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceWwiseEvent>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceWwiseEvent;

SDK_NAMESPACE_END
