#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WwiseAudioLinkRuntime

#include "Basic.hpp"

#include "AkAudio_classes.hpp"
#include "AudioLinkCore_classes.hpp"


SDK_NAMESPACE_START

// Class WwiseAudioLinkRuntime.WwiseAudioLinkComponent
// 0x0030 (0x04D0 - 0x04A0)
class UWwiseAudioLinkComponent final : public UAkComponent
{
public:
	class UWwiseAudioLinkSettings*                Settings;                                          // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class USoundBase*                             Sound;                                             // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	bool                                          bAutoPlay;                                         // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AudioComponent;                                    // 0x04B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_4C0[0x10];                                     // 0x04C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WwiseAudioLinkComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WwiseAudioLinkComponent")
	}
	static class UWwiseAudioLinkComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseAudioLinkComponent>();
	}
};
DUMPER7_ASSERTS_UWwiseAudioLinkComponent;

// Class WwiseAudioLinkRuntime.WwiseAudioLinkSettings
// 0x0050 (0x00A8 - 0x0058)
class UWwiseAudioLinkSettings final : public UAudioLinkSettingsAbstract
{
public:
	TSoftObjectPtr<class UAkAudioEvent>           StartEvent;                                        // 0x0058(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldClearBufferOnReceipt;                       // 0x0080(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ProducerToConsumerBufferRatio;                     // 0x0084(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialSilenceFillRatio;                           // 0x0088(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x14];                                      // 0x008C(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          StartEventResolved;                                // 0x00A0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WwiseAudioLinkSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WwiseAudioLinkSettings")
	}
	static class UWwiseAudioLinkSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseAudioLinkSettings>();
	}
};
DUMPER7_ASSERTS_UWwiseAudioLinkSettings;

SDK_NAMESPACE_END
